{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North/log CovidLongitudinal Korea North 1 Process.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Aug 2023, 09:48:07
{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidLongitudinal Korea North 1 Process.do"
. 
. * Project: Longitudinal assessment of COVID-19 models 
. 
. * Objective: Process the reported deaths by JOHN and 
.         * the estimates by models (DELP, IHME, IMPE, LANL, SRIV, UCLA, YYGU)
.         * for each country ---->> Korea North <<----                                                                 
. ***************************************************************************
. 
. 
. 
. **** "do CovidLongitudinal Korea North 1 Process.do"
. **** Get Daily deaths forecast only: DayDeaMeFo`model'update where `model' is DELP, IHME, IMPE, LANL, SRIV, UCLA, YYGU
. 
. 
. ** input data files: "$pathCovidLongitudinal/download/`model'/`model' countries long.dta"
. **                   "$pathCovidLongitudinal/download/JOHN"
. **                   "$pathCovidLongitudinal/download/`model'"
. 
. ** output data files: "`model' Korea North.dta"
. **                   "ALL MODLES Korea North.dta"
. 
. ** output data dictionary files: "Korea North ALL MODELS update dates data dictionary.csv"
. **                               "`model' Korea North data dictionary.csv"
. **                               "ALL MODLES Korea North data dictionary.csv"
. 
. ** graphs:
. ** "graph 02 Korea North `model' C19 daily deaths all updates.pdf"
. ** "graph 02 Korea North ALL MODELS C19 daily deaths all updates.pdf"
. 
. 
. 
. 
. ************************************************************************
. 
. * get update dates on which country available in each model
. 
. 
. local list IMPE
{txt}
{com}. 
. foreach model of local list {c -(}
{txt}  2{com}. 
.         use "$pathCovidLongitudinal/download/`model'/`model' countries long.dta", clear 
{txt}  3{com}.         
.         di in red "`model'" " Korea North absent update_date_block"
{txt}  4{com}.         
.         qui keep if loc_grand_name == "Korea North"
{txt}  5{com}.         
.         keep if absent == 0
{txt}  6{com}.         
.         gen model = "`model'"
{txt}  7{com}.         
.         order model
{txt}  8{com}.         
.         di "`model'"
{txt}  9{com}.         
.         di in red `r(N)'
{txt} 10{com}.         
.         keep model loc_grand_name absent update_date_block
{txt} 11{com}.         
.         order model loc_grand_name absent update_date_block
{txt} 12{com}.         
.         tostring update_date_block, gen(update_date_block_string)
{txt} 13{com}.         
.         gen slash = " ///"
{txt} 14{com}.         
.         gen update_date_block_slash = update_date_block_string + slash
{txt} 15{com}.         
.         drop slash
{txt} 16{com}.         
.         label var model "epidemic model being studied"
{txt} 17{com}.         
.         label var loc_grand_name "country"
{txt} 18{com}.         
.         label var absent "this country is absent in this model update"
{txt} 19{com}.         
.         label var update_date_block "update date block"
{txt} 20{com}.         
.         label var update_date_block_string "update date block string"
{txt} 21{com}.         
.         label var update_date_block_slash "update date block slash"
{txt} 22{com}. 
.         qui compress
{txt} 23{com}.         
.         save "Korea North `model' update dates.dta", replace
{txt} 24{com}. 
. {c )-}
{err}IMPE Korea North absent update_date_block
{txt}(83 observations deleted)
IMPE

update_date_block_string generated as {res:str8}
{p 0 4 2}
file {bf}
Korea North IMPE update dates.dta{rm}
saved
{p_end}

{com}. *
. 
. 
. 
. 
. 
. 
. use "Korea North IMPE update dates.dta", clear 
{txt}
{com}. 
. local list IMPE
{txt}
{com}. 
. foreach model of local list {c -(}
{txt}  2{com}.         
.         append using "Korea North `model' update dates.dta"
{txt}  3{com}.         
.         duplicates drop
{txt}  4{com}.         
. {c )-}

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(65 observations deleted)

{com}. *
. 
. save "Korea North ALL MODELS update dates.dta", replace
{txt}{p 0 4 2}
file {bf}
Korea North ALL MODELS update dates.dta{rm}
saved
{p_end}

{com}.         
. export excel using "Korea North ALL MODELS update dates.xlsx", replace firstrow(variables) 
{res}{txt}file {bf:Korea North ALL MODELS update dates.xlsx} saved

{com}. 
. 
. 
. ******
. 
. * create data dictionary
. 
. preserve
{txt}
{com}. 
.     describe, replace
{res}{txt}
{com}.         
.     export delimited name varlab using "Korea North ALL MODELS update dates data dictionary.csv", replace 
{res}{txt}file {bf:Korea North ALL MODELS update dates data dictionary.csv} saved

{com}.         
. restore
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. *********************
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. *********************
. * gen calendar file
. 
. clear
{txt}
{com}. 
. di td(01jan2020) // 21915
{res}21915
{txt}
{com}. 
. di td(01jan2024) // 23376
{res}23376
{txt}
{com}. 
. di td(01jan2024) - td(01jan2020) + 1 // 732
{res}1462
{txt}
{com}. 
. 
. 
. set obs 1462
{txt}{p}
Number of observations ({bf:_N}) was 0,
now 1,462.
{p_end}

{com}. 
. gen date = .
{txt}(1,462 missing values generated)

{com}. 
. replace date = 21915 in 1
{txt}(1 real change made)

{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(1,461 real changes made)

{com}. 
. replace date = date[_n-1] + 1 in 2/1462
{txt}(0 real changes made)

{com}. 
. format date %tdDDMonCCYY
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21915{txt},{res}23376{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}01jan2020{txt},{res}01jan2024{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}1,462{col 51}{txt}Missing .: {res}0{txt}/{res}1,462

{txt}{col 19}Mean: {res}{ralign 7:22645.5}{txt} = {res}31dec2021{txt}(+ 12 hours)
{col 14}Std. dev.: {res}{ralign 7:422.187}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22061}{ralign 11:   22280}{ralign 11: 22645.5}{ralign 11:   23011}{ralign 11:   23230}
{col 25}{ralign 9:26may2020}{ralign 11:31dec2020}{ralign 11:31dec2021}{ralign 11:01jan2023}{ralign 11:08aug2023}
{txt}
{com}. 
. save "calendar.dta", replace
{txt}{p 0 4 2}
file {bf}
calendar.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. 
. 
. **************************************************************************
. 
. * JOHN
. 
. cd "$pathCovidLongitudinal/download/JOHN"
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/JOHN
{txt}
{com}. 
. use "CovidLongitudinal JOHN.dta", clear 
{txt}
{com}. 
. keep if loc_grand_name == "Korea North"
{txt}(221,763 observations deleted)

{com}. 
. keep date DayDeaMeSmJOHNPRK
{txt}
{com}. 
. label var date "calendar date"
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. cd "$pathCovidLongitudinal/countries/Korea North"
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}
{com}. 
. save "JOHN Korea North.dta", replace 
{txt}{p 0 4 2}
file {bf}
JOHN Korea North.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. * graph Korea North JOHN daily deaths
. 
. twoway ///
> (line DayDeaMeSmJOHNPRK date, sort lwidth(thick) lcolor(cyan)) ///
> if date >= td(01jan2020) & date <= td(01jan2023) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, labsize(small) angle(forty_five) format(%30.1fc)) ///
> ytitle(Daily deaths) title("C19 daily deaths, Korea North, JOHN", size(medium) color(black)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2))
{res}{txt}
{com}. 
. qui graph export "graph 02 Korea North JOHN C19 daily deaths reported.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. **************************************************************************
. 
. * DELP
. 
. * Korea North not included in DELP
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. **************************************************************************
. 
. * IHME 
. 
. * Korea North not included in IHME
. 
. 
. 
. 
. 
. 
. 
. 
. **************************************************************************
. 
. * IMPE
. 
. local list ///
> 20201025 ///
> 20201028 ///
> 20201101 ///
> 20201110 ///
> 20201114 ///
> 20201118 ///
> 20201123 ///
> 20201129 ///
> 20201204 ///
> 20201212 ///
> 20201220 ///
> 20201226 ///
> 20210104 ///
> 20210110 ///
> 20210112 ///
> 20210118 ///
> 20210124 ///
> 20210130 ///
> 20210203 ///
> 20210210 ///
> 20210217 ///
> 20210226 ///
> 20210305 ///
> 20210312 ///
> 20210319 ///
> 20210329 ///
> 20210406 ///
> 20210417 ///
> 20210424 ///
> 20210510 ///
> 20210516 ///
> 20210522 ///
> 20210527 ///
> 20210604 ///
> 20210611 ///
> 20210618 ///
> 20210626 ///
> 20210702 ///
> 20210709 ///
> 20210719 ///
> 20210806 ///
> 20210819 ///
> 20210825 ///
> 20210909 ///
> 20210924 ///
> 20211006 ///
> 20211021 ///
> 20211027 ///
> 20211103 ///
> 20211115 ///
> 20211121 ///
> 20211129 ///
> 20211205 ///
> 20211213 ///
> 20211226 ///
> 20220102 ///
> 20220120 ///
> 20220131 ///
> 20220315 ///
> 20220530 ///
> 20220703 ///
> 20220712 ///
> 20220728 ///
> 20220808 ///
> 20220901
{txt}
{com}. 
. 
. 
. 
. foreach update of local list {c -(}
{txt}  2{com}. 
.         cd "$pathCovidLongitudinal/download/IMPE"
{txt}  3{com}.         
.         di in red "This is IMPE update " `update'
{txt}  4{com}. 
.         use "IMPE `update'.dta", clear
{txt}  5{com}.                 
.         keep if loc_grand_name == "Korea North"
{txt}  6{com}. 
.         duplicates drop
{txt}  7{com}.                 
.         
.         
.         
.         * gen daily deaths // done in /code/downloads/IMPE/do CovidLongitudinal IMPE.do
.         
.         
.         
.         
.         * smooth
.                 
.         sort date
{txt}  8{com}.                         
.         qui tsset date, daily   
{txt}  9{com}.                         
.         qui tssmooth ma DayDeaMeRaIMPE`update'_window = DayDeaMeRaIMPE`update' if DayDeaMeRaIMPE`update' >= 0, window(3 1 3) 
{txt} 10{com}. 
.         qui tssmooth ma DayDeaMeSmIMPE`update' = DayDeaMeRaIMPE`update'_window, weights( 1 2 3 <4> 3 2 1) replace
{txt} 11{com}. 
.         drop *_window
{txt} 12{com}.         
.         label var DayDeaMeSmIMPE`update' "Daily deaths mean smooth IMPE" 
{txt} 13{com}.         
.         
.         
.         
.         * gen Daily deaths smooth forecast only
.                         
.         clonevar DayDeaMeFoIMPE`update' = DayDeaMeSmIMPE`update' 
{txt} 14{com}.         
.         label var DayDeaMeFoIMPE`update' "Daily deaths smooth mean forecast only IMPE"
{txt} 15{com}.                 
.         gen update_date`update' = date("`update'", "YMD")
{txt} 16{com}.                                 
.         qui replace DayDeaMeFoIMPE`update' = . if date < update_date`update' 
{txt} 17{com}.         
.         
.         
.         capture drop fit_type death_calibrated v1
{txt} 18{com}.         
.         label var loc_grand_name "country"
{txt} 19{com}.         
.         label var date "calendar date"
{txt} 20{com}.         
.         label var DayDeaMeRaIMPE`update' "Daily deaths mean raw IMPE"
{txt} 21{com}.         
.         label var DayDeaMeSmIMPE`update' "Daily deaths mean smooth IMPE"
{txt} 22{com}.         
.         label var DayDeaMeFoIMPE`update' "Daily deaths mean smooth forecast only IMPE"
{txt} 23{com}.         
.         label var update_date`update' "update date"
{txt} 24{com}.         
.         
.         
.         
.         
.         qui compress    
{txt} 25{com}.         
.         cd "$pathCovidLongitudinal/countries/Korea North"
{txt} 26{com}.         
.         save "IMPE `update' Korea North.dta", replace emptyok
{txt} 27{com}.         
.         
.         *
. 
.         
. {c )-}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20201025
{txt}(57,965 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20201025 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20201028
{txt}(58,448 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20201028 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20201101
{txt}(58,754 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20201101 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20201110
{txt}(61,207 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20201110 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20201114
{txt}(61,967 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20201114 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20201118
{txt}(62,457 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20201118 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20201123
{txt}(63,307 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20201123 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20201129
{txt}(64,785 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20201129 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20201204
{txt}(65,651 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20201204 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20201212
{txt}(67,006 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20201212 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20201220
{txt}(68,064 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20201220 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20201226
{txt}(68,714 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20201226 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210104
{txt}(70,849 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210104 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210110
{txt}(72,041 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210110 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210112
{txt}(72,670 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210112 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210118
{txt}(73,667 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210118 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210124
{txt}(74,863 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210124 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210130
{txt}(75,498 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210130 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210203
{txt}(76,002 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210203 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210210
{txt}(77,538 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210210 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210217
{txt}(78,827 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210217 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210226
{txt}(80,343 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210226 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210305
{txt}(81,727 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210305 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210312
{txt}(82,745 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210312 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210319
{txt}(83,966 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210319 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210329
{txt}(85,825 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210329 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210406
{txt}(87,083 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210406 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210417
{txt}(89,312 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210417 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210424
{txt}(90,638 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210424 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210510
{txt}(93,088 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210510 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210516
{txt}(94,284 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210516 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210522
{txt}(95,444 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210522 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210527
{txt}(96,428 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210527 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210604
{txt}(97,998 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210604 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210611
{txt}(99,347 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210611 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210618
{txt}(100,719 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210618 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210626
{txt}(102,233 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210626 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210702
{txt}(103,374 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210702 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210709
{txt}(104,722 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210709 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210719
{txt}(106,620 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210719 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210806
{txt}(109,937 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210806 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210819
{txt}(112,369 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210819 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210825
{txt}(113,502 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210825 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210909
{txt}(116,185 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210909 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20210924
{txt}(118,891 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20210924 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20211006
{txt}(120,676 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20211006 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20211021
{txt}(123,338 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20211021 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20211027
{txt}(124,479 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20211027 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20211103
{txt}(125,488 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20211103 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20211115
{txt}(127,510 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20211115 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20211121
{txt}(129,135 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20211121 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20211129
{txt}(130,528 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20211129 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20211205
{txt}(130,986 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20211205 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20211213
{txt}(130,837 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20211213 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20211226
{txt}(133,767 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20211226 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20220102
{txt}(134,968 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20220102 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20220120
{txt}(115,421 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20220120 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20220131
{txt}(115,406 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20220131 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20220315
{txt}(147,751 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20220315 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20220530
{txt}(144,923 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20220530 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20220703
{txt}(146,235 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20220703 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20220712
{txt}(147,130 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20220712 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20220728
{txt}(150,510 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20220728 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20220808
{txt}(152,499 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20220808 Korea North.dta{rm}
saved
{p_end}
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE
{err}This is IMPE update 20220901
{txt}(154,452 observations deleted)

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(0 observations are duplicates)
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}{p 0 4 2}
file {bf}
IMPE 20220901 Korea North.dta{rm}
saved
{p_end}

{com}. *
. 
. 
. 
. 
. * merge updates
. 
. cd "$pathCovidLongitudinal/countries/Korea North"
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}
{com}. 
. foreach update of local list {c -(}
{txt}  2{com}. 
.         merge m:m date using "IMPE `update' Korea North.dta"
{txt}  3{com}.         
.         drop _merge
{txt}  4{com}. 
. {c )-}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             179
{txt}{col 9}from master{col 30}{res}              89{txt}  (_merge==1)
{col 9}from using{col 30}{res}              90{txt}  (_merge==2)

{col 5}Matched{col 30}{res}               0{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}              95
{txt}{col 9}from master{col 30}{res}              92{txt}  (_merge==1)
{col 9}from using{col 30}{res}               3{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              87{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             100
{txt}{col 9}from master{col 30}{res}              96{txt}  (_merge==1)
{col 9}from using{col 30}{res}               4{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              86{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             114
{txt}{col 9}from master{col 30}{res}             105{txt}  (_merge==1)
{col 9}from using{col 30}{res}               9{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              81{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             113
{txt}{col 9}from master{col 30}{res}             109{txt}  (_merge==1)
{col 9}from using{col 30}{res}               4{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              86{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             117
{txt}{col 9}from master{col 30}{res}             113{txt}  (_merge==1)
{col 9}from using{col 30}{res}               4{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              86{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             123
{txt}{col 9}from master{col 30}{res}             118{txt}  (_merge==1)
{col 9}from using{col 30}{res}               5{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              85{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             130
{txt}{col 9}from master{col 30}{res}             124{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              84{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             134
{txt}{col 9}from master{col 30}{res}             129{txt}  (_merge==1)
{col 9}from using{col 30}{res}               5{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              85{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             145
{txt}{col 9}from master{col 30}{res}             137{txt}  (_merge==1)
{col 9}from using{col 30}{res}               8{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              82{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             153
{txt}{col 9}from master{col 30}{res}             145{txt}  (_merge==1)
{col 9}from using{col 30}{res}               8{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              82{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             157
{txt}{col 9}from master{col 30}{res}             151{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              84{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             169
{txt}{col 9}from master{col 30}{res}             160{txt}  (_merge==1)
{col 9}from using{col 30}{res}               9{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              81{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             172
{txt}{col 9}from master{col 30}{res}             166{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              84{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             170
{txt}{col 9}from master{col 30}{res}             168{txt}  (_merge==1)
{col 9}from using{col 30}{res}               2{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              88{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             180
{txt}{col 9}from master{col 30}{res}             174{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              84{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             186
{txt}{col 9}from master{col 30}{res}             180{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              84{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             192
{txt}{col 9}from master{col 30}{res}             186{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              84{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             194
{txt}{col 9}from master{col 30}{res}             190{txt}  (_merge==1)
{col 9}from using{col 30}{res}               4{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              86{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             204
{txt}{col 9}from master{col 30}{res}             197{txt}  (_merge==1)
{col 9}from using{col 30}{res}               7{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             211
{txt}{col 9}from master{col 30}{res}             204{txt}  (_merge==1)
{col 9}from using{col 30}{res}               7{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             222
{txt}{col 9}from master{col 30}{res}             213{txt}  (_merge==1)
{col 9}from using{col 30}{res}               9{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              81{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             227
{txt}{col 9}from master{col 30}{res}             220{txt}  (_merge==1)
{col 9}from using{col 30}{res}               7{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             234
{txt}{col 9}from master{col 30}{res}             227{txt}  (_merge==1)
{col 9}from using{col 30}{res}               7{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             241
{txt}{col 9}from master{col 30}{res}             234{txt}  (_merge==1)
{col 9}from using{col 30}{res}               7{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             254
{txt}{col 9}from master{col 30}{res}             244{txt}  (_merge==1)
{col 9}from using{col 30}{res}              10{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              80{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             260
{txt}{col 9}from master{col 30}{res}             252{txt}  (_merge==1)
{col 9}from using{col 30}{res}               8{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              82{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             274
{txt}{col 9}from master{col 30}{res}             263{txt}  (_merge==1)
{col 9}from using{col 30}{res}              11{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              79{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             277
{txt}{col 9}from master{col 30}{res}             270{txt}  (_merge==1)
{col 9}from using{col 30}{res}               7{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             303
{txt}{col 9}from master{col 30}{res}             287{txt}  (_merge==1)
{col 9}from using{col 30}{res}              16{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              73{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             299
{txt}{col 9}from master{col 30}{res}             293{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             305
{txt}{col 9}from master{col 30}{res}             299{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             309
{txt}{col 9}from master{col 30}{res}             304{txt}  (_merge==1)
{col 9}from using{col 30}{res}               5{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              84{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             320
{txt}{col 9}from master{col 30}{res}             312{txt}  (_merge==1)
{col 9}from using{col 30}{res}               8{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              81{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             326
{txt}{col 9}from master{col 30}{res}             319{txt}  (_merge==1)
{col 9}from using{col 30}{res}               7{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              82{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             333
{txt}{col 9}from master{col 30}{res}             326{txt}  (_merge==1)
{col 9}from using{col 30}{res}               7{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              82{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             342
{txt}{col 9}from master{col 30}{res}             334{txt}  (_merge==1)
{col 9}from using{col 30}{res}               8{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              81{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             346
{txt}{col 9}from master{col 30}{res}             340{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             354
{txt}{col 9}from master{col 30}{res}             347{txt}  (_merge==1)
{col 9}from using{col 30}{res}               7{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              82{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             367
{txt}{col 9}from master{col 30}{res}             357{txt}  (_merge==1)
{col 9}from using{col 30}{res}              10{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              79{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             393
{txt}{col 9}from master{col 30}{res}             375{txt}  (_merge==1)
{col 9}from using{col 30}{res}              18{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              71{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             401
{txt}{col 9}from master{col 30}{res}             388{txt}  (_merge==1)
{col 9}from using{col 30}{res}              13{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              76{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             400
{txt}{col 9}from master{col 30}{res}             394{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             424
{txt}{col 9}from master{col 30}{res}             409{txt}  (_merge==1)
{col 9}from using{col 30}{res}              15{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              74{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             439
{txt}{col 9}from master{col 30}{res}             424{txt}  (_merge==1)
{col 9}from using{col 30}{res}              15{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              74{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             448
{txt}{col 9}from master{col 30}{res}             436{txt}  (_merge==1)
{col 9}from using{col 30}{res}              12{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              77{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             466
{txt}{col 9}from master{col 30}{res}             451{txt}  (_merge==1)
{col 9}from using{col 30}{res}              15{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              74{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             463
{txt}{col 9}from master{col 30}{res}             457{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             471
{txt}{col 9}from master{col 30}{res}             464{txt}  (_merge==1)
{col 9}from using{col 30}{res}               7{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              82{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             488
{txt}{col 9}from master{col 30}{res}             476{txt}  (_merge==1)
{col 9}from using{col 30}{res}              12{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              77{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             488
{txt}{col 9}from master{col 30}{res}             482{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             498
{txt}{col 9}from master{col 30}{res}             490{txt}  (_merge==1)
{col 9}from using{col 30}{res}               8{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              81{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             502
{txt}{col 9}from master{col 30}{res}             496{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             512
{txt}{col 9}from master{col 30}{res}             504{txt}  (_merge==1)
{col 9}from using{col 30}{res}               8{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              81{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             530
{txt}{col 9}from master{col 30}{res}             517{txt}  (_merge==1)
{col 9}from using{col 30}{res}              13{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              76{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             531
{txt}{col 9}from master{col 30}{res}             524{txt}  (_merge==1)
{col 9}from using{col 30}{res}               7{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              82{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             560
{txt}{col 9}from master{col 30}{res}             542{txt}  (_merge==1)
{col 9}from using{col 30}{res}              18{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              71{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             564
{txt}{col 9}from master{col 30}{res}             553{txt}  (_merge==1)
{col 9}from using{col 30}{res}              11{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              78{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             639
{txt}{col 9}from master{col 30}{res}             596{txt}  (_merge==1)
{col 9}from using{col 30}{res}              43{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              46{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             678
{txt}{col 9}from master{col 30}{res}             602{txt}  (_merge==1)
{col 9}from using{col 30}{res}              76{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              83{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             682
{txt}{col 9}from master{col 30}{res}             677{txt}  (_merge==1)
{col 9}from using{col 30}{res}               5{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              84{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             677
{txt}{col 9}from master{col 30}{res}             677{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              89{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             677
{txt}{col 9}from master{col 30}{res}             677{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              89{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             677
{txt}{col 9}from master{col 30}{res}             677{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              89{txt}  (_merge==3)
{col 5}{hline 41}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             677
{txt}{col 9}from master{col 30}{res}             677{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}              89{txt}  (_merge==3)
{col 5}{hline 41}

{com}. *       
. 
. 
. capture drop fit_type death_calibrated v1 // IMPE extra vars 
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "IMPE Korea North.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE Korea North.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. * add JOHN
. 
. merge m:1 date using "JOHN Korea North.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             377
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             377{txt}  (_merge==2)

{col 5}Matched{col 30}{res}             766{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
.         drop if date < td(01jan2020)
{txt}(0 observations deleted)

{com}. 
.         drop if date > td(01jan2023) 
{txt}(67 observations deleted)

{com}. 
. qui compress
{txt}
{com}. 
. save "IMPE Korea North.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE Korea North.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. ******
. 
. * create data dictionary
. 
. preserve
{txt}
{com}. 
.     describe, replace
{res}{txt}
{com}.         
.     export delimited name varlab using "IMPE Korea North data dictionary.csv", replace 
{res}{txt}file {bf:IMPE Korea North data dictionary.csv} saved

{com}.         
. restore
{txt}
{com}. 
. 
. 
. 
. /* foreach update of local list {c -(}
>         
>         * graph Korea North IMPE daily deaths each update 
>         
>         twoway ///
>         (line DayDeaMeSmJOHNPRK date, sort lwidth(thick) lcolor(cyan)) ///      
>         (line DayDeaMeFoIMPE`update' date, sort lwidth(thin) lcolor(magenta)) /// 
>         if date >= td(01Jan2020) & date <= td(01Jan2023) ///
>         , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, labsize(small) angle(forty_five) format(%30.0fc)) ///
>         ytitle(Daily deaths) title("C19 daily deaths, IMPE, update `update'", size(medium) color(black)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
>         subtitle("Korea North, forecast only") legend(position(6) order(1 "JOHN" 2 "IMPE forecast ") rows(1) size(small)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
>         
>         qui graph export "graph 01 Korea North IMPE daily deaths update `update'.pdf", replace  
> 
> {c )-}
> */
. 
. 
. 
. 
. * graph Korea North IMPE daily deaths all updates
. 
. twoway ///
> (line DayDeaMeSmJOHNPRK date, sort lwidth(thick) lcolor(cyan)) /// 
> (line DayDeaMeFoIMPE20201025 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201028 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201101 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201110 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201114 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201118 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201123 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201129 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201204 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201212 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201220 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201226 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210104 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210110 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210112 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210118 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210124 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210130 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210203 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210210 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210217 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210226 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210305 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210312 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210319 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210329 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210406 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210417 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210424 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210510 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210516 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210522 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210527 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210604 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210611 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210618 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210626 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210702 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210709 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210719 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210806 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210819 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210825 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210909 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210924 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211006 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211021 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211027 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211103 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211115 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211121 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211129 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211205 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211213 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211226 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220102 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220120 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220131 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220315 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220530 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220703 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220712 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220728 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220808 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220901 date, sort lwidth(thin) lcolor(magenta)) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, labsize(small) angle(forty_five) format(%30.0fc)) ///
> ytitle(Daily deaths) title("C19 daily deaths, Korea North, IMPE, all updates", size(medium) color(black)) ///
> legend(position(6) order(1 "JOHN" 2 "IMPE forecast ") rows(1) size(small)) legend(region(lcolor(none))) legend(bexpand) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2))
{res}{txt}
{com}. 
. qui graph export "graph 02 Korea North IMPE C19 daily deaths all updates.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. **************************************************************************
. 
. * LANL
. 
. * Korea North not included in LANL
. 
. 
. 
. 
. **************************************************************************
. 
. * SRIV
. 
. * Korea North not included in SRIV
. 
. 
. 
. 
. **************************************************************************
. 
. * UCLA
. * Korea North not included in UCLA
. 
. 
. 
. **************************************************************************
. 
. * YYGU
. * Korea North not included in YYGU
. 
. 
. 
. 
. 
. 
. 
. 
. *************************************************************
. 
. * merge models
. 
. local list IMPE 
{txt}
{com}. 
. use "IMPE Korea North.dta", clear
{txt}
{com}. 
. foreach model of local list {c -(}
{txt}  2{com}. 
.         merge m:m date loc_grand_name using "`model' Korea North.dta", force
{txt}  3{com}.         
.         drop _merge
{txt}  4{com}.         
.         isid date loc_grand_name, missok
{txt}  5{com}.         
. {c )-}
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}           1,076{txt}  (_merge==3)
{col 5}{hline 41}

{com}. *
. 
. qui compress
{txt}
{com}. 
. save "ALL MODLES Korea North.dta", replace
{txt}{p 0 4 2}
file {bf}
ALL MODLES Korea North.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ******
. 
. * create data dictionary
. 
. preserve
{txt}
{com}. 
.     describe, replace
{res}{txt}
{com}.         
.     export delimited name varlab using "ALL MODLES Korea North data dictionary.csv", replace 
{res}{txt}file {bf:ALL MODLES Korea North data dictionary.csv} saved

{com}.         
. restore
{txt}
{com}. 
.         
. 
.         
. 
. 
. * graph Korea North ALL MODELS daily deaths all updates
. 
. twoway ///
> (line DayDeaMeFoIMPE20201025 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201028 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201101 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201110 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201114 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201118 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201123 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201129 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201204 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201212 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201220 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20201226 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210104 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210110 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210112 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210118 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210124 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210130 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210203 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210210 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210217 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210226 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210305 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210312 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210319 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210329 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210406 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210417 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210424 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210510 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210516 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210522 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210527 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210604 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210611 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210618 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210626 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210702 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210709 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210719 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210806 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210819 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210825 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210909 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20210924 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211006 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211021 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211027 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211103 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211115 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211121 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211129 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211205 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211213 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20211226 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220102 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220120 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220131 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220315 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220530 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220703 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220712 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220728 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220808 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeFoIMPE20220901 date, sort lwidth(thin) lcolor(magenta)) ///
> (line DayDeaMeSmJOHNPRK date, sort lwidth(thick) lcolor(cyan)) /// 
> if date >= td(01jan2020) & date <= td(01jan2023) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, labsize(small) angle(forty_five) format(%30.0fc)) ///
> ytitle(Daily deaths) title("C19 daily deaths, Korea North, all models, all updates, forecast only", size(medium) color(black)) ///
> legend(position(6) order(66 "JOHN" 1 "IMPE") ///
> rows(1) size(small)) legend(region(lcolor(none))) legend(bexpand) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2))
{res}{txt}
{com}. 
. qui graph export "graph 02 Korea North ALL MODELS C19 daily deaths all updates.pdf", replace
{txt}
{com}. 
.         
. 
. 
. 
. 
. 
. 
. cd "$pathCovidLongitudinal/countries/Korea North"
{res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North
{txt}
{com}. 
. 
. view "log CovidLongitudinal Korea North 1 Process.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/countries/Korea North/log CovidLongitudinal Korea North 1 Process.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}15 Aug 2023, 09:48:19
{txt}{.-}
{smcl}
{txt}{sf}{ul off}