{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/Iran/code/IMPE/log CovidLongitudinal IMPE 1a.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 May 2022, 16:05:26
{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidLongitudinal IMPE 1a.do"
. 
. * Project: Longitudinal assessment of COVID-19 models                                                                         
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. ***************************************************************************
. 
. 
. * download estimates files - part 1 of 2 - 2020 (from 2020 and 2021)
. * input data files: csv files on web site
. * output data files: "IMPE `update'.dta" 
. 
. 
. 
. 
. /*
> 
> 94 updates (2020 and 2021)
> 
> 
> copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-06-14_v4.csv.zip 2020-06-14_v4.csv.zip
> 
> list1 ///
> 2020-06-14_v4.csv.zip
> 2020-06-16_v4.csv.zip ///
> 2020-06-19_v4.csv.zip ///
> 2020-06-23_v4.csv.zip ///
> 2020-07-02_v4.csv.zip ///
> 2020-07-03_v4.csv.zip ///
> 2020-07-04_v4.csv.zip ///
> 2020-07-07_v4.csv.zip ///
> 2020-07-11_v4.csv.zip ///
> 2020-07-14_v4.csv.zip ///
> 2020-07-15_v4.csv.zip ///
> 2020-07-18_v4.csv.zip ///
> 2020-07-20_v4.csv.zip ///
> 2020-07-22_v4.csv.zip ///
> 2020-07-25_v4.csv.zip ///
> 2020-07-27_v4.csv.zip ///
> 2020-07-31_v4.csv.zip ///
> 2020-08-08_v5.csv.zip ///
> 2020-08-10_v5.csv.zip ///
> 2020-08-11_v5.csv.zip ///
> 2020-08-13_v5.csv.zip ///
> 2020-08-14_v5.csv.zip ///
> 2020-08-17_v5.csv.zip ///
> 2020-08-23_v5.csv.zip ///
> 2020-08-25_v5.csv.zip ///
> 2020-08-27_v5.csv.zip ///
> 2020-08-31_v5.csv.zip ///
> 2020-09-02_v5.csv.zip ///
> 2020-09-06_v5.csv.zip ///
> 2020-09-08_v5.csv.zip ///
> 2020-09-12_v5.csv.zip ///
> 2020-09-15_v5.csv.zip ///
> 2020-09-19_v5.csv.zip ///
> 2020-09-23_v5.csv.zip ///
> 2020-09-25_v5.csv.zip ///
> 2020-10-03_v5.csv.zip ///
> 2020-10-06_v5.csv.zip ///
> 2020-10-12_v5.csv.zip ///
> 2020-10-19_v5.csv.zip ///
> 2020-10-25_v5.csv.zip ///
> 2020-10-28_v5.csv.zip ///
> 2020-11-01_v5.csv.zip ///
> 2020-11-10_v6.csv.zip ///
> 2020-11-14_v6.csv.zip ///
> 2020-11-18_v6.csv.zip ///
> 2020-11-23_v6.csv.zip ///
> 2020-11-29_v6.csv.zip ///
> 2020-12-04_v6.csv.zip ///
> 2020-12-12_v6.csv.zip ///
> 2020-12-20_v6.csv.zip ///
> 2020-12-26_v6.csv.zip ///
> 
> 2021-01-04_v6.csv.zip ///
> 2021-01-10_v6.csv.zip ///
> 2021-01-12_v6.csv.zip ///
> 2021-01-18_v7.csv.zip ///
> 2021-01-24_v7.csv.zip ///
> 2021-01-30_v7.csv.zip ///
> 2021-02-03_v7.csv.zip ///
> 2021-02-10_v7.csv.zip ///
> 2021-02-17_v7.csv.zip ///
> 2021-02-26_v7.csv.zip ///
> 2021-03-05_v7.csv.zip ///
> 2021-03-12_v7.csv.zip ///
> 2021-03-19_v7.csv.zip ///
> 2021-03-29_v7.csv.zip ///
> 2021-04-06_v7.csv.zip ///
> 2021-04-17_v7.csv.zip ///
> 2021-04-24_v7.csv.zip ///
> 2021-05-10_v8.csv.zip ///
> 2021-05-16_v8.csv.zip ///
> 2021-05-22_v8.csv.zip ///
> 2021-05-27_v8.csv.zip ///
> 2021-06-04_v8.csv.zip ///
> 2021-06-11_v8.csv.zip ///
> 2021-06-18_v8.csv.zip ///
> 2021-06-26_v8.csv.zip ///
> 2021-07-02_v8.csv.zip ///
> 2021-07-09_v8.csv.zip ///
> 2021-07-19_v8.csv.zip ///
> 2021-08-06_v8.csv.zip ///
> 2021-08-19_v8.csv.zip ///
> 2021-08-25_v8.csv.zip ///
> 2021-09-09_v8.csv.zip ///
> 2021-09-24_v8.csv.zip ///
> 2021-10-06_v8.csv.zip ///
> 2021-10-21_v8.csv.zip ///
> 2021-10-27_v8.csv.zip ///
> 2021-11-03_v9.csv.zip ///
> 2021-11-15_v9.csv.zip ///
> 2021-11-21_v9.csv.zip ///
> 2021-11-29_v9.csv.zip ///
> 2021-12-05_v9.csv.zip ///
> 2021-12-13_v9.csv.zip ///
> 2021-12-26_v9.csv.zip 
> 
> 
> */
. 
. 
. * update 2020-06-14 20200614
. 
. ******************************
. 
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-06-14_v4.csv.zip 2020-06-14_v4.csv.zip
{txt}
{com}. unzipfile 2020-06-14_v4.csv.zip, replace
{res}{txt}    inflating: 2020-06-14_v4.csv
successfully unzipped 2020-06-14_v4.csv.zip to current directory

{com}. erase 2020-06-14_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-06-14_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 1,827,621 obs)

{com}. 
. keep if country == "$country"
{txt}(1,813,665 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(11,626 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,071 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21911{txt},{res}22169{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}28dec2019{txt},{res}11sep2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}259{col 51}{txt}missing .:  {res}0{txt}/{res}259

{txt}{col 19}mean:{res}{col 26}   22040{txt} = {res}05may2020{txt}
{col 15}std. dev:{res}{col 26} 74.9111

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21936{col 37}   21975{col 47}   22040{col 57}   22105{col 67}   22144
{col 26}22jan2020{col 36}01mar2020{col 46}05may2020{col 56}09jul2020{col 66}17aug2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200614
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200614.dta", replace
{txt}(note: file IMPE 20200614.dta not found)
file IMPE 20200614.dta saved

{com}. 
. 
. shell rm -r "2020-06-14_v4.csv" 
{txt}

{com}. 
. ******
. 
. *
. 
. 
. 
. 
. 
.  
. * update 2020-06-16 20200616
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-06-16_v4.csv.zip 2020-06-16_v4.csv.zip
{txt}
{com}. unzipfile 2020-06-16_v4.csv.zip, replace
{res}{txt}    inflating: 2020-06-16_v4.csv
successfully unzipped 2020-06-16_v4.csv.zip to current directory

{com}. erase 2020-06-16_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-06-16_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 1,856,454 obs)

{com}. 
. keep if country == "$country"
{txt}(1,842,471 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(11,653 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,071 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21913{txt},{res}22171{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}30dec2019{txt},{res}13sep2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}259{col 51}{txt}missing .:  {res}0{txt}/{res}259

{txt}{col 19}mean:{res}{col 26}   22042{txt} = {res}07may2020{txt}
{col 15}std. dev:{res}{col 26} 74.9111

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21938{col 37}   21977{col 47}   22042{col 57}   22107{col 67}   22146
{col 26}24jan2020{col 36}03mar2020{col 46}07may2020{col 56}11jul2020{col 66}19aug2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200616
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200616.dta", replace
{txt}(note: file IMPE 20200616.dta not found)
file IMPE 20200616.dta saved

{com}. 
. 
. shell rm -r "2020-06-16_v4.csv" 
{txt}

{com}. 
. ******
. 
. *
. 
. 
. 
. 
. 
. *
. 
. * update 2020-06-19 20200619
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-06-19_v4.csv.zip 2020-06-19_v4.csv.zip
{txt}
{com}. unzipfile 2020-06-19_v4.csv.zip, replace
{res}{txt}    inflating: 2020-06-19_v4.csv
successfully unzipped 2020-06-19_v4.csv.zip to current directory

{com}. erase 2020-06-19_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-06-19_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 1,866,906 obs)

{com}. 
. keep if country == "$country"
{txt}(1,853,004 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(11,581 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,063 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21917{txt},{res}22174{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}03jan2020{txt},{res}16sep2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}258{col 51}{txt}missing .:  {res}0{txt}/{res}258

{txt}{col 19}mean:{res}{col 26} 22045.5{txt} = {res}10may2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 74.6224

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21942{col 37}   21981{col 47} 22045.5{col 57}   22110{col 67}   22149
{col 26}28jan2020{col 36}07mar2020{col 46}10may2020{col 56}14jul2020{col 66}22aug2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200619
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200619.dta", replace
{txt}(note: file IMPE 20200619.dta not found)
file IMPE 20200619.dta saved

{com}. 
. 
. shell rm -r "2020-06-19_v4.csv" 
{txt}

{com}. 
. ******
. 
. *
. 
. 
. 
. 
. 
. 
. *
. 
. * update 2020-06-23 20200623
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-06-23_v4.csv.zip 2020-06-23_v4.csv.zip
{txt}
{com}. unzipfile 2020-06-23_v4.csv.zip, replace
{res}{txt}    inflating: 2020-06-23_v4.csv
successfully unzipped 2020-06-23_v4.csv.zip to current directory

{com}. erase 2020-06-23_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-06-23_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 1,911,264 obs)

{com}. 
. keep if country == "$country"
{txt}(1,897,092 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(11,806 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,103 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21916{txt},{res}22178{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}02jan2020{txt},{res}20sep2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}263{col 51}{txt}missing .:  {res}0{txt}/{res}263

{txt}{col 19}mean:{res}{col 26}   22047{txt} = {res}12may2020{txt}
{col 15}std. dev:{res}{col 26} 76.0658

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21942{col 37}   21981{col 47}   22047{col 57}   22113{col 67}   22152
{col 26}28jan2020{col 36}07mar2020{col 46}12may2020{col 56}17jul2020{col 66}25aug2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200623
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200623.dta", replace
{txt}(note: file IMPE 20200623.dta not found)
file IMPE 20200623.dta saved

{com}. 
. 
. shell rm -r "2020-06-23_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-07-02 20200702
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-02_v4.csv.zip 2020-07-02_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-02_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-02_v4.csv
successfully unzipped 2020-07-02_v4.csv.zip to current directory

{com}. erase 2020-07-02_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-02_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 1,995,312 obs)

{com}. 
. keep if country == "$country"
{txt}(1,980,384 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(12,445 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,207 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21912{txt},{res}22187{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}29dec2019{txt},{res}29sep2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}276{col 51}{txt}missing .:  {res}0{txt}/{res}276

{txt}{col 19}mean:{res}{col 26} 22049.5{txt} = {res}14may2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 79.8185

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21939{col 37} 21980.5{col 47} 22049.5{col 57} 22118.5{col 67}   22160
{col 26}25jan2020{col 36}06mar2020{col 46}14may2020{col 56}22jul2020{col 66}02sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200702
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200702.dta", replace
{txt}(note: file IMPE 20200702.dta not found)
file IMPE 20200702.dta saved

{com}. 
. 
. shell rm -r "2020-07-02_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-07-03 20200703
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-03_v4.csv.zip 2020-07-03_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-03_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-03_v4.csv
successfully unzipped 2020-07-03_v4.csv.zip to current directory

{com}. erase 2020-07-03_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-03_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 2,002,899 obs)

{com}. 
. keep if country == "$country"
{txt}(1,987,998 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(12,427 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,199 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21914{txt},{res}22188{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}31dec2019{txt},{res}30sep2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}275{col 51}{txt}missing .:  {res}0{txt}/{res}275

{txt}{col 19}mean:{res}{col 26}   22051{txt} = {res}16may2020{txt}
{col 15}std. dev:{res}{col 26} 79.5299

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21941{col 37}   21982{col 47}   22051{col 57}   22120{col 67}   22161
{col 26}27jan2020{col 36}08mar2020{col 46}16may2020{col 56}24jul2020{col 66}03sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200703
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200703.dta", replace
{txt}(note: file IMPE 20200703.dta not found)
file IMPE 20200703.dta saved

{com}. 
. 
. shell rm -r "2020-07-03_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-07-04 20200704
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-04_v4.csv.zip 2020-07-04_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-04_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-04_v4.csv
successfully unzipped 2020-07-04_v4.csv.zip to current directory

{com}. erase 2020-07-04_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-04_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 2,010,972 obs)

{com}. 
. keep if country == "$country"
{txt}(1,996,260 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(12,265 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,175 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21918{txt},{res}22189{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}04jan2020{txt},{res}01oct2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}272{col 51}{txt}missing .:  {res}0{txt}/{res}272

{txt}{col 19}mean:{res}{col 26} 22053.5{txt} = {res}18may2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 78.6638

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21945{col 37} 21985.5{col 47} 22053.5{col 57} 22121.5{col 67}   22162
{col 26}31jan2020{col 36}11mar2020{col 46}18may2020{col 56}25jul2020{col 66}04sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200704
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200704.dta", replace
{txt}(note: file IMPE 20200704.dta not found)
file IMPE 20200704.dta saved

{com}. 
. 
. shell rm -r "2020-07-04_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-07-07 20200707
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-07_v4.csv.zip 2020-07-07_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-07_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-07_v4.csv
successfully unzipped 2020-07-07_v4.csv.zip to current directory

{com}. erase 2020-07-07_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-07_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 2,019,588 obs)

{com}. 
. keep if country == "$country"
{txt}(2,004,606 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(12,481 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,223 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22192{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}04oct2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}278{col 51}{txt}missing .:  {res}0{txt}/{res}278

{txt}{col 19}mean:{res}{col 26} 22053.5{txt} = {res}18may2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 80.3959

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21942{col 37}   21984{col 47} 22053.5{col 57}   22123{col 67}   22165
{col 26}28jan2020{col 36}10mar2020{col 46}18may2020{col 56}27jul2020{col 66}07sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200707
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200707.dta", replace
{txt}(note: file IMPE 20200707.dta not found)
file IMPE 20200707.dta saved

{com}. 
. 
. shell rm -r "2020-07-04.csv" 
{txt}
rm: 2020-07-04.csv: No such file or directory

{com}. 
. ******
. 
. 
. 
. * update 2020-07-11 20200711
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-11_v4.csv.zip 2020-07-11_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-11_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-11_v4.csv
successfully unzipped 2020-07-11_v4.csv.zip to current directory

{com}. erase 2020-07-11_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-11_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 2,053,443 obs)

{com}. 
. keep if country == "$country"
{txt}(2,038,434 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(12,490 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,239 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21917{txt},{res}22196{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}03jan2020{txt},{res}08oct2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}280{col 51}{txt}missing .:  {res}0{txt}/{res}280

{txt}{col 19}mean:{res}{col 26} 22056.5{txt} = {res}21may2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 80.9732

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 21944.5{col 37} 21986.5{col 47} 22056.5{col 57} 22126.5{col 67} 22168.5
{col 26}30jan2020{col 36}12mar2020{col 46}21may2020{col 56}30jul2020{col 66}10sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200711
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200711.dta", replace
{txt}(note: file IMPE 20200711.dta not found)
file IMPE 20200711.dta saved

{com}. 
. 
. shell rm -r "2020-07-11_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-07-14 20200714
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-14_v4.csv.zip 2020-07-14_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-14_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-14_v4.csv
successfully unzipped 2020-07-14_v4.csv.zip to current directory

{com}. erase 2020-07-14_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-14_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 2,106,816 obs)

{com}. 
. keep if country == "$country"
{txt}(2,091,564 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(12,706 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,263 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21917{txt},{res}22199{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}03jan2020{txt},{res}11oct2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}283{col 51}{txt}missing .:  {res}0{txt}/{res}283

{txt}{col 19}mean:{res}{col 26}   22058{txt} = {res}23may2020{txt}
{col 15}std. dev:{res}{col 26} 81.8393

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21945{col 37}   21987{col 47}   22058{col 57}   22129{col 67}   22171
{col 26}31jan2020{col 36}13mar2020{col 46}23may2020{col 56}02aug2020{col 66}13sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200714
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200714.dta", replace
{txt}(note: file IMPE 20200714.dta not found)
file IMPE 20200714.dta saved

{com}. 
. 
. shell rm -r "2020-07-14_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-07-15 20200715
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-15_v4.csv.zip 2020-07-15_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-15_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-15_v4.csv
successfully unzipped 2020-07-15_v4.csv.zip to current directory

{com}. erase 2020-07-15_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-15_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 2,115,618 obs)

{com}. 
. keep if country == "$country"
{txt}(2,100,231 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(12,814 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,287 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22200{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}12oct2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}286{col 51}{txt}missing .:  {res}0{txt}/{res}286

{txt}{col 19}mean:{res}{col 26} 22057.5{txt} = {res}22may2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 82.7053

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21943{col 37}   21986{col 47} 22057.5{col 57}   22129{col 67}   22172
{col 26}29jan2020{col 36}12mar2020{col 46}22may2020{col 56}02aug2020{col 66}14sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200715
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200715.dta", replace
{txt}(note: file IMPE 20200715.dta not found)
file IMPE 20200715.dta saved

{com}. 
. 
. shell rm -r "2020-07-15_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-07-18 20200718
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-18_v4.csv.zip 2020-07-18_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-18_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-18_v4.csv
successfully unzipped 2020-07-18_v4.csv.zip to current directory

{com}. erase 2020-07-18_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-18_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 2,140,269 obs)

{com}. 
. keep if country == "$country"
{txt}(2,124,558 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(13,084 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,335 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21912{txt},{res}22203{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}29dec2019{txt},{res}15oct2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}292{col 51}{txt}missing .:  {res}0{txt}/{res}292

{txt}{col 19}mean:{res}{col 26} 22057.5{txt} = {res}22may2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 84.4374

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21941{col 37} 21984.5{col 47} 22057.5{col 57} 22130.5{col 67}   22174
{col 26}27jan2020{col 36}10mar2020{col 46}22may2020{col 56}03aug2020{col 66}16sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200718
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200718.dta", replace
{txt}(note: file IMPE 20200718.dta not found)
file IMPE 20200718.dta saved

{com}. 
. 
. shell rm -r "2020-07-18_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-07-20 20200720
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-20_v4.csv.zip 2020-07-20_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-20_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-20_v4.csv
successfully unzipped 2020-07-20_v4.csv.zip to current directory

{com}. erase 2020-07-20_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-20_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 2,155,392 obs)

{com}. 
. keep if country == "$country"
{txt}(2,139,708 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(13,066 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,327 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22205{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}17oct2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}291{col 51}{txt}missing .:  {res}0{txt}/{res}291

{txt}{col 19}mean:{res}{col 26}   22060{txt} = {res}25may2020{txt}
{col 15}std. dev:{res}{col 26} 84.1487

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21944{col 37}   21987{col 47}   22060{col 57}   22133{col 67}   22176
{col 26}30jan2020{col 36}13mar2020{col 46}25may2020{col 56}06aug2020{col 66}18sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200720
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200720.dta", replace
{txt}(note: file IMPE 20200720.dta not found)
file IMPE 20200720.dta saved

{com}. 
. 
. shell rm -r "2020-07-20_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-07-22 20200722
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-22_v4.csv.zip 2020-07-22_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-22_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-22_v4.csv
successfully unzipped 2020-07-22_v4.csv.zip to current directory

{com}. erase 2020-07-22_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-22_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 2,174,073 obs)

{com}. 
. keep if country == "$country"
{txt}(2,158,254 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(13,183 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,343 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22207{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}19oct2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}293{col 51}{txt}missing .:  {res}0{txt}/{res}293

{txt}{col 19}mean:{res}{col 26}   22061{txt} = {res}26may2020{txt}
{col 15}std. dev:{res}{col 26}  84.726

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21944{col 37}   21988{col 47}   22061{col 57}   22134{col 67}   22178
{col 26}30jan2020{col 36}14mar2020{col 46}26may2020{col 56}07aug2020{col 66}20sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200722
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200722.dta", replace
{txt}(note: file IMPE 20200722.dta not found)
file IMPE 20200722.dta saved

{com}. 
. 
. shell rm -r "2020-07-22_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-07-25 20200725
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-25_v4.csv.zip 2020-07-25_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-25_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-25_v4.csv
successfully unzipped 2020-07-25_v4.csv.zip to current directory

{com}. erase 2020-07-25_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-25_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 2,206,821 obs)

{com}. 
. keep if country == "$country"
{txt}(2,190,624 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(13,489 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,407 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21910{txt},{res}22210{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}27dec2019{txt},{res}22oct2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}301{col 51}{txt}missing .:  {res}0{txt}/{res}301

{txt}{col 19}mean:{res}{col 26}   22060{txt} = {res}25may2020{txt}
{col 15}std. dev:{res}{col 26} 87.0354

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21940{col 37}   21985{col 47}   22060{col 57}   22135{col 67}   22180
{col 26}26jan2020{col 36}11mar2020{col 46}25may2020{col 56}08aug2020{col 66}22sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200725
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200725.dta", replace
{txt}(note: file IMPE 20200725.dta not found)
file IMPE 20200725.dta saved

{com}. 
. 
. shell rm -r "2020-07-25_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-07-27 20200727
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-27_v4.csv.zip 2020-07-27_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-27_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-27_v4.csv
successfully unzipped 2020-07-27_v4.csv.zip to current directory

{com}. erase 2020-07-27_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-27_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 2,208,768 obs)

{com}. 
. keep if country == "$country"
{txt}(2,192,652 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(13,426 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,391 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21914{txt},{res}22212{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}31dec2019{txt},{res}24oct2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}299{col 51}{txt}missing .:  {res}0{txt}/{res}299

{txt}{col 19}mean:{res}{col 26}   22063{txt} = {res}28may2020{txt}
{col 15}std. dev:{res}{col 26} 86.4581

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21943{col 37}   21988{col 47}   22063{col 57}   22138{col 67}   22183
{col 26}29jan2020{col 36}14mar2020{col 46}28may2020{col 56}11aug2020{col 66}25sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200727
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200727.dta", replace
{txt}(note: file IMPE 20200727.dta not found)
file IMPE 20200727.dta saved

{com}. 
. 
. shell rm -r "2020-07-27_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-07-31 20200731
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-07-31_v4.csv.zip 2020-07-31_v4.csv.zip
{txt}
{com}. unzipfile 2020-07-31_v4.csv.zip, replace
{res}{txt}    inflating: 2020-07-31_v4.csv
successfully unzipped 2020-07-31_v4.csv.zip to current directory

{com}. erase 2020-07-31_v4.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-07-31_v4.csv", clear varnames(1) 
{res}{text}(13 vars, 1,947,792 obs)

{com}. 
. keep if country == "$country"
{txt}(1,931,217 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(13,813 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,455 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21910{txt},{res}22216{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}27dec2019{txt},{res}28oct2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}307{col 51}{txt}missing .:  {res}0{txt}/{res}307

{txt}{col 19}mean:{res}{col 26}   22063{txt} = {res}28may2020{txt}
{col 15}std. dev:{res}{col 26} 88.7675

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21940{col 37}   21986{col 47}   22063{col 57}   22140{col 67}   22186
{col 26}26jan2020{col 36}12mar2020{col 46}28may2020{col 56}13aug2020{col 66}28sep2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200731
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200731.dta", replace
{txt}(note: file IMPE 20200731.dta not found)
file IMPE 20200731.dta saved

{com}. 
. 
. shell rm -r "2020-07-31_v4.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-08-08 20200808
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-08-08_v5.csv.zip 2020-08-08_v5.csv.zip
{txt}
{com}. unzipfile 2020-08-08_v5.csv.zip, replace
{res}{txt}    inflating: 2020-08-08_v5.csv
successfully unzipped 2020-08-08_v5.csv.zip to current directory

{com}. erase 2020-08-08_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-08-08_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,314,806 obs)

{com}. 
. keep if country == "$country"
{txt}(2,298,072 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(13,945 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,479 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22224{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}05nov2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}310{col 51}{txt}missing .:  {res}0{txt}/{res}310

{txt}{col 19}mean:{res}{col 26} 22069.5{txt} = {res}03jun2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 89.6335

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 21945.5{col 37}   21992{col 47} 22069.5{col 57}   22147{col 67} 22193.5
{col 26}31jan2020{col 36}18mar2020{col 46}03jun2020{col 56}20aug2020{col 66}05oct2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200808
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200808.dta", replace
{txt}(note: file IMPE 20200808.dta not found)
file IMPE 20200808.dta saved

{com}. 
. 
. shell rm -r "2020-08-08_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-08-10 20200810
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-08-10_v5.csv.zip 2020-08-10_v5.csv.zip
{txt}
{com}. unzipfile 2020-08-10_v5.csv.zip, replace
{res}{txt}    inflating: 2020-08-10_v5.csv
successfully unzipped 2020-08-10_v5.csv.zip to current directory

{com}. erase 2020-08-10_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-08-10_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,410,980 obs)

{com}. 
. keep if country == "$country"
{txt}(2,393,160 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(14,850 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,655 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21912{txt},{res}22226{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}29dec2019{txt},{res}07nov2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}315{col 51}{txt}missing .:  {res}0{txt}/{res}315

{txt}{col 19}mean:{res}{col 26}   22069{txt} = {res}03jun2020{txt}
{col 15}std. dev:{res}{col 26} 91.0769

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21943{col 37}   21990{col 47}   22069{col 57}   22148{col 67}   22195
{col 26}29jan2020{col 36}16mar2020{col 46}03jun2020{col 56}21aug2020{col 66}07oct2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200810
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200810.dta", replace
{txt}(note: file IMPE 20200810.dta not found)
file IMPE 20200810.dta saved

{com}. 
. 
. shell rm -r "2020-08-10_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-08-11 20200811
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-08-11_v5.csv.zip 2020-08-11_v5.csv.zip
{txt}
{com}. unzipfile 2020-08-11_v5.csv.zip, replace
{res}{txt}    inflating: 2020-08-11_v5.csv
successfully unzipped 2020-08-11_v5.csv.zip to current directory

{com}. erase 2020-08-11_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-08-11_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,421,690 obs)

{com}. 
. keep if country == "$country"
{txt}(2,403,990 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(14,750 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,637 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22227{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}08nov2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}313{col 51}{txt}missing .:  {res}0{txt}/{res}313

{txt}{col 19}mean:{res}{col 26}   22071{txt} = {res}05jun2020{txt}
{col 15}std. dev:{res}{col 26} 90.4995

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21946{col 37}   21993{col 47}   22071{col 57}   22149{col 67}   22196
{col 26}01feb2020{col 36}19mar2020{col 46}05jun2020{col 56}22aug2020{col 66}08oct2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200811
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200811.dta", replace
{txt}(note: file IMPE 20200811.dta not found)
file IMPE 20200811.dta saved

{com}. 
. 
. shell rm -r "2020-08-11_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-08-13 20200813
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-08-13_v5.csv.zip 2020-08-13_v5.csv.zip
{txt}
{com}. unzipfile 2020-08-13_v5.csv.zip, replace
{res}{txt}    inflating: 2020-08-13_v5.csv
successfully unzipped 2020-08-13_v5.csv.zip to current directory

{com}. erase 2020-08-13_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-08-13_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,425,170 obs)

{com}. 
. keep if country == "$country"
{txt}(2,407,350 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(14,850 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,655 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22229{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}10nov2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}315{col 51}{txt}missing .:  {res}0{txt}/{res}315

{txt}{col 19}mean:{res}{col 26}   22072{txt} = {res}06jun2020{txt}
{col 15}std. dev:{res}{col 26} 91.0769

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21946{col 37}   21993{col 47}   22072{col 57}   22151{col 67}   22198
{col 26}01feb2020{col 36}19mar2020{col 46}06jun2020{col 56}24aug2020{col 66}10oct2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200813
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200813.dta", replace
{txt}(note: file IMPE 20200813.dta not found)
file IMPE 20200813.dta saved

{com}. 
. 
. shell rm -r "2020-08-13_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-08-14 20200814
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-08-14_v5.csv.zip 2020-08-14_v5.csv.zip
{txt}
{com}. unzipfile 2020-08-14_v5.csv.zip, replace
{res}{txt}    inflating: 2020-08-14_v5.csv
successfully unzipped 2020-08-14_v5.csv.zip to current directory

{com}. erase 2020-08-14_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-08-14_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,446,680 obs)

{com}. 
. keep if country == "$country"
{txt}(2,429,040 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(14,700 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,628 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21919{txt},{res}22230{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}05jan2020{txt},{res}11nov2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}312{col 51}{txt}missing .:  {res}0{txt}/{res}312

{txt}{col 19}mean:{res}{col 26} 22074.5{txt} = {res}08jun2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 90.2109

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21950{col 37} 21996.5{col 47} 22074.5{col 57} 22152.5{col 67}   22199
{col 26}05feb2020{col 36}22mar2020{col 46}08jun2020{col 56}25aug2020{col 66}11oct2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200814
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200814.dta", replace
{txt}(note: file IMPE 20200814.dta not found)
file IMPE 20200814.dta saved

{com}. 
. 
. shell rm -r "2020-08-14_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-08-17 20200817
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-08-17_v5.csv.zip 2020-08-17_v5.csv.zip
{txt}
{com}. unzipfile 2020-08-17_v5.csv.zip, replace
{res}{txt}    inflating: 2020-08-17_v5.csv
successfully unzipped 2020-08-17_v5.csv.zip to current directory

{com}. erase 2020-08-17_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-08-17_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,473,770 obs)

{com}. 
. keep if country == "$country"
{txt}(2,455,890 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(14,900 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,664 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21918{txt},{res}22233{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}04jan2020{txt},{res}14nov2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}316{col 51}{txt}missing .:  {res}0{txt}/{res}316

{txt}{col 19}mean:{res}{col 26} 22075.5{txt} = {res}09jun2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 91.3656

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21949{col 37} 21996.5{col 47} 22075.5{col 57} 22154.5{col 67}   22202
{col 26}04feb2020{col 36}22mar2020{col 46}09jun2020{col 56}27aug2020{col 66}14oct2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200817
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200817.dta", replace
{txt}(note: file IMPE 20200817.dta not found)
file IMPE 20200817.dta saved

{com}. 
. 
. shell rm -r "2020-08-17_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-08-23 20200823
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-08-23_v5.csv.zip 2020-08-23_v5.csv.zip
{txt}
{com}. unzipfile 2020-08-23_v5.csv.zip, replace
{res}{txt}    inflating: 2020-08-23_v5.csv
successfully unzipped 2020-08-23_v5.csv.zip to current directory

{com}. erase 2020-08-23_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-08-23_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,513,310 obs)

{com}. 
. keep if country == "$country"
{txt}(2,495,370 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(14,950 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,673 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21923{txt},{res}22239{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09jan2020{txt},{res}20nov2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}317{col 51}{txt}missing .:  {res}0{txt}/{res}317

{txt}{col 19}mean:{res}{col 26}   22081{txt} = {res}15jun2020{txt}
{col 15}std. dev:{res}{col 26} 91.6542

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21954{col 37}   22002{col 47}   22081{col 57}   22160{col 67}   22208
{col 26}09feb2020{col 36}28mar2020{col 46}15jun2020{col 56}02sep2020{col 66}20oct2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200823
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200823.dta", replace
{txt}(note: file IMPE 20200823.dta not found)
file IMPE 20200823.dta saved

{com}. 
. 
. shell rm -r "2020-08-23_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-08-25 20200825
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-08-25_v5.csv.zip 2020-08-25_v5.csv.zip
{txt}
{com}. unzipfile 2020-08-25_v5.csv.zip, replace
{res}{txt}    inflating: 2020-08-25_v5.csv
successfully unzipped 2020-08-25_v5.csv.zip to current directory

{com}. erase 2020-08-25_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-08-25_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,546,310 obs)

{com}. 
. keep if country == "$country"
{txt}(2,528,100 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(15,170 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,718 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21920{txt},{res}22241{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}06jan2020{txt},{res}22nov2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}322{col 51}{txt}missing .:  {res}0{txt}/{res}322

{txt}{col 19}mean:{res}{col 26} 22080.5{txt} = {res}14jun2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 93.0976

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21952{col 37}   22000{col 47} 22080.5{col 57}   22161{col 67}   22209
{col 26}07feb2020{col 36}26mar2020{col 46}14jun2020{col 56}03sep2020{col 66}21oct2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200825
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200825.dta", replace
{txt}(note: file IMPE 20200825.dta not found)
file IMPE 20200825.dta saved

{com}. 
. 
. shell rm -r "2020-08-25_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-08-27 20200827
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-08-27_v5.csv.zip 2020-08-27_v5.csv.zip
{txt}
{com}. unzipfile 2020-08-27_v5.csv.zip, replace
{res}{txt}    inflating: 2020-08-27_v5.csv
successfully unzipped 2020-08-27_v5.csv.zip to current directory

{com}. erase 2020-08-27_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-08-27_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,564,640 obs)

{com}. 
. keep if country == "$country"
{txt}(2,546,280 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(15,300 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,736 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21920{txt},{res}22243{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}06jan2020{txt},{res}24nov2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}324{col 51}{txt}missing .:  {res}0{txt}/{res}324

{txt}{col 19}mean:{res}{col 26} 22081.5{txt} = {res}15jun2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  93.675

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21952{col 37} 22000.5{col 47} 22081.5{col 57} 22162.5{col 67}   22211
{col 26}07feb2020{col 36}26mar2020{col 46}15jun2020{col 56}04sep2020{col 66}23oct2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200827
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200827.dta", replace
{txt}(note: file IMPE 20200827.dta not found)
file IMPE 20200827.dta saved

{com}. 
. 
. shell rm -r "2020-08-27_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-08-31 20200831
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-08-31_v5.csv.zip 2020-08-31_v5.csv.zip
{txt}
{com}. unzipfile 2020-08-31_v5.csv.zip, replace
{res}{txt}    inflating: 2020-08-31_v5.csv
successfully unzipped 2020-08-31_v5.csv.zip to current directory

{com}. erase 2020-08-31_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-08-31_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,601,780 obs)

{com}. 
. keep if country == "$country"
{txt}(2,582,970 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(15,680 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,799 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21917{txt},{res}22247{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}03jan2020{txt},{res}28nov2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}331{col 51}{txt}missing .:  {res}0{txt}/{res}331

{txt}{col 19}mean:{res}{col 26}   22082{txt} = {res}16jun2020{txt}
{col 15}std. dev:{res}{col 26} 95.6957

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21950{col 37}   21999{col 47}   22082{col 57}   22165{col 67}   22214
{col 26}05feb2020{col 36}25mar2020{col 46}16jun2020{col 56}07sep2020{col 66}26oct2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200831
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200831.dta", replace
{txt}(note: file IMPE 20200831.dta not found)
file IMPE 20200831.dta saved

{com}. 
. 
. shell rm -r "2020-08-31_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-09-02 20200902
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-09-02_v5.csv.zip 2020-09-02_v5.csv.zip
{txt}
{com}. unzipfile 2020-09-02_v5.csv.zip, replace
{res}{txt}    inflating: 2020-09-02_v5.csv
successfully unzipped 2020-09-02_v5.csv.zip to current directory

{com}. erase 2020-09-02_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-09-02_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,619,000 obs)

{com}. 
. keep if country == "$country"
{txt}(2,600,490 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(15,430 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,754 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21924{txt},{res}22249{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}10jan2020{txt},{res}30nov2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}326{col 51}{txt}missing .:  {res}0{txt}/{res}326

{txt}{col 19}mean:{res}{col 26} 22086.5{txt} = {res}20jun2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 94.2523

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21956{col 37}   22005{col 47} 22086.5{col 57}   22168{col 67}   22217
{col 26}11feb2020{col 36}31mar2020{col 46}20jun2020{col 56}10sep2020{col 66}29oct2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200902
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200902.dta", replace
{txt}(note: file IMPE 20200902.dta not found)
file IMPE 20200902.dta saved

{com}. 
. 
. shell rm -r "2020-09-02_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-09-06 20200906
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-09-06_v5.csv.zip 2020-09-06_v5.csv.zip
{txt}
{com}. unzipfile 2020-09-06_v5.csv.zip, replace
{res}{txt}    inflating: 2020-09-06_v5.csv
successfully unzipped 2020-09-06_v5.csv.zip to current directory

{com}. erase 2020-09-06_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-09-06_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,656,530 obs)

{com}. 
. keep if country == "$country"
{txt}(2,637,810 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(15,600 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,790 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21924{txt},{res}22253{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}10jan2020{txt},{res}04dec2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}330{col 51}{txt}missing .:  {res}0{txt}/{res}330

{txt}{col 19}mean:{res}{col 26} 22088.5{txt} = {res}22jun2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  95.407

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 21956.5{col 37}   22006{col 47} 22088.5{col 57}   22171{col 67} 22220.5
{col 26}11feb2020{col 36}01apr2020{col 46}22jun2020{col 56}13sep2020{col 66}01nov2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200906
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200906.dta", replace
{txt}(note: file IMPE 20200906.dta not found)
file IMPE 20200906.dta saved

{com}. 
. 
. shell rm -r "2020-09-06_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-09-08 20200908
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-09-08_v5.csv.zip 2020-09-08_v5.csv.zip
{txt}
{com}. unzipfile 2020-09-08_v5.csv.zip, replace
{res}{txt}    inflating: 2020-09-08_v5.csv
successfully unzipped 2020-09-08_v5.csv.zip to current directory

{com}. erase 2020-09-08_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-09-08_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,675,100 obs)

{com}. 
. keep if country == "$country"
{txt}(2,656,290 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(15,670 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,808 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21924{txt},{res}22255{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}10jan2020{txt},{res}06dec2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}332{col 51}{txt}missing .:  {res}0{txt}/{res}332

{txt}{col 19}mean:{res}{col 26} 22089.5{txt} = {res}23jun2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 95.9844

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21957{col 37} 22006.5{col 47} 22089.5{col 57} 22172.5{col 67}   22222
{col 26}12feb2020{col 36}01apr2020{col 46}23jun2020{col 56}14sep2020{col 66}03nov2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200908
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200908.dta", replace
{txt}(note: file IMPE 20200908.dta not found)
file IMPE 20200908.dta saved

{com}. 
. 
. shell rm -r "2020-09-08_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-09-12 20200912
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-09-12_v5.csv.zip 2020-09-12_v5.csv.zip
{txt}
{com}. unzipfile 2020-09-12_v5.csv.zip, replace
{res}{txt}    inflating: 2020-09-12_v5.csv
successfully unzipped 2020-09-12_v5.csv.zip to current directory

{com}. erase 2020-09-12_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-09-12_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 2,709,570 obs)

{com}. 
. keep if country == "$country"
{txt}(2,690,490 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(15,900 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(2,844 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21924{txt},{res}22259{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}10jan2020{txt},{res}10dec2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}336{col 51}{txt}missing .:  {res}0{txt}/{res}336

{txt}{col 19}mean:{res}{col 26} 22091.5{txt} = {res}25jun2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 97.1391

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21957{col 37} 22007.5{col 47} 22091.5{col 57} 22175.5{col 67}   22226
{col 26}12feb2020{col 36}02apr2020{col 46}25jun2020{col 56}17sep2020{col 66}07nov2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200912
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200912.dta", replace
{txt}(note: file IMPE 20200912.dta not found)
file IMPE 20200912.dta saved

{com}. 
. 
. shell rm -r "2020-09-12_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-09-15 20200915
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-09-15_v5.csv.zip 2020-09-15_v5.csv.zip
{txt}
{com}. unzipfile 2020-09-15_v5.csv.zip, replace
{res}{txt}    inflating: 2020-09-15_v5.csv
successfully unzipped 2020-09-15_v5.csv.zip to current directory

{com}. erase 2020-09-15_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-09-15_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 3,030,513 obs)

{com}. 
. keep if country == "$country"
{txt}(3,009,681 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(17,360 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(3,140 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21931{txt},{res}22262{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}17jan2020{txt},{res}13dec2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}332{col 51}{txt}missing .:  {res}0{txt}/{res}332

{txt}{col 19}mean:{res}{col 26} 22096.5{txt} = {res}30jun2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 95.9844

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21964{col 37} 22013.5{col 47} 22096.5{col 57} 22179.5{col 67}   22229
{col 26}19feb2020{col 36}08apr2020{col 46}30jun2020{col 56}21sep2020{col 66}10nov2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200915
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200915.dta", replace
{txt}(note: file IMPE 20200915.dta not found)
file IMPE 20200915.dta saved

{com}. 
. 
. shell rm -r "2020-09-15_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-09-19 20200919
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-09-19_v5.csv.zip 2020-09-19_v5.csv.zip
{txt}
{com}. unzipfile 2020-09-19_v5.csv.zip, replace
{res}{txt}    inflating: 2020-09-19_v5.csv
successfully unzipped 2020-09-19_v5.csv.zip to current directory

{com}. erase 2020-09-19_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-09-19_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 3,076,515 obs)

{com}. 
. keep if country == "$country"
{txt}(3,055,089 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(17,855 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(3,230 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21926{txt},{res}22266{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}12jan2020{txt},{res}17dec2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}341{col 51}{txt}missing .:  {res}0{txt}/{res}341

{txt}{col 19}mean:{res}{col 26}   22096{txt} = {res}30jun2020{txt}
{col 15}std. dev:{res}{col 26} 98.5825

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21960{col 37}   22011{col 47}   22096{col 57}   22181{col 67}   22232
{col 26}15feb2020{col 36}06apr2020{col 46}30jun2020{col 56}23sep2020{col 66}13nov2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200919
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200919.dta", replace
{txt}(note: file IMPE 20200919.dta not found)
file IMPE 20200919.dta saved

{com}. 
. 
. shell rm -r "2020-09-19_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-09-23 20200923
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-09-23_v5.csv.zip 2020-09-23_v5.csv.zip
{txt}
{com}. unzipfile 2020-09-23_v5.csv.zip, replace
{res}{txt}    inflating: 2020-09-23_v5.csv
successfully unzipped 2020-09-23_v5.csv.zip to current directory

{com}. erase 2020-09-23_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-09-23_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 3,135,759 obs)

{com}. 
. keep if country == "$country"
{txt}(3,113,673 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(18,405 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(3,330 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21920{txt},{res}22270{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}06jan2020{txt},{res}21dec2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}351{col 51}{txt}missing .:  {res}0{txt}/{res}351

{txt}{col 19}mean:{res}{col 26}   22095{txt} = {res}29jun2020{txt}
{col 15}std. dev:{res}{col 26} 101.469

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21955{col 37}   22007{col 47}   22095{col 57}   22183{col 67}   22235
{col 26}10feb2020{col 36}02apr2020{col 46}29jun2020{col 56}25sep2020{col 66}16nov2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200923
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200923.dta", replace
{txt}(note: file IMPE 20200923.dta not found)
file IMPE 20200923.dta saved

{com}. 
. 
. shell rm -r "2020-09-23_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-09-25 20200925
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-09-25_v5.csv.zip 2020-09-25_v5.csv.zip
{txt}
{com}. unzipfile 2020-09-25_v5.csv.zip, replace
{res}{txt}    inflating: 2020-09-25_v5.csv
successfully unzipped 2020-09-25_v5.csv.zip to current directory

{com}. erase 2020-09-25_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-09-25_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 3,153,315 obs)

{com}. 
. keep if country == "$country"
{txt}(3,131,229 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(18,405 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(3,330 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21922{txt},{res}22272{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}08jan2020{txt},{res}23dec2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}351{col 51}{txt}missing .:  {res}0{txt}/{res}351

{txt}{col 19}mean:{res}{col 26}   22097{txt} = {res}01jul2020{txt}
{col 15}std. dev:{res}{col 26} 101.469

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21957{col 37}   22009{col 47}   22097{col 57}   22185{col 67}   22237
{col 26}12feb2020{col 36}04apr2020{col 46}01jul2020{col 56}27sep2020{col 66}18nov2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320200925
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20200925.dta", replace
{txt}(note: file IMPE 20200925.dta not found)
file IMPE 20200925.dta saved

{com}. 
. 
. shell rm -r "2020-09-25_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-10-03 20201003
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-10-03_v5.csv.zip 2020-10-03_v5.csv.zip
{txt}
{com}. unzipfile 2020-10-03_v5.csv.zip, replace
{res}{txt}    inflating: 2020-10-03_v5.csv
successfully unzipped 2020-10-03_v5.csv.zip to current directory

{com}. erase 2020-10-03_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-10-03_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 3,236,112 obs)

{com}. 
. keep if country == "$country"
{txt}(3,213,201 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(19,098 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(3,450 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21918{txt},{res}22280{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}04jan2020{txt},{res}31dec2020{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}363{col 51}{txt}missing .:  {res}0{txt}/{res}363

{txt}{col 19}mean:{res}{col 26}   22099{txt} = {res}03jul2020{txt}
{col 15}std. dev:{res}{col 26} 104.933

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21954{col 37}   22008{col 47}   22099{col 57}   22190{col 67}   22244
{col 26}09feb2020{col 36}03apr2020{col 46}03jul2020{col 56}02oct2020{col 66}25nov2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201003
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201003.dta", replace
{txt}(note: file IMPE 20201003.dta not found)
file IMPE 20201003.dta saved

{com}. 
. 
. shell rm -r "2020-10-03_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-10-06 20201006
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-10-06_v5.csv.zip 2020-10-06_v5.csv.zip
{txt}
{com}. unzipfile 2020-10-06_v5.csv.zip, replace
{res}{txt}    inflating: 2020-10-06_v5.csv
successfully unzipped 2020-10-06_v5.csv.zip to current directory

{com}. erase 2020-10-06_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-10-06_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 3,249,171 obs)

{com}. 
. keep if country == "$country"
{txt}(3,225,963 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(19,340 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(3,500 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21916{txt},{res}22283{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}02jan2020{txt},{res}03jan2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}368{col 51}{txt}missing .:  {res}0{txt}/{res}368

{txt}{col 19}mean:{res}{col 26} 22099.5{txt} = {res}03jul2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 106.377

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21952{col 37} 22007.5{col 47} 22099.5{col 57} 22191.5{col 67}   22247
{col 26}07feb2020{col 36}02apr2020{col 46}03jul2020{col 56}03oct2020{col 66}28nov2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201006
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201006.dta", replace
{txt}(note: file IMPE 20201006.dta not found)
file IMPE 20201006.dta saved

{com}. 
. 
. shell rm -r "2020-10-06_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-10-12 20201012
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-10-12_v5.csv.zip 2020-10-12_v5.csv.zip
{txt}
{com}. unzipfile 2020-10-12_v5.csv.zip, replace
{res}{txt}    inflating: 2020-10-12_v5.csv
successfully unzipped 2020-10-12_v5.csv.zip to current directory

{com}. erase 2020-10-12_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-10-12_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 3,309,990 obs)

{com}. 
. keep if country == "$country"
{txt}(3,286,320 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(19,725 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(3,570 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22289{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}09jan2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}375{col 51}{txt}missing .:  {res}0{txt}/{res}375

{txt}{col 19}mean:{res}{col 26}   22102{txt} = {res}06jul2020{txt}
{col 15}std. dev:{res}{col 26} 108.397

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21952{col 37}   22008{col 47}   22102{col 57}   22196{col 67}   22252
{col 26}07feb2020{col 36}03apr2020{col 46}06jul2020{col 56}08oct2020{col 66}03dec2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201012
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201012.dta", replace
{txt}(note: file IMPE 20201012.dta not found)
file IMPE 20201012.dta saved

{com}. 
. 
. shell rm -r "2020-10-12_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-10-19 20201019
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-10-19_v5.csv.zip 2020-10-19_v5.csv.zip
{txt}
{com}. unzipfile 2020-10-19_v5.csv.zip, replace
{res}{txt}    inflating: 2020-10-19_v5.csv
successfully unzipped 2020-10-19_v5.csv.zip to current directory

{com}. erase 2020-10-19_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-10-19_v5.csv", clear varnames(1) 
{res}{text}(13 vars, 3,409,197 obs)

{com}. 
. keep if country == "$country"
{txt}(3,385,131 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(20,055 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(3,630 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21916{txt},{res}22296{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}02jan2020{txt},{res}16jan2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}381{col 51}{txt}missing .:  {res}0{txt}/{res}381

{txt}{col 19}mean:{res}{col 26}   22106{txt} = {res}10jul2020{txt}
{col 15}std. dev:{res}{col 26} 110.129

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21954{col 37}   22011{col 47}   22106{col 57}   22201{col 67}   22258
{col 26}09feb2020{col 36}06apr2020{col 46}10jul2020{col 56}13oct2020{col 66}09dec2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201019
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201019.dta", replace
{txt}(note: file IMPE 20201019.dta not found)
file IMPE 20201019.dta saved

{com}. 
. 
. shell rm -r "2020-10-19_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-10-25 20201025
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-10-25_v5.csv.zip 2020-10-25_v5.csv.zip
{txt}
{com}. unzipfile 2020-10-25_v5.csv.zip, replace
{res}{txt}    inflating: 2020-10-25_v5.csv
successfully unzipped 2020-10-25_v5.csv.zip to current directory

{com}. erase 2020-10-25_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-10-25_v5.csv", clear varnames(1) 
{res}{text}(14 vars, 3,831,267 obs)

{com}. 
. keep if country == "$country"
{txt}(3,806,121 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(20,955 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(3,810 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21922{txt},{res}22302{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}08jan2020{txt},{res}22jan2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}381{col 51}{txt}missing .:  {res}0{txt}/{res}381

{txt}{col 19}mean:{res}{col 26}   22112{txt} = {res}16jul2020{txt}
{col 15}std. dev:{res}{col 26} 110.129

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21960{col 37}   22017{col 47}   22112{col 57}   22207{col 67}   22264
{col 26}15feb2020{col 36}12apr2020{col 46}16jul2020{col 56}19oct2020{col 66}15dec2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201025
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201025.dta", replace
{txt}(note: file IMPE 20201025.dta not found)
file IMPE 20201025.dta saved

{com}. 
. 
. shell rm -r "2020-10-25_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-10-28 20201028
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-10-28_v5.csv.zip 2020-10-28_v5.csv.zip
{txt}
{com}. unzipfile 2020-10-28_v5.csv.zip, replace
{res}{txt}    inflating: 2020-10-28_v5.csv
successfully unzipped 2020-10-28_v5.csv.zip to current directory

{com}. erase 2020-10-28_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-10-28_v5.csv", clear varnames(1) 
{res}{text}(14 vars, 3,863,055 obs)

{com}. 
. keep if country == "$country"
{txt}(3,837,624 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(21,198 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(3,848 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21921{txt},{res}22305{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}07jan2020{txt},{res}25jan2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}385{col 51}{txt}missing .:  {res}0{txt}/{res}385

{txt}{col 19}mean:{res}{col 26}   22113{txt} = {res}17jul2020{txt}
{col 15}std. dev:{res}{col 26} 111.284

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21959{col 37}   22017{col 47}   22113{col 57}   22209{col 67}   22267
{col 26}14feb2020{col 36}12apr2020{col 46}17jul2020{col 56}21oct2020{col 66}18dec2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201028
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201028.dta", replace
{txt}(note: file IMPE 20201028.dta not found)
file IMPE 20201028.dta saved

{com}. 
. 
. shell rm -r "2020-10-28_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-11-01 20201101
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-11-01_v5.csv.zip 2020-11-01_v5.csv.zip
{txt}
{com}. unzipfile 2020-11-01_v5.csv.zip, replace
{res}{txt}    inflating: 2020-11-01_v5.csv
successfully unzipped 2020-11-01_v5.csv.zip to current directory

{com}. erase 2020-11-01_v5.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-11-01_v5.csv", clear varnames(1) 
{res}{text}(14 vars, 3,883,737 obs)

{com}. 
. keep if country == "$country"
{txt}(3,858,162 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(21,307 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(3,880 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21922{txt},{res}22309{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}08jan2020{txt},{res}29jan2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}388{col 51}{txt}missing .:  {res}0{txt}/{res}388

{txt}{col 19}mean:{res}{col 26} 22115.5{txt} = {res}19jul2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  112.15

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21960{col 37} 22018.5{col 47} 22115.5{col 57} 22212.5{col 67}   22271
{col 26}15feb2020{col 36}13apr2020{col 46}19jul2020{col 56}24oct2020{col 66}22dec2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201101
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201101.dta", replace
{txt}(note: file IMPE 20201101.dta not found)
file IMPE 20201101.dta saved

{com}. 
. 
. shell rm -r "2020-11-01_v5.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-11-10 20201110
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-11-10_v6.csv.zip 2020-11-10_v6.csv.zip
{txt}
{com}. unzipfile 2020-11-10_v6.csv.zip, replace
{res}{txt}    inflating: 2020-11-10_v6.csv
successfully unzipped 2020-11-10_v6.csv.zip to current directory

{com}. erase 2020-11-10_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-11-10_v6.csv", clear varnames(1) 
{res}{text}(14 vars, 4,045,668 obs)

{com}. 
. keep if country == "$country"
{txt}(4,019,532 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(21,780 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(3,960 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21923{txt},{res}22318{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09jan2020{txt},{res}07feb2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}396{col 51}{txt}missing .:  {res}0{txt}/{res}396

{txt}{col 19}mean:{res}{col 26} 22120.5{txt} = {res}24jul2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  114.46

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21962{col 37} 22021.5{col 47} 22120.5{col 57} 22219.5{col 67}   22279
{col 26}17feb2020{col 36}16apr2020{col 46}24jul2020{col 56}31oct2020{col 66}30dec2020
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201110
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201110.dta", replace
{txt}(note: file IMPE 20201110.dta not found)
file IMPE 20201110.dta saved

{com}. 
. 
. shell rm -r "2020-11-10_v6.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-11-14 20201114
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-11-14_v6.csv.zip 2020-11-14_v6.csv.zip
{txt}
{com}. unzipfile 2020-11-14_v6.csv.zip, replace
{res}{txt}    inflating: 2020-11-14_v6.csv
successfully unzipped 2020-11-14_v6.csv.zip to current directory

{com}. erase 2020-11-14_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-11-14_v6.csv", clear varnames(1) 
{res}{text}(14 vars, 4,095,201 obs)

{com}. 
. keep if country == "$country"
{txt}(4,068,603 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(22,165 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,030 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21920{txt},{res}22322{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}06jan2020{txt},{res}11feb2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}403{col 51}{txt}missing .:  {res}0{txt}/{res}403

{txt}{col 19}mean:{res}{col 26}   22121{txt} = {res}25jul2020{txt}
{col 15}std. dev:{res}{col 26}  116.48

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21960{col 37}   22020{col 47}   22121{col 57}   22222{col 67}   22282
{col 26}15feb2020{col 36}15apr2020{col 46}25jul2020{col 56}03nov2020{col 66}02jan2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201114
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201114.dta", replace
{txt}(note: file IMPE 20201114.dta not found)
file IMPE 20201114.dta saved

{com}. 
. 
. shell rm -r "2020-11-14_v6.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-11-18 20201118
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-11-18_v6.csv.zip 2020-11-18_v6.csv.zip
{txt}
{com}. unzipfile 2020-11-18_v6.csv.zip, replace
{res}{txt}    inflating: 2020-11-18_v6.csv
successfully unzipped 2020-11-18_v6.csv.zip to current directory

{com}. erase 2020-11-18_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-11-18_v6.csv", clear varnames(1) 
{res}{text}(14 vars, 4,128,630 obs)

{com}. 
. keep if country == "$country"
{txt}(4,101,768 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(22,385 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,070 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21920{txt},{res}22326{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}06jan2020{txt},{res}15feb2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}407{col 51}{txt}missing .:  {res}0{txt}/{res}407

{txt}{col 19}mean:{res}{col 26}   22123{txt} = {res}27jul2020{txt}
{col 15}std. dev:{res}{col 26} 117.635

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21960{col 37}   22021{col 47}   22123{col 57}   22225{col 67}   22286
{col 26}15feb2020{col 36}16apr2020{col 46}27jul2020{col 56}06nov2020{col 66}06jan2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201118
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201118.dta", replace
{txt}(note: file IMPE 20201118.dta not found)
file IMPE 20201118.dta saved

{com}. 
. 
. shell rm -r "2020-11-18_v6.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-11-23 20201123
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-11-23_v6.csv.zip 2020-11-23_v6.csv.zip
{txt}
{com}. unzipfile 2020-11-23_v6.csv.zip, replace
{res}{txt}    inflating: 2020-11-23_v6.csv
successfully unzipped 2020-11-23_v6.csv.zip to current directory

{com}. erase 2020-11-23_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-11-23_v6.csv", clear varnames(1) 
{res}{text}(14 vars, 4,184,202 obs)

{com}. 
. keep if country == "$country"
{txt}(4,157,076 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(22,605 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,110 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21921{txt},{res}22331{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}07jan2020{txt},{res}20feb2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}411{col 51}{txt}missing .:  {res}0{txt}/{res}411

{txt}{col 19}mean:{res}{col 26}   22126{txt} = {res}30jul2020{txt}
{col 15}std. dev:{res}{col 26}  118.79

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21962{col 37}   22023{col 47}   22126{col 57}   22229{col 67}   22290
{col 26}17feb2020{col 36}18apr2020{col 46}30jul2020{col 56}10nov2020{col 66}10jan2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201123
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201123.dta", replace
{txt}(note: file IMPE 20201123.dta not found)
file IMPE 20201123.dta saved

{com}. 
. 
. shell rm -r "2020-11-23_v6.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-11-29 20201129
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-11-29_v6.csv.zip 2020-11-29_v6.csv.zip
{txt}
{com}. unzipfile 2020-11-29_v6.csv.zip, replace
{res}{txt}    inflating: 2020-11-29_v6.csv
successfully unzipped 2020-11-29_v6.csv.zip to current directory

{com}. erase 2020-11-29_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-11-29_v6.csv", clear varnames(1) 
{res}{text}(14 vars, 4,281,684 obs)

{com}. 
. keep if country == "$country"
{txt}(4,254,228 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(22,880 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,160 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21922{txt},{res}22337{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}08jan2020{txt},{res}26feb2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}416{col 51}{txt}missing .:  {res}0{txt}/{res}416

{txt}{col 19}mean:{res}{col 26} 22129.5{txt} = {res}02aug2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 120.233

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21963{col 37} 22025.5{col 47} 22129.5{col 57} 22233.5{col 67}   22296
{col 26}18feb2020{col 36}20apr2020{col 46}02aug2020{col 56}14nov2020{col 66}16jan2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201129
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201129.dta", replace
{txt}(note: file IMPE 20201129.dta not found)
file IMPE 20201129.dta saved

{com}. 
. 
. shell rm -r "2020-11-29_v6.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-12-04 20201204
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-12-04_v6.csv.zip 2020-12-04_v6.csv.zip
{txt}
{com}. unzipfile 2020-12-04_v6.csv.zip, replace
{res}{txt}    inflating: 2020-12-04_v6.csv
successfully unzipped 2020-12-04_v6.csv.zip to current directory

{com}. erase 2020-12-04_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-12-04_v6.csv", clear varnames(1) 
{res}{text}(14 vars, 4,339,203 obs)

{com}. 
. keep if country == "$country"
{txt}(4,311,483 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(23,100 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,200 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21923{txt},{res}22342{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09jan2020{txt},{res}03mar2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}420{col 51}{txt}missing .:  {res}0{txt}/{res}420

{txt}{col 19}mean:{res}{col 26} 22132.5{txt} = {res}05aug2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 121.388

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 21964.5{col 37} 22027.5{col 47} 22132.5{col 57} 22237.5{col 67} 22300.5
{col 26}19feb2020{col 36}22apr2020{col 46}05aug2020{col 56}18nov2020{col 66}20jan2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201204
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201204.dta", replace
{txt}(note: file IMPE 20201204.dta not found)
file IMPE 20201204.dta saved

{com}. 
. 
. shell rm -r "2020-12-04_v6.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-12-12 20201212
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-12-12_v6.csv.zip 2020-12-12_v6.csv.zip
{txt}
{com}. unzipfile 2020-12-12_v6.csv.zip, replace
{res}{txt}    inflating: 2020-12-12_v6.csv
successfully unzipped 2020-12-12_v6.csv.zip to current directory

{com}. erase 2020-12-12_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-12-12_v6.csv", clear varnames(1) 
{res}{text}(14 vars, 4,428,303 obs)

{com}. 
. keep if country == "$country"
{txt}(4,399,923 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(23,650 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,300 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21921{txt},{res}22350{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}07jan2020{txt},{res}11mar2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}430{col 51}{txt}missing .:  {res}0{txt}/{res}430

{txt}{col 19}mean:{res}{col 26} 22135.5{txt} = {res}08aug2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 124.275

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 21963.5{col 37}   22028{col 47} 22135.5{col 57}   22243{col 67} 22307.5
{col 26}18feb2020{col 36}23apr2020{col 46}08aug2020{col 56}24nov2020{col 66}27jan2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201212
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201212.dta", replace
{txt}(note: file IMPE 20201212.dta not found)
file IMPE 20201212.dta saved

{com}. 
. 
. shell rm -r "2020-12-12_v6.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-12-20 20201220
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-12-20_v6.csv.zip 2020-12-20_v6.csv.zip
{txt}
{com}. unzipfile 2020-12-20_v6.csv.zip, replace
{res}{txt}    inflating: 2020-12-20_v6.csv
successfully unzipped 2020-12-20_v6.csv.zip to current directory

{com}. erase 2020-12-20_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-12-20_v6.csv", clear varnames(1) 
{res}{text}(14 vars, 4,497,894 obs)

{com}. 
. keep if country == "$country"
{txt}(4,469,052 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(24,035 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,370 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21922{txt},{res}22358{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}08jan2020{txt},{res}19mar2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}437{col 51}{txt}missing .:  {res}0{txt}/{res}437

{txt}{col 19}mean:{res}{col 26}   22140{txt} = {res}13aug2020{txt}
{col 15}std. dev:{res}{col 26} 126.295

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21965{col 37}   22031{col 47}   22140{col 57}   22249{col 67}   22315
{col 26}20feb2020{col 36}26apr2020{col 46}13aug2020{col 56}30nov2020{col 66}04feb2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201220
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201220.dta", replace
{txt}(note: file IMPE 20201220.dta not found)
file IMPE 20201220.dta saved

{com}. 
. 
. shell rm -r "2020-12-20_v6.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2020-12-26 20201226
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-12-26_v6.csv.zip 2020-12-26_v6.csv.zip
{txt}
{com}. unzipfile 2020-12-26_v6.csv.zip, replace
{res}{txt}    inflating: 2020-12-26_v6.csv
successfully unzipped 2020-12-26_v6.csv.zip to current directory

{com}. erase 2020-12-26_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2020-12-26_v6.csv", clear varnames(1) 
{res}{text}(14 vars, 4,540,932 obs)

{com}. 
. keep if country == "$country"
{txt}(4,511,562 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(24,475 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,450 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21920{txt},{res}22364{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}06jan2020{txt},{res}25mar2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}445{col 51}{txt}missing .:  {res}0{txt}/{res}445

{txt}{col 19}mean:{res}{col 26}   22142{txt} = {res}15aug2020{txt}
{col 15}std. dev:{res}{col 26} 128.605

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21964{col 37}   22031{col 47}   22142{col 57}   22253{col 67}   22320
{col 26}19feb2020{col 36}26apr2020{col 46}15aug2020{col 56}04dec2020{col 66}09feb2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320201226
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20201226.dta", replace
{txt}(note: file IMPE 20201226.dta not found)
file IMPE 20201226.dta saved

{com}. 
. 
. shell rm -r "2020-12-26_v6.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. 
. 
. 
. *
. 
. view "log CovidLongitudinal IMPE 1a.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/Iran/code/IMPE/log CovidLongitudinal IMPE 1a.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 May 2022, 17:23:32
{txt}{.-}
{smcl}
{txt}{sf}{ul off}