{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/Iran/code/IMPE/log CovidLongitudinal IMPE 1b.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 May 2022, 18:00:31
{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidLongitudinal IMPE 1b.do"
. 
. * Project: Longitudinal assessment of COVID-19 models                                                                         
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. ***************************************************************************
. 
. 
. * download estimates files - part 2 of 2 - 2021 (from 2020 and 2021)
. * input data files: csv files on web site
. * output data files: "IMPE `update'.dta" 
. 
. 
. 
. 
. /*
> 
> 94 updates (2020 and 2021)
> 
> 
> copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2020-06-14_v4.csv.zip 2020-06-14_v4.csv.zip
> 
> list1 ///
> 2020-06-14_v4.csv.zip ///
> 2020-06-16_v4.csv.zip ///
> 2020-06-19_v4.csv.zip ///
> 2020-06-23_v4.csv.zip ///
> 2020-07-02_v4.csv.zip ///
> 2020-07-03_v4.csv.zip ///
> 2020-07-04_v4.csv.zip ///
> 2020-07-07_v4.csv.zip ///
> 2020-07-11_v4.csv.zip ///
> 2020-07-14_v4.csv.zip ///
> 2020-07-15_v4.csv.zip ///
> 2020-07-18_v4.csv.zip ///
> 2020-07-20_v4.csv.zip ///
> 2020-07-22_v4.csv.zip ///
> 2020-07-25_v4.csv.zip ///
> 2020-07-27_v4.csv.zip ///
> 2020-07-31_v4.csv.zip ///
> 2020-08-08_v5.csv.zip ///
> 2020-08-10_v5.csv.zip ///
> 2020-08-11_v5.csv.zip ///
> 2020-08-13_v5.csv.zip ///
> 2020-08-14_v5.csv.zip ///
> 2020-08-17_v5.csv.zip ///
> 2020-08-23_v5.csv.zip ///
> 2020-08-25_v5.csv.zip ///
> 2020-08-27_v5.csv.zip ///
> 2020-08-31_v5.csv.zip ///
> 2020-09-02_v5.csv.zip ///
> 2020-09-06_v5.csv.zip ///
> 2020-09-08_v5.csv.zip ///
> 2020-09-12_v5.csv.zip ///
> 2020-09-15_v5.csv.zip ///
> 2020-09-19_v5.csv.zip ///
> 2020-09-23_v5.csv.zip ///
> 2020-09-25_v5.csv.zip ///
> 2020-10-03_v5.csv.zip ///
> 2020-10-06_v5.csv.zip ///
> 2020-10-12_v5.csv.zip ///
> 2020-10-19_v5.csv.zip ///
> 2020-10-25_v5.csv.zip ///
> 2020-10-28_v5.csv.zip ///
> 2020-11-01_v5.csv.zip ///
> 2020-11-10_v6.csv.zip ///
> 2020-11-14_v6.csv.zip ///
> 2020-11-18_v6.csv.zip ///
> 2020-11-23_v6.csv.zip ///
> 2020-11-29_v6.csv.zip ///
> 2020-12-04_v6.csv.zip ///
> 2020-12-12_v6.csv.zip ///
> 2020-12-20_v6.csv.zip ///
> 2020-12-26_v6.csv.zip ///
> 
> 2021-01-04_v6.csv.zip ///
> 2021-01-10_v6.csv.zip ///
> 2021-01-12_v6.csv.zip ///
> 2021-01-18_v7.csv.zip ///
> 2021-01-24_v7.csv.zip ///
> 2021-01-30_v7.csv.zip ///
> 2021-02-03_v7.csv.zip ///
> 2021-02-10_v7.csv.zip ///
> 2021-02-17_v7.csv.zip ///
> 2021-02-26_v7.csv.zip ///
> 2021-03-05_v7.csv.zip ///
> 2021-03-12_v7.csv.zip ///
> 2021-03-19_v7.csv.zip ///
> 2021-03-29_v7.csv.zip ///
> 2021-04-06_v7.csv.zip ///
> 2021-04-17_v7.csv.zip ///
> 2021-04-24_v7.csv.zip ///
> 2021-05-10_v8.csv.zip ///
> 2021-05-16_v8.csv.zip ///
> 2021-05-22_v8.csv.zip ///
> 2021-05-27_v8.csv.zip ///
> 2021-06-04_v8.csv.zip ///
> 2021-06-11_v8.csv.zip ///
> 2021-06-18_v8.csv.zip ///
> 2021-06-26_v8.csv.zip ///
> 2021-07-02_v8.csv.zip ///
> 2021-07-09_v8.csv.zip ///
> 2021-07-19_v8.csv.zip ///
> 2021-08-06_v8.csv.zip ///
> 2021-08-19_v8.csv.zip ///
> 2021-08-25_v8.csv.zip ///
> 2021-09-09_v8.csv.zip ///
> 2021-09-24_v8.csv.zip ///
> 2021-10-06_v8.csv.zip ///
> 2021-10-21_v8.csv.zip ///
> 2021-10-27_v8.csv.zip ///
> 2021-11-03_v9.csv.zip ///
> 2021-11-15_v9.csv.zip ///
> 2021-11-21_v9.csv.zip ///
> 2021-11-29_v9.csv.zip ///
> 2021-12-05_v9.csv.zip ///
> 2021-12-13_v9.csv.zip ///
> 2021-12-26_v9.csv.zip 
> 
> 
> */
. 
. 
. 
. 
. 
. 
. 
. * update 2021-01-10 20210110
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-01-10_v6.csv.zip 2021-01-10_v6.csv.zip
{txt}
{com}. unzipfile 2021-01-10_v6.csv.zip, replace
{res}{txt}    inflating: 2021-01-10_v6.csv
successfully unzipped 2021-01-10_v6.csv.zip to current directory

{com}. erase 2021-01-10_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-01-10_v6.csv", clear varnames(1) 
{res}{text}(14 vars, 4,760,406 obs)

{com}. 
. keep if country == "$country"
{txt}(4,730,376 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(25,025 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,550 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21925{txt},{res}22379{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}11jan2020{txt},{res}09apr2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}455{col 51}{txt}missing .:  {res}0{txt}/{res}455

{txt}{col 19}mean:{res}{col 26}   22152{txt} = {res}25aug2020{txt}
{col 15}std. dev:{res}{col 26} 131.491

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21970{col 37}   22038{col 47}   22152{col 57}   22266{col 67}   22334
{col 26}25feb2020{col 36}03may2020{col 46}25aug2020{col 56}17dec2020{col 66}23feb2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210110
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210110.dta", replace
{txt}file IMPE 20210110.dta saved

{com}. 
. 
. shell rm -r "2021-01-10_v6.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-01-12 20210112
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-01-12_v6.csv.zip 2021-01-12_v6.csv.zip
{txt}
{com}. unzipfile 2021-01-12_v6.csv.zip, replace
{res}{txt}    inflating: 2021-01-12_v6.csv
successfully unzipped 2021-01-12_v6.csv.zip to current directory

{com}. erase 2021-01-12_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-01-12_v6.csv", clear varnames(1) 
{res}{text}(14 vars, 4,799,847 obs)

{com}. 
. keep if country == "$country"
{txt}(4,769,751 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(25,080 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,560 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21926{txt},{res}22381{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}12jan2020{txt},{res}11apr2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}456{col 51}{txt}missing .:  {res}0{txt}/{res}456

{txt}{col 19}mean:{res}{col 26} 22153.5{txt} = {res}26aug2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  131.78

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21971{col 37} 22039.5{col 47} 22153.5{col 57} 22267.5{col 67}   22336
{col 26}26feb2020{col 36}04may2020{col 46}26aug2020{col 56}18dec2020{col 66}25feb2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210112
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210112.dta", replace
{txt}(note: file IMPE 20210112.dta not found)
file IMPE 20210112.dta saved

{com}. 
. 
. shell rm -r "2021-01-12_v6.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-01-18 20210118
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-01-18_v7.csv.zip 2021-01-18_v7.csv.zip
{txt}
{com}. unzipfile 2021-01-18_v7.csv.zip, replace
{res}{txt}    inflating: 2021-01-18_v7.csv
successfully unzipped 2021-01-18_v7.csv.zip to current directory

{com}. erase 2021-01-18_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-01-18_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 4,868,028 obs)

{com}. 
. keep if country == "$country"
{txt}(4,837,602 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(25,355 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,610 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21927{txt},{res}22387{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}13jan2020{txt},{res}17apr2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}461{col 51}{txt}missing .:  {res}0{txt}/{res}461

{txt}{col 19}mean:{res}{col 26}   22157{txt} = {res}30aug2020{txt}
{col 15}std. dev:{res}{col 26} 133.223

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21973{col 37}   22042{col 47}   22157{col 57}   22272{col 67}   22341
{col 26}28feb2020{col 36}07may2020{col 46}30aug2020{col 56}23dec2020{col 66}02mar2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210118
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210118.dta", replace
{txt}(note: file IMPE 20210118.dta not found)
file IMPE 20210118.dta saved

{com}. 
. 
. shell rm -r "2021-01-18_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-01-24 20210124
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-01-24_v7.csv.zip 2021-01-24_v7.csv.zip
{txt}
{com}. unzipfile 2021-01-24_v7.csv.zip, replace
{res}{txt}    inflating: 2021-01-24_v7.csv
successfully unzipped 2021-01-24_v7.csv.zip to current directory

{com}. erase 2021-01-24_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-01-24_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 4,945,002 obs)

{com}. 
. keep if country == "$country"
{txt}(4,914,114 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(25,740 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,680 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21926{txt},{res}22393{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}12jan2020{txt},{res}23apr2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}468{col 51}{txt}missing .:  {res}0{txt}/{res}468

{txt}{col 19}mean:{res}{col 26} 22159.5{txt} = {res}01sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 135.244

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21972{col 37} 22042.5{col 47} 22159.5{col 57} 22276.5{col 67}   22347
{col 26}27feb2020{col 36}07may2020{col 46}01sep2020{col 56}27dec2020{col 66}08mar2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210124
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210124.dta", replace
{txt}(note: file IMPE 20210124.dta not found)
file IMPE 20210124.dta saved

{com}. 
. 
. shell rm -r "2021-01-24_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-01-30 20210130
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-01-30_v7.csv.zip 2021-01-30_v7.csv.zip
{txt}
{com}. unzipfile 2021-01-30_v7.csv.zip, replace
{res}{txt}    inflating: 2021-01-30_v7.csv
successfully unzipped 2021-01-30_v7.csv.zip to current directory

{com}. erase 2021-01-30_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-01-30_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 4,988,982 obs)

{com}. 
. keep if country == "$country"
{txt}(4,957,566 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(26,180 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,760 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21924{txt},{res}22399{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}10jan2020{txt},{res}29apr2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}476{col 51}{txt}missing .:  {res}0{txt}/{res}476

{txt}{col 19}mean:{res}{col 26} 22161.5{txt} = {res}03sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 137.554

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21971{col 37} 22042.5{col 47} 22161.5{col 57} 22280.5{col 67}   22352
{col 26}26feb2020{col 36}07may2020{col 46}03sep2020{col 56}31dec2020{col 66}13mar2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210130
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210130.dta", replace
{txt}(note: file IMPE 20210130.dta not found)
file IMPE 20210130.dta saved

{com}. 
. 
. shell rm -r "2021-01-30_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-02-03 20210203
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-02-03_v7.csv.zip 2021-02-03_v7.csv.zip
{txt}
{com}. unzipfile 2021-02-03_v7.csv.zip, replace
{res}{txt}    inflating: 2021-02-03_v7.csv
successfully unzipped 2021-02-03_v7.csv.zip to current directory

{com}. erase 2021-02-03_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-02-03_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 5,019,957 obs)

{com}. 
. keep if country == "$country"
{txt}(4,988,343 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(26,345 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,790 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21925{txt},{res}22403{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}11jan2020{txt},{res}03may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}479{col 51}{txt}missing .:  {res}0{txt}/{res}479

{txt}{col 19}mean:{res}{col 26}   22164{txt} = {res}06sep2020{txt}
{col 15}std. dev:{res}{col 26}  138.42

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21972{col 37}   22044{col 47}   22164{col 57}   22284{col 67}   22356
{col 26}27feb2020{col 36}09may2020{col 46}06sep2020{col 56}04jan2021{col 66}17mar2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210203
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210203.dta", replace
{txt}(note: file IMPE 20210203.dta not found)
file IMPE 20210203.dta saved

{com}. 
. 
. shell rm -r "2021-02-03_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-02-10 20210210
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-02-10_v7.csv.zip 2021-02-10_v7.csv.zip
{txt}
{com}. unzipfile 2021-02-10_v7.csv.zip, replace
{res}{txt}    inflating: 2021-02-10_v7.csv
successfully unzipped 2021-02-10_v7.csv.zip to current directory

{com}. erase 2021-02-10_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-02-10_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 5,123,682 obs)

{com}. 
. keep if country == "$country"
{txt}(5,091,564 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(26,765 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,866 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21924{txt},{res}22410{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}10jan2020{txt},{res}10may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}487{col 51}{txt}missing .:  {res}0{txt}/{res}487

{txt}{col 19}mean:{res}{col 26}   22167{txt} = {res}09sep2020{txt}
{col 15}std. dev:{res}{col 26} 140.729

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21972{col 37}   22045{col 47}   22167{col 57}   22289{col 67}   22362
{col 26}27feb2020{col 36}10may2020{col 46}09sep2020{col 56}09jan2021{col 66}23mar2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210210
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210210.dta", replace
{txt}(note: file IMPE 20210210.dta not found)
file IMPE 20210210.dta saved

{com}. 
. 
. shell rm -r "2021-02-10_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. 
. 
. 
. * update 2021-02-17 20210217
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-02-17_v7.csv.zip 2021-02-17_v7.csv.zip
{txt}
{com}. unzipfile 2021-02-17_v7.csv.zip, replace
{res}{txt}    inflating: 2021-02-17_v7.csv
successfully unzipped 2021-02-17_v7.csv.zip to current directory

{com}. erase 2021-02-17_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-02-17_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 5,207,793 obs)

{com}. 
. keep if country == "$country"
{txt}(5,175,147 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(27,205 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,946 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21923{txt},{res}22417{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09jan2020{txt},{res}17may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}495{col 51}{txt}missing .:  {res}0{txt}/{res}495

{txt}{col 19}mean:{res}{col 26}   22170{txt} = {res}12sep2020{txt}
{col 15}std. dev:{res}{col 26} 143.038

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21972{col 37}   22046{col 47}   22170{col 57}   22294{col 67}   22368
{col 26}27feb2020{col 36}11may2020{col 46}12sep2020{col 56}14jan2021{col 66}29mar2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210217
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210217.dta", replace
{txt}(note: file IMPE 20210217.dta not found)
file IMPE 20210217.dta saved

{com}. 
. 
. shell rm -r "2021-02-17_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. 
. 
. 
. 
. 
. 
. * update 2021-02-26 20210226
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-02-26_v7.csv.zip 2021-02-26_v7.csv.zip
{txt}
{com}. unzipfile 2021-02-26_v7.csv.zip, replace
{res}{txt}    inflating: 2021-02-26_v7.csv
successfully unzipped 2021-02-26_v7.csv.zip to current directory

{com}. erase 2021-02-26_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-02-26_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 5,308,482 obs)

{com}. 
. keep if country == "$country"
{txt}(5,275,329 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(27,633 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(5,018 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21925{txt},{res}22426{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}11jan2020{txt},{res}26may2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}502{col 51}{txt}missing .:  {res}0{txt}/{res}502

{txt}{col 19}mean:{res}{col 26} 22175.5{txt} = {res}17sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 145.059

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21975{col 37}   22050{col 47} 22175.5{col 57}   22301{col 67}   22376
{col 26}01mar2020{col 36}15may2020{col 46}17sep2020{col 56}21jan2021{col 66}06apr2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210226
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210226.dta", replace
{txt}(note: file IMPE 20210226.dta not found)
file IMPE 20210226.dta saved

{com}. 
. 
. shell rm -r "2021-02-26_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-03-05 20210305
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-03-05_v7.csv.zip 2021-03-05_v7.csv.zip
{txt}
{com}. unzipfile 2021-03-05_v7.csv.zip, replace
{res}{txt}    inflating: 2021-03-05_v7.csv
successfully unzipped 2021-03-05_v7.csv.zip to current directory

{com}. erase 2021-03-05_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-03-05_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 5,398,599 obs)

{com}. 
. keep if country == "$country"
{txt}(5,365,137 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(27,885 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(5,070 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21927{txt},{res}22433{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}13jan2020{txt},{res}02jun2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}507{col 51}{txt}missing .:  {res}0{txt}/{res}507

{txt}{col 19}mean:{res}{col 26}   22180{txt} = {res}22sep2020{txt}
{col 15}std. dev:{res}{col 26} 146.503

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21977{col 37}   22053{col 47}   22180{col 57}   22307{col 67}   22383
{col 26}03mar2020{col 36}18may2020{col 46}22sep2020{col 56}27jan2021{col 66}13apr2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210305
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210305.dta", replace
{txt}(note: file IMPE 20210305.dta not found)
file IMPE 20210305.dta saved

{com}. 
. 
. shell rm -r "2021-03-05_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-03-12 20210312
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-03-12_v7.csv.zip 2021-03-12_v7.csv.zip
{txt}
{com}. unzipfile 2021-03-12_v7.csv.zip, replace
{res}{txt}    inflating: 2021-03-12_v7.csv
successfully unzipped 2021-03-12_v7.csv.zip to current directory

{com}. erase 2021-03-12_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-03-12_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 5,467,032 obs)

{com}. 
. keep if country == "$country"
{txt}(5,432,988 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(28,370 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(5,158 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21925{txt},{res}22440{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}11jan2020{txt},{res}09jun2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}516{col 51}{txt}missing .:  {res}0{txt}/{res}516

{txt}{col 19}mean:{res}{col 26} 22182.5{txt} = {res}24sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 149.101

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21976{col 37} 22053.5{col 47} 22182.5{col 57} 22311.5{col 67}   22389
{col 26}02mar2020{col 36}18may2020{col 46}24sep2020{col 56}31jan2021{col 66}19apr2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210312
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210312.dta", replace
{txt}(note: file IMPE 20210312.dta not found)
file IMPE 20210312.dta saved

{com}. 
. 
. shell rm -r "2021-03-12_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-03-19 20210319
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-03-19_v7.csv.zip 2021-03-19_v7.csv.zip
{txt}
{com}. unzipfile 2021-03-19_v7.csv.zip, replace
{res}{txt}    inflating: 2021-03-19_v7.csv
successfully unzipped 2021-03-19_v7.csv.zip to current directory

{com}. erase 2021-03-19_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-03-19_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 5,547,303 obs)

{com}. 
. keep if country == "$country"
{txt}(5,512,731 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(28,810 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(5,238 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21924{txt},{res}22447{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}10jan2020{txt},{res}16jun2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}524{col 51}{txt}missing .:  {res}0{txt}/{res}524

{txt}{col 19}mean:{res}{col 26} 22185.5{txt} = {res}27sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  151.41

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21976{col 37} 22054.5{col 47} 22185.5{col 57} 22316.5{col 67}   22395
{col 26}02mar2020{col 36}19may2020{col 46}27sep2020{col 56}05feb2021{col 66}25apr2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210319
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210319.dta", replace
{txt}(note: file IMPE 20210319.dta not found)
file IMPE 20210319.dta saved

{com}. 
. 
. shell rm -r "2021-03-19_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-03-29 20210329
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-03-29_v7.csv.zip 2021-03-29_v7.csv.zip
{txt}
{com}. unzipfile 2021-03-29_v7.csv.zip, replace
{res}{txt}    inflating: 2021-03-29_v7.csv
successfully unzipped 2021-03-29_v7.csv.zip to current directory

{com}. erase 2021-03-29_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-03-29_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 5,669,154 obs)

{com}. 
. keep if country == "$country"
{txt}(5,633,586 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(29,640 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(5,388 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21918{txt},{res}22457{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}04jan2020{txt},{res}26jun2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}540{col 51}{txt}missing .:  {res}0{txt}/{res}540

{txt}{col 19}mean:{res}{col 26} 22187.5{txt} = {res}29sep2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 156.029

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 21971.5{col 37} 22052.5{col 47} 22187.5{col 57} 22322.5{col 67} 22403.5
{col 26}26feb2020{col 36}17may2020{col 46}29sep2020{col 56}11feb2021{col 66}03may2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210329
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210329.dta", replace
{txt}(note: file IMPE 20210329.dta not found)
file IMPE 20210329.dta saved

{com}. 
. 
. shell rm -r "2021-03-29_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-04-06 20210406
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-04-06_v7.csv.zip 2021-04-06_v7.csv.zip
{txt}
{com}. unzipfile 2021-04-06_v7.csv.zip, replace
{res}{txt}    inflating: 2021-04-06_v7.csv
successfully unzipped 2021-04-06_v7.csv.zip to current directory

{com}. erase 2021-04-06_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-04-06_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 5,752,797 obs)

{com}. 
. keep if country == "$country"
{txt}(5,716,917 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(29,900 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(5,436 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21922{txt},{res}22465{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}08jan2020{txt},{res}04jul2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}544{col 51}{txt}missing .:  {res}0{txt}/{res}544

{txt}{col 19}mean:{res}{col 26} 22193.5{txt} = {res}05oct2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 157.184

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21976{col 37} 22057.5{col 47} 22193.5{col 57} 22329.5{col 67}   22411
{col 26}02mar2020{col 36}22may2020{col 46}05oct2020{col 56}18feb2021{col 66}11may2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210406
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210406.dta", replace
{txt}(note: file IMPE 20210406.dta not found)
file IMPE 20210406.dta saved

{com}. 
. 
. shell rm -r "2021-04-06_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-04-17 20210417
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-04-17_v7.csv.zip 2021-04-17_v7.csv.zip
{txt}
{com}. unzipfile 2021-04-17_v7.csv.zip, replace
{res}{txt}    inflating: 2021-04-17_v7.csv
successfully unzipped 2021-04-17_v7.csv.zip to current directory

{com}. erase 2021-04-17_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-04-17_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 5,900,553 obs)

{com}. 
. keep if country == "$country"
{txt}(5,863,989 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(30,470 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(5,540 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21923{txt},{res}22476{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09jan2020{txt},{res}15jul2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}554{col 51}{txt}missing .:  {res}0{txt}/{res}554

{txt}{col 19}mean:{res}{col 26} 22199.5{txt} = {res}11oct2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  160.07

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21978{col 37}   22061{col 47} 22199.5{col 57}   22338{col 67}   22421
{col 26}04mar2020{col 36}26may2020{col 46}11oct2020{col 56}27feb2021{col 66}21may2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210417
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210417.dta", replace
{txt}(note: file IMPE 20210417.dta not found)
file IMPE 20210417.dta saved

{com}. 
. 
. shell rm -r "2021-04-17_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-04-17 20210424
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-04-17_v7.csv.zip 2021-04-17_v7.csv.zip
{txt}
{com}. unzipfile 2021-04-17_v7.csv.zip, replace
{res}{txt}    inflating: 2021-04-17_v7.csv
successfully unzipped 2021-04-17_v7.csv.zip to current directory

{com}. erase 2021-04-17_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-04-17_v7.csv", clear varnames(1) 
{res}{text}(14 vars, 5,900,553 obs)

{com}. 
. keep if country == "$country"
{txt}(5,863,989 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(30,470 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(5,540 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21923{txt},{res}22476{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09jan2020{txt},{res}15jul2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}554{col 51}{txt}missing .:  {res}0{txt}/{res}554

{txt}{col 19}mean:{res}{col 26} 22199.5{txt} = {res}11oct2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  160.07

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21978{col 37}   22061{col 47} 22199.5{col 57}   22338{col 67}   22421
{col 26}04mar2020{col 36}26may2020{col 46}11oct2020{col 56}27feb2021{col 66}21may2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210424
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210424.dta", replace
{txt}(note: file IMPE 20210424.dta not found)
file IMPE 20210424.dta saved

{com}. 
. 
. shell rm -r "2021-04-17_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-05-10 20210510
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-05-10_v8.csv.zip 2021-05-10_v8.csv.zip
{txt}
{com}. unzipfile 2021-05-10_v8.csv.zip, replace
{res}{txt}    inflating: 2021-05-10_v8.csv
successfully unzipped 2021-05-10_v8.csv.zip to current directory

{com}. erase 2021-05-10_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-05-10_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 5,039,826 obs)

{com}. 
. keep if country == "$country"
{txt}(5,008,734 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(25,910 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(4,607 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21925{txt},{res}22499{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}11jan2020{txt},{res}07aug2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}575{col 51}{txt}missing .:  {res}0{txt}/{res}575

{txt}{col 19}mean:{res}{col 26}   22212{txt} = {res}24oct2020{txt}
{col 15}std. dev:{res}{col 26} 166.132

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21982{col 37}   22068{col 47}   22212{col 57}   22356{col 67}   22442
{col 26}08mar2020{col 36}02jun2020{col 46}24oct2020{col 56}17mar2021{col 66}11jun2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210510
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210510.dta", replace
{txt}(note: file IMPE 20210510.dta not found)
file IMPE 20210510.dta saved

{com}. 
. 
. shell rm -r "2021-05-10_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-05-16 20210516
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-05-16_v8.csv.zip 2021-05-16_v8.csv.zip
{txt}
{com}. unzipfile 2021-05-16_v8.csv.zip, replace
{res}{txt}    inflating: 2021-05-16_v8.csv
successfully unzipped 2021-05-16_v8.csv.zip to current directory

{com}. erase 2021-05-16_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-05-16_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 6,238,974 obs)

{com}. 
. keep if country == "$country"
{txt}(6,200,574 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(32,000 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(5,819 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21925{txt},{res}22505{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}11jan2020{txt},{res}13aug2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}581{col 51}{txt}missing .:  {res}0{txt}/{res}581

{txt}{col 19}mean:{res}{col 26}   22215{txt} = {res}27oct2020{txt}
{col 15}std. dev:{res}{col 26} 167.865

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21983{col 37}   22070{col 47}   22215{col 57}   22360{col 67}   22447
{col 26}09mar2020{col 36}04jun2020{col 46}27oct2020{col 56}21mar2021{col 66}16jun2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210516
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210516.dta", replace
{txt}(note: file IMPE 20210516.dta not found)
file IMPE 20210516.dta saved

{com}. 
. 
. shell rm -r "2021-05-16_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-05-22 20210522
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-05-22_v8.csv.zip 2021-05-22_v8.csv.zip
{txt}
{com}. unzipfile 2021-05-22_v8.csv.zip, replace
{res}{txt}    inflating: 2021-05-22_v8.csv
successfully unzipped 2021-05-22_v8.csv.zip to current directory

{com}. erase 2021-05-22_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-05-22_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 6,315,303 obs)

{com}. 
. keep if country == "$country"
{txt}(6,276,441 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(32,385 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(5,889 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21924{txt},{res}22511{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}10jan2020{txt},{res}19aug2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}588{col 51}{txt}missing .:  {res}0{txt}/{res}588

{txt}{col 19}mean:{res}{col 26} 22217.5{txt} = {res}29oct2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 169.885

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21982{col 37} 22070.5{col 47} 22217.5{col 57} 22364.5{col 67}   22453
{col 26}08mar2020{col 36}04jun2020{col 46}29oct2020{col 56}25mar2021{col 66}22jun2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210522
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210522.dta", replace
{txt}(note: file IMPE 20210522.dta not found)
file IMPE 20210522.dta saved

{com}. 
. 
. shell rm -r "2021-05-22_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-05-27 20210527
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-05-27_v8.csv.zip 2021-05-27_v8.csv.zip
{txt}
{com}. unzipfile 2021-05-27_v8.csv.zip, replace
{res}{txt}    inflating: 2021-05-27_v8.csv
successfully unzipped 2021-05-27_v8.csv.zip to current directory

{com}. erase 2021-05-27_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-05-27_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 6,380,577 obs)

{com}. 
. keep if country == "$country"
{txt}(6,341,319 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(32,715 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(5,949 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21923{txt},{res}22516{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09jan2020{txt},{res}24aug2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}594{col 51}{txt}missing .:  {res}0{txt}/{res}594

{txt}{col 19}mean:{res}{col 26} 22219.5{txt} = {res}31oct2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 171.617

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21982{col 37}   22071{col 47} 22219.5{col 57}   22368{col 67}   22457
{col 26}08mar2020{col 36}05jun2020{col 46}31oct2020{col 56}29mar2021{col 66}26jun2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210527
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210527.dta", replace
{txt}(note: file IMPE 20210527.dta not found)
file IMPE 20210527.dta saved

{com}. 
. 
. shell rm -r "2021-05-27_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-06-04 20210604
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-06-04_v8.csv.zip 2021-06-04_v8.csv.zip
{txt}
{com}. unzipfile 2021-06-04_v8.csv.zip, replace
{res}{txt}    inflating: 2021-06-04_v8.csv
successfully unzipped 2021-06-04_v8.csv.zip to current directory

{com}. erase 2021-06-04_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-06-04_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 6,484,692 obs)

{com}. 
. keep if country == "$country"
{txt}(6,444,840 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(33,210 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(6,039 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21922{txt},{res}22524{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}08jan2020{txt},{res}01sep2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}603{col 51}{txt}missing .:  {res}0{txt}/{res}603

{txt}{col 19}mean:{res}{col 26}   22223{txt} = {res}04nov2020{txt}
{col 15}std. dev:{res}{col 26} 174.215

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21982{col 37}   22072{col 47}   22223{col 57}   22374{col 67}   22464
{col 26}08mar2020{col 36}06jun2020{col 46}04nov2020{col 56}04apr2021{col 66}03jul2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210604
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210604.dta", replace
{txt}(note: file IMPE 20210604.dta not found)
file IMPE 20210604.dta saved

{com}. 
. 
. shell rm -r "2021-06-04_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-06-11 20210611
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-06-11_v8.csv.zip 2021-06-11_v8.csv.zip
{txt}
{com}. unzipfile 2021-06-11_v8.csv.zip, replace
{res}{txt}    inflating: 2021-06-11_v8.csv
successfully unzipped 2021-06-11_v8.csv.zip to current directory

{com}. erase 2021-06-11_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-06-11_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 6,573,330 obs)

{com}. 
. keep if country == "$country"
{txt}(6,532,950 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(33,650 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(6,119 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21921{txt},{res}22531{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}07jan2020{txt},{res}08sep2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}611{col 51}{txt}missing .:  {res}0{txt}/{res}611

{txt}{col 19}mean:{res}{col 26}   22226{txt} = {res}07nov2020{txt}
{col 15}std. dev:{res}{col 26} 176.525

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21982{col 37}   22073{col 47}   22226{col 57}   22379{col 67}   22470
{col 26}08mar2020{col 36}07jun2020{col 46}07nov2020{col 56}09apr2021{col 66}09jul2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210611
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210611.dta", replace
{txt}(note: file IMPE 20210611.dta not found)
file IMPE 20210611.dta saved

{com}. 
. 
. shell rm -r "2021-06-11_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-06-18 20210618
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-06-18_v8.csv.zip 2021-06-18_v8.csv.zip
{txt}
{com}. unzipfile 2021-06-18_v8.csv.zip, replace
{res}{txt}    inflating: 2021-06-18_v8.csv
successfully unzipped 2021-06-18_v8.csv.zip to current directory

{com}. erase 2021-06-18_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-06-18_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 6,663,123 obs)

{com}. 
. keep if country == "$country"
{txt}(6,622,215 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(34,090 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(6,199 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21920{txt},{res}22538{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}06jan2020{txt},{res}15sep2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}619{col 51}{txt}missing .:  {res}0{txt}/{res}619

{txt}{col 19}mean:{res}{col 26}   22229{txt} = {res}10nov2020{txt}
{col 15}std. dev:{res}{col 26} 178.834

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21981{col 37}   22074{col 47}   22229{col 57}   22384{col 67}   22477
{col 26}07mar2020{col 36}08jun2020{col 46}10nov2020{col 56}14apr2021{col 66}16jul2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210618
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210618.dta", replace
{txt}(note: file IMPE 20210618.dta not found)
file IMPE 20210618.dta saved

{com}. 
. 
. shell rm -r "2021-06-18_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-06-26 20210626
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-06-26_v8.csv.zip 2021-06-26_v8.csv.zip
{txt}
{com}. unzipfile 2021-06-26_v8.csv.zip, replace
{res}{txt}    inflating: 2021-06-26_v8.csv
successfully unzipped 2021-06-26_v8.csv.zip to current directory

{com}. erase 2021-06-26_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-06-26_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 6,763,377 obs)

{com}. 
. keep if country == "$country"
{txt}(6,721,875 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(34,585 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(6,289 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21919{txt},{res}22546{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}05jan2020{txt},{res}23sep2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}628{col 51}{txt}missing .:  {res}0{txt}/{res}628

{txt}{col 19}mean:{res}{col 26} 22232.5{txt} = {res}13nov2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 181.432

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21981{col 37} 22075.5{col 47} 22232.5{col 57} 22389.5{col 67}   22484
{col 26}07mar2020{col 36}09jun2020{col 46}13nov2020{col 56}19apr2021{col 66}23jul2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210626
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210626.dta", replace
{txt}(note: file IMPE 20210626.dta not found)
file IMPE 20210626.dta saved

{com}. 
. 
. shell rm -r "2021-06-26_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-07-02 20210702
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-07-02_v8.csv.zip 2021-07-02_v8.csv.zip
{txt}
{com}. unzipfile 2021-07-02_v8.csv.zip, replace
{res}{txt}    inflating: 2021-07-02_v8.csv
successfully unzipped 2021-07-02_v8.csv.zip to current directory

{com}. erase 2021-07-02_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-07-02_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 6,838,551 obs)

{com}. 
. keep if country == "$country"
{txt}(6,796,587 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(34,970 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(6,359 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21918{txt},{res}22552{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}04jan2020{txt},{res}29sep2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}635{col 51}{txt}missing .:  {res}0{txt}/{res}635

{txt}{col 19}mean:{res}{col 26}   22235{txt} = {res}16nov2020{txt}
{col 15}std. dev:{res}{col 26} 183.453

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21981{col 37}   22076{col 47}   22235{col 57}   22394{col 67}   22489
{col 26}07mar2020{col 36}10jun2020{col 46}16nov2020{col 56}24apr2021{col 66}28jul2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210702
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210702.dta", replace
{txt}(note: file IMPE 20210702.dta not found)
file IMPE 20210702.dta saved

{com}. 
. 
. shell rm -r "2021-07-02_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-07-09 20210709
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-07-09_v8.csv.zip 2021-07-09_v8.csv.zip
{txt}
{com}. unzipfile 2021-07-09_v8.csv.zip, replace
{res}{txt}    inflating: 2021-07-09_v8.csv
successfully unzipped 2021-07-09_v8.csv.zip to current directory

{com}. erase 2021-07-09_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-07-09_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 6,927,948 obs)

{com}. 
. keep if country == "$country"
{txt}(6,885,456 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(35,410 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(6,439 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21917{txt},{res}22559{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}03jan2020{txt},{res}06oct2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}643{col 51}{txt}missing .:  {res}0{txt}/{res}643

{txt}{col 19}mean:{res}{col 26}   22238{txt} = {res}19nov2020{txt}
{col 15}std. dev:{res}{col 26} 185.762

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21981{col 37}   22077{col 47}   22238{col 57}   22399{col 67}   22495
{col 26}07mar2020{col 36}11jun2020{col 46}19nov2020{col 56}29apr2021{col 66}03aug2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210709
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210709.dta", replace
{txt}(note: file IMPE 20210709.dta not found)
file IMPE 20210709.dta saved

{com}. 
. 
. shell rm -r "2021-07-09_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-07-19 20210719
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-07-19_v8.csv.zip 2021-07-19_v8.csv.zip
{txt}
{com}. unzipfile 2021-07-19_v8.csv.zip, replace
{res}{txt}    inflating: 2021-07-19_v8.csv
successfully unzipped 2021-07-19_v8.csv.zip to current directory

{com}. erase 2021-07-19_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-07-19_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 7,053,348 obs)

{com}. 
. keep if country == "$country"
{txt}(7,010,130 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(36,015 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(6,549 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21916{txt},{res}22569{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}02jan2020{txt},{res}16oct2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}654{col 51}{txt}missing .:  {res}0{txt}/{res}654

{txt}{col 19}mean:{res}{col 26} 22242.5{txt} = {res}23nov2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 188.938

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21981{col 37}   22079{col 47} 22242.5{col 57}   22406{col 67}   22504
{col 26}07mar2020{col 36}13jun2020{col 46}23nov2020{col 56}06may2021{col 66}12aug2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210719
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210719.dta", replace
{txt}(note: file IMPE 20210719.dta not found)
file IMPE 20210719.dta saved

{com}. 
. 
. shell rm -r "2021-07-19_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-08-06 20210806
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-08-06_v8.csv.zip 2021-08-06_v8.csv.zip
{txt}
{com}. unzipfile 2021-08-06_v8.csv.zip, replace
{res}{txt}    inflating: 2021-08-06_v8.csv
successfully unzipped 2021-08-06_v8.csv.zip to current directory

{com}. erase 2021-08-06_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-08-06_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 7,271,544 obs)

{com}. 
. keep if country == "$country"
{txt}(7,227,072 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(37,060 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(6,739 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22587{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}03nov2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}673{col 51}{txt}missing .:  {res}0{txt}/{res}673

{txt}{col 19}mean:{res}{col 26}   22251{txt} = {res}02dec2020{txt}
{col 15}std. dev:{res}{col 26} 194.423

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21982{col 37}   22083{col 47}   22251{col 57}   22419{col 67}   22520
{col 26}08mar2020{col 36}17jun2020{col 46}02dec2020{col 56}19may2021{col 66}28aug2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210806
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210806.dta", replace
{txt}(note: file IMPE 20210806.dta not found)
file IMPE 20210806.dta saved

{com}. 
. 
. shell rm -r "2021-08-06_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-08-19 20210819
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-08-19_v8.csv.zip 2021-08-19_v8.csv.zip
{txt}
{com}. unzipfile 2021-08-19_v8.csv.zip, replace
{res}{txt}    inflating: 2021-08-19_v8.csv
successfully unzipped 2021-08-19_v8.csv.zip to current directory

{com}. erase 2021-08-19_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-08-19_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 7,432,683 obs)

{com}. 
. keep if country == "$country"
{txt}(7,387,254 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(37,852 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(6,889 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21913{txt},{res}22600{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}30dec2019{txt},{res}16nov2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}688{col 51}{txt}missing .:  {res}0{txt}/{res}688

{txt}{col 19}mean:{res}{col 26} 22256.5{txt} = {res}07dec2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 198.753

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21981{col 37} 22084.5{col 47} 22256.5{col 57} 22428.5{col 67}   22532
{col 26}07mar2020{col 36}18jun2020{col 46}07dec2020{col 56}28may2021{col 66}09sep2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210819
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210819.dta", replace
{txt}(note: file IMPE 20210819.dta not found)
file IMPE 20210819.dta saved

{com}. 
. 
. shell rm -r "2021-08-19_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-08-25 20210825
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-08-25_v8.csv.zip 2021-08-25_v8.csv.zip
{txt}
{com}. unzipfile 2021-08-25_v8.csv.zip, replace
{res}{txt}    inflating: 2021-08-25_v8.csv
successfully unzipped 2021-08-25_v8.csv.zip to current directory

{com}. erase 2021-08-25_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-08-25_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 7,507,791 obs)

{com}. 
. keep if country == "$country"
{txt}(7,461,933 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(38,215 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(6,949 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21913{txt},{res}22606{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}30dec2019{txt},{res}22nov2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}694{col 51}{txt}missing .:  {res}0{txt}/{res}694

{txt}{col 19}mean:{res}{col 26} 22259.5{txt} = {res}10dec2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 200.485

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21982{col 37}   22086{col 47} 22259.5{col 57}   22433{col 67}   22537
{col 26}08mar2020{col 36}20jun2020{col 46}10dec2020{col 56}02jun2021{col 66}14sep2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210825
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210825.dta", replace
{txt}(note: file IMPE 20210825.dta not found)
file IMPE 20210825.dta saved

{com}. 
. 
. shell rm -r "2021-08-25_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-09-09 20210909
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-09-09_v8.csv.zip 2021-09-09_v8.csv.zip
{txt}
{com}. unzipfile 2021-09-09_v8.csv.zip, replace
{res}{txt}    inflating: 2021-09-09_v8.csv
successfully unzipped 2021-09-09_v8.csv.zip to current directory

{com}. erase 2021-09-09_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-09-09_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 7,684,638 obs)

{com}. 
. keep if country == "$country"
{txt}(7,637,790 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(39,040 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(7,099 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21913{txt},{res}22621{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}30dec2019{txt},{res}07dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}709{col 51}{txt}missing .:  {res}0{txt}/{res}709

{txt}{col 19}mean:{res}{col 26}   22267{txt} = {res}18dec2020{txt}
{col 15}std. dev:{res}{col 26} 204.815

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21983{col 37}   22090{col 47}   22267{col 57}   22444{col 67}   22551
{col 26}09mar2020{col 36}24jun2020{col 46}18dec2020{col 56}13jun2021{col 66}28sep2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210909
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210909.dta", replace
{txt}(note: file IMPE 20210909.dta not found)
file IMPE 20210909.dta saved

{com}. 
. 
. shell rm -r "2021-09-09_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-09-24 20210924
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-09-24_v8.csv.zip 2021-09-24_v8.csv.zip
{txt}
{com}. unzipfile 2021-09-24_v8.csv.zip, replace
{res}{txt}    inflating: 2021-09-24_v8.csv
successfully unzipped 2021-09-24_v8.csv.zip to current directory

{com}. erase 2021-09-24_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-09-24_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 7,863,201 obs)

{com}. 
. keep if country == "$country"
{txt}(7,815,330 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(39,898 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(7,249 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21913{txt},{res}22636{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}30dec2019{txt},{res}22dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}724{col 51}{txt}missing .:  {res}0{txt}/{res}724

{txt}{col 19}mean:{res}{col 26} 22274.5{txt} = {res}25dec2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 209.145

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37} 22093.5{col 47} 22274.5{col 57} 22455.5{col 67}   22564
{col 26}11mar2020{col 36}27jun2020{col 46}25dec2020{col 56}24jun2021{col 66}11oct2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320210924
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210924.dta", replace
{txt}(note: file IMPE 20210924.dta not found)
file IMPE 20210924.dta saved

{com}. 
. 
. shell rm -r "2021-09-24_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-10-06 20211006
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-10-06_v8.csv.zip 2021-10-06_v8.csv.zip
{txt}
{com}. unzipfile 2021-10-06_v8.csv.zip, replace
{res}{txt}    inflating: 2021-10-06_v8.csv
successfully unzipped 2021-10-06_v8.csv.zip to current directory

{com}. erase 2021-10-06_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-10-06_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 7,981,209 obs)

{com}. 
. keep if country == "$country"
{txt}(7,932,513 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(40,580 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(7,379 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21912{txt},{res}22648{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}29dec2019{txt},{res}03jan2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}737{col 51}{txt}missing .:  {res}0{txt}/{res}737

{txt}{col 19}mean:{res}{col 26}   22280{txt} = {res}31dec2020{txt}
{col 15}std. dev:{res}{col 26} 212.898

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37}   22096{col 47}   22280{col 57}   22464{col 67}   22575
{col 26}11mar2020{col 36}30jun2020{col 46}31dec2020{col 56}03jul2021{col 66}22oct2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320211006
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211006.dta", replace
{txt}(note: file IMPE 20211006.dta not found)
file IMPE 20211006.dta saved

{com}. 
. 
. shell rm -r "2021-10-06_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-10-21 20211021
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-10-21_v8.csv.zip 2021-10-21_v8.csv.zip
{txt}
{com}. unzipfile 2021-10-21_v8.csv.zip, replace
{res}{txt}    inflating: 2021-10-21_v8.csv
successfully unzipped 2021-10-21_v8.csv.zip to current directory

{com}. erase 2021-10-21_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-10-21_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 8,156,208 obs)

{com}. 
. keep if country == "$country"
{txt}(8,106,390 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(41,515 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(7,549 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21910{txt},{res}22663{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}27dec2019{txt},{res}18jan2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}754{col 51}{txt}missing .:  {res}0{txt}/{res}754

{txt}{col 19}mean:{res}{col 26} 22286.5{txt} = {res}06jan2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 217.805

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37}   22098{col 47} 22286.5{col 57}   22475{col 67}   22588
{col 26}11mar2020{col 36}02jul2020{col 46}06jan2021{col 56}14jul2021{col 66}04nov2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320211021
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211021.dta", replace
{txt}(note: file IMPE 20211021.dta not found)
file IMPE 20211021.dta saved

{com}. 
. 
. shell rm -r "2021-10-21_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-10-27 20211027
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-10-27_v8.csv.zip 2021-10-27_v8.csv.zip
{txt}
{com}. unzipfile 2021-10-27_v8.csv.zip, replace
{res}{txt}    inflating: 2021-10-27_v8.csv
successfully unzipped 2021-10-27_v8.csv.zip to current directory

{com}. erase 2021-10-27_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-10-27_v8.csv", clear varnames(1) 
{res}{text}(14 vars, 8,232,174 obs)

{com}. 
. keep if country == "$country"
{txt}(8,181,894 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(41,900 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(7,619 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21909{txt},{res}22669{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}26dec2019{txt},{res}24jan2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}761{col 51}{txt}missing .:  {res}0{txt}/{res}761

{txt}{col 19}mean:{res}{col 26}   22289{txt} = {res}09jan2021{txt}
{col 15}std. dev:{res}{col 26} 219.826

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37}   22099{col 47}   22289{col 57}   22479{col 67}   22593
{col 26}11mar2020{col 36}03jul2020{col 46}09jan2021{col 56}18jul2021{col 66}09nov2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320211027
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211027.dta", replace
{txt}(note: file IMPE 20211027.dta not found)
file IMPE 20211027.dta saved

{com}. 
. 
. shell rm -r "2021-10-27_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. 
. * update 2021-11-03 20211103
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-11-03_v9.csv.zip 2021-11-03_v9.csv.zip
{txt}
{com}. unzipfile 2021-11-03_v9.csv.zip, replace
{res}{txt}    inflating: 2021-11-03_v9.csv
successfully unzipped 2021-11-03_v9.csv.zip to current directory

{com}. erase 2021-11-03_v9.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-11-03_v9.csv", clear varnames(1) 
{res}{text}(14 vars, 8,298,516 obs)

{com}. 
. keep if country == "$country"
{txt}(8,247,774 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(42,285 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(7,689 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21909{txt},{res}22676{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}26dec2019{txt},{res}31jan2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}768{col 51}{txt}missing .:  {res}0{txt}/{res}768

{txt}{col 19}mean:{res}{col 26} 22292.5{txt} = {res}12jan2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 221.847

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21985{col 37} 22100.5{col 47} 22292.5{col 57} 22484.5{col 67}   22600
{col 26}11mar2020{col 36}04jul2020{col 46}12jan2021{col 56}23jul2021{col 66}16nov2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320211103
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211103.dta", replace
{txt}(note: file IMPE 20211103.dta not found)
file IMPE 20211103.dta saved

{com}. 
. 
. shell rm -r "2021-11-03_v9.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-11-15 20211115
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-11-15_v9.csv.zip 2021-11-15_v9.csv.zip
{txt}
{com}. unzipfile 2021-11-15_v9.csv.zip, replace
{res}{txt}    inflating: 2021-11-15_v9.csv
successfully unzipped 2021-11-15_v9.csv.zip to current directory

{com}. erase 2021-11-15_v9.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-11-15_v9.csv", clear varnames(1) 
{res}{text}(14 vars, 8,432,199 obs)

{com}. 
. keep if country == "$country"
{txt}(8,380,665 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(42,945 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(7,809 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21909{txt},{res}22688{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}26dec2019{txt},{res}12feb2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}780{col 51}{txt}missing .:  {res}0{txt}/{res}780

{txt}{col 19}mean:{res}{col 26} 22298.5{txt} = {res}18jan2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 225.311

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 21986.5{col 37} 22103.5{col 47} 22298.5{col 57} 22493.5{col 67} 22610.5
{col 26}12mar2020{col 36}07jul2020{col 46}18jan2021{col 56}01aug2021{col 66}26nov2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320211115
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211115.dta", replace
{txt}(note: file IMPE 20211115.dta not found)
file IMPE 20211115.dta saved

{com}. 
. 
. shell rm -r "2021-11-15_v9.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. * update 2021-11-21 20211121
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}.      
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-11-21_v9.csv.zip 2021-11-21_v9.csv.zip
{txt}
{com}. unzipfile 2021-11-21_v9.csv.zip, replace
{res}{txt}    inflating: 2021-11-21_v9.csv
successfully unzipped 2021-11-21_v9.csv.zip to current directory

{com}. erase 2021-11-21_v9.csv.zip
{txt}
{com}. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-11-21_v9.csv", clear varnames(1) 
{res}{text}(14 vars, 8,537,154 obs)

{com}. 
. keep if country == "$country"
{txt}(8,485,236 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(43,265 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(7,867 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21909{txt},{res}22694{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}26dec2019{txt},{res}18feb2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}786{col 51}{txt}missing .:  {res}0{txt}/{res}786

{txt}{col 19}mean:{res}{col 26} 22301.5{txt} = {res}21jan2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 227.043

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21987{col 37}   22105{col 47} 22301.5{col 57}   22498{col 67}   22616
{col 26}13mar2020{col 36}09jul2020{col 46}21jan2021{col 56}06aug2021{col 66}02dec2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320211121
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211121.dta", replace
{txt}(note: file IMPE 20211121.dta not found)
file IMPE 20211121.dta saved

{com}. 
. 
. shell rm -r "2021-11-21_v9.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. 
. * update 2021-11-29 20211129
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}.      
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-11-29_v9.csv.zip 2021-11-29_v9.csv.zip
{txt}
{com}. unzipfile 2021-11-29_v9.csv.zip, replace
{res}{txt}    inflating: 2021-11-29_v9.csv
successfully unzipped 2021-11-29_v9.csv.zip to current directory

{com}. erase 2021-11-29_v9.csv.zip
{txt}
{com}. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-11-29_v9.csv", clear varnames(1) 
{res}{text}(14 vars, 8,628,762 obs)

{com}. 
. keep if country == "$country"
{txt}(8,576,316 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(43,705 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(7,947 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21909{txt},{res}22702{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}26dec2019{txt},{res}26feb2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}794{col 51}{txt}missing .:  {res}0{txt}/{res}794

{txt}{col 19}mean:{res}{col 26} 22305.5{txt} = {res}25jan2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 229.352

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21988{col 37}   22107{col 47} 22305.5{col 57}   22504{col 67}   22623
{col 26}14mar2020{col 36}11jul2020{col 46}25jan2021{col 56}12aug2021{col 66}09dec2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320211129
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211129.dta", replace
{txt}(note: file IMPE 20211129.dta not found)
file IMPE 20211129.dta saved

{com}. 
. 
. shell rm -r "2021-11-29_v9.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. 
. 
. 
. * update 2021-12-05 20211205
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-12-05_v9.csv.zip 2021-12-05_v9.csv.zip
{txt}
{com}. unzipfile 2021-12-05_v9.csv.zip, replace
{res}{txt}    inflating: 2021-12-05_v9.csv
successfully unzipped 2021-12-05_v9.csv.zip to current directory

{com}. erase 2021-12-05_v9.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-12-05_v9.csv", clear varnames(1) 
{res}{text}(14 vars, 8,659,245 obs)

{com}. 
. keep if country == "$country"
{txt}(8,606,403 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(44,035 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(8,007 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21909{txt},{res}22708{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}26dec2019{txt},{res}04mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}800{col 51}{txt}missing .:  {res}0{txt}/{res}800

{txt}{col 19}mean:{res}{col 26} 22308.5{txt} = {res}28jan2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 231.084

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27} 21988.5{col 37} 22108.5{col 47} 22308.5{col 57} 22508.5{col 67} 22628.5
{col 26}14mar2020{col 36}12jul2020{col 46}28jan2021{col 56}16aug2021{col 66}14dec2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320211205
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211205.dta", replace
{txt}(note: file IMPE 20211205.dta not found)
file IMPE 20211205.dta saved

{com}. 
. 
. shell rm -r "2021-12-05_v9.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. 
. * update 2021-12-13 20211213
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-12-13_v9.csv.zip 2021-12-13_v9.csv.zip
{txt}
{com}. unzipfile 2021-12-13_v9.csv.zip, replace
{res}{txt}    inflating: 2021-12-13_v9.csv
successfully unzipped 2021-12-13_v9.csv.zip to current directory

{com}. erase 2021-12-13_v9.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-12-13_v9.csv", clear varnames(1) 
{res}{text}(14 vars, 8,648,370 obs)

{com}. 
. keep if country == "$country"
{txt}(8,595,000 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(44,475 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(8,087 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21909{txt},{res}22716{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}26dec2019{txt},{res}12mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}808{col 51}{txt}missing .:  {res}0{txt}/{res}808

{txt}{col 19}mean:{res}{col 26} 22312.5{txt} = {res}01feb2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 233.394

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21989{col 37} 22110.5{col 47} 22312.5{col 57} 22514.5{col 67}   22636
{col 26}15mar2020{col 36}14jul2020{col 46}01feb2021{col 56}22aug2021{col 66}22dec2021
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320211213
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211213.dta", replace
{txt}(note: file IMPE 20211213.dta not found)
file IMPE 20211213.dta saved

{com}. 
. 
. shell rm -r "2021-12-13_v9.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. 
. * update 2021-12-26 20211226
. 
. ******************************
. 
. * get csv file
. 
. clear all
{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-12-26_v9.csv.zip 2021-12-26_v9.csv.zip
{txt}
{com}. unzipfile 2021-12-26_v9.csv.zip, replace
{res}{txt}    inflating: 2021-12-26_v9.csv
successfully unzipped 2021-12-26_v9.csv.zip to current directory

{com}. erase 2021-12-26_v9.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-12-26_v9.csv", clear varnames(1) 
{res}{text}(14 vars, 8,842,353 obs)

{com}. 
. keep if country == "$country"
{txt}(8,788,785 observations deleted)

{com}. 
. keep if scenario == "Maintain Status Quo"
{txt}(44,640 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(8,117 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21919{txt},{res}22729{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}05jan2020{txt},{res}25mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}811{col 51}{txt}missing .:  {res}0{txt}/{res}811

{txt}{col 19}mean:{res}{col 26}   22324{txt} = {res}13feb2021{txt}
{col 15}std. dev:{res}{col 26}  234.26

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22000{col 37}   22121{col 47}   22324{col 57}   22527{col 67}   22648
{col 26}26mar2020{col 36}25jul2020{col 46}13feb2021{col 56}04sep2021{col 66}03jan2022
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaA03S02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaA03S02
{txt}
{com}. 
. rename DayDeaMeRaA03S02 DayDeaMeRaA0320211226
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211226.dta", replace
{txt}(note: file IMPE 20211226.dta not found)
file IMPE 20211226.dta saved

{com}. 
. 
. shell rm -r "2021-12-26_v9.csv" 
{txt}

{com}. 
. ******
. 
. *
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *
. 
. view "log CovidLongitudinal IMPE 1b.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/Iran/code/IMPE/log CovidLongitudinal IMPE 1b.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 May 2022, 20:38:58
{txt}{.-}
{smcl}
{txt}{sf}{ul off}