{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/Iran/code/JOHN/log CovidLongitudinal JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 May 2022, 12:54:00
{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidLongitudinal JOHN.do"
. 
. * Project: Longitudinal assessment of COVID-19 models                                                                         
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. ***************************************************************************
. 
. 
. 
. * get Johns Hopkins data for deaths
. * input data files: csv files on web site "time_series_covid19_deaths_global.csv"
. * output data files: "CovidLongitudinal JOHN.dta"
. 
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(2:2)
{res}{text}(1 var, 285 obs)

{com}. 
. save "time_series_covid19_deaths_global col 2.dta", replace
{txt}file time_series_covid19_deaths_global col 2.dta saved

{com}. 
. 
. import delimited ///
> "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv" ///
> , clear varnames(1) colrange(5)
{res}{text}(846 vars, 285 obs)

{com}. 
. 
. save "time_series_covid19_deaths_global col 5 on.dta", replace
{txt}file time_series_covid19_deaths_global col 5 on.dta saved

{com}. 
. 
. use "time_series_covid19_deaths_global col 2.dta", clear 
{txt}
{com}. 
. merge 1:1 _n using "time_series_covid19_deaths_global col 5 on.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             285{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. rename countryregion loc_grand_name
{res}{txt}
{com}. 
. label var loc_grand_name "location grand name"
{txt}
{com}. 
. keep if regexm(loc_grand_name,"$country") == 1
{txt}(284 observations deleted)

{com}. 
. order loc_grand_name, last
{txt}
{com}. 
. gen counter = _n
{txt}
{com}. 
. reshape long v, i(counter) 
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845 846)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}     846
{txt}Number of variables            {res}     849   {txt}->{res}       5
{txt}j variable (846 values)                   ->   {res}_j
{txt}xij variables:
                         {res}v1 v2 ... v846   {txt}->   {res}v
{txt}{hline 77}

{com}. 
. drop counter 
{txt}
{com}. 
. codebook _j

{txt}{hline}
{res}_j{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}int{txt})

{col 18}range:  [{res}1{txt},{res}846{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}846{col 51}{txt}missing .:  {res}0{txt}/{res}846

{txt}{col 19}mean:{res}{col 26}   423.5
{txt}{col 15}std. dev:{res}{col 26} 244.363

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      85{col 37}     212{col 47}   423.5{col 57}     635{col 67}     762
{txt}
{com}. 
. 
. 
. gen date = date("22 Jan 2020", "DMY")
{txt}
{com}. 
. replace date = date + _j - 1
{txt}(845 real changes made)

{com}. 
. format date %td
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22781{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}16may2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}846{col 51}{txt}missing .:  {res}0{txt}/{res}846

{txt}{col 19}mean:{res}{col 26} 22358.5{txt} = {res}19mar2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 244.363

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22020{col 37}   22147{col 47} 22358.5{col 57}   22570{col 67}   22697
{col 26}15apr2020{col 36}20aug2020{col 46}19mar2021{col 56}17oct2021{col 66}21feb2022
{txt}
{com}. 
. order date 
{txt}
{com}. 
. rename v TotDeaMeRaA00S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA00S00 "Total Deaths JOHN"
{txt}
{com}. 
. destring TotDeaMeRaA00S00, replace
{txt}TotDeaMeRaA00S00: all characters numeric; {res}replaced {txt}as {res}long
{txt}
{com}. 
. list TotDeaMeRaA00S00 if date == td(19feb2020) 
{txt}
     {c TLC}{hline 10}{c TRC}
     {c |} {res}TotDe~00 {txt}{c |}
     {c LT}{hline 10}{c RT}
 29. {c |} {res}       2 {txt}{c |}
     {c BLC}{hline 10}{c BRC}

{com}. 
. gen DayDeaMeRaA00S00 =  TotDeaMeRaA00S00[_n] - TotDeaMeRaA00S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. label var DayDeaMeRaA00S00 "Daily Deaths JOHN"
{txt}
{com}. 
. replace DayDeaMeRaA00S00 = TotDeaMeRaA00S00 if _j == 1
{txt}(1 real change made)

{com}. 
. replace TotDeaMeRaA00S00 = . if date < td(19feb2020)
{txt}(28 real changes made, 28 to missing)

{com}. 
. replace DayDeaMeRaA00S00 = . if date < td(19feb2020)
{txt}(28 real changes made, 28 to missing)

{com}. 
. drop _j _merge
{txt}
{com}. 
. 
. 
. order date loc_grand_name DayDeaMeRaA00S00 TotDeaMeRaA00S00 
{txt}
{com}.                                         
. 
. sort date
{txt}
{com}. 
. isid date
{txt}
{com}. 
. 
. save "country JOHN deaths.dta", replace
{txt}file country JOHN deaths.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ****** add obs 01 Jan 2020 to 21 Jan 2020 for better graphing
. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22781{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}16may2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}846{col 51}{txt}missing .:  {res}0{txt}/{res}846

{txt}{col 19}mean:{res}{col 26} 22358.5{txt} = {res}19mar2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 244.363

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22020{col 37}   22147{col 47} 22358.5{col 57}   22570{col 67}   22697
{col 26}15apr2020{col 36}20aug2020{col 46}19mar2021{col 56}17oct2021{col 66}21feb2022
{txt}
{com}. 
. expand 22 in 1
{txt}(21 observations created)

{com}. 
. sort date
{txt}
{com}. 
. rename date date_original 
{res}{txt}
{com}. 
. gen date = .
{txt}(867 missing values generated)

{com}. 
. replace date = td(01Jan2020) in 1
{txt}(1 real change made)

{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(866 real changes made)

{com}. 
. format date %tdDDMonCCYY
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22781{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}16may2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}867{col 51}{txt}missing .:  {res}0{txt}/{res}867

{txt}{col 19}mean:{res}{col 26}   22348{txt} = {res}09mar2021{txt}
{col 15}std. dev:{res}{col 26} 250.426

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22001{col 37}   22131{col 47}   22348{col 57}   22565{col 67}   22695
{col 26}27mar2020{col 36}04aug2020{col 46}09mar2021{col 56}12oct2021{col 66}19feb2022
{txt}
{com}. 
. drop date_original
{txt}
{com}. 
. order date
{txt}
{com}. 
. isid date
{txt}
{com}. 
. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22781{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}16may2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}867{col 51}{txt}missing .:  {res}0{txt}/{res}867

{txt}{col 19}mean:{res}{col 26}   22348{txt} = {res}09mar2021{txt}
{col 15}std. dev:{res}{col 26} 250.426

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22001{col 37}   22131{col 47}   22348{col 57}   22565{col 67}   22695
{col 26}27mar2020{col 36}04aug2020{col 46}09mar2021{col 56}12oct2021{col 66}19feb2022
{txt}
{com}. 
. 
. 
. 
. * smooth 
. 
. tsset date, daily   
{res}{txt}{col 9}time variable:  {res}{col 25}date, 01Jan2020 to 16May2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. tssmooth ma DayDeaMeRaA00S00_window = DayDeaMeRaA00S00 if DayDeaMeRaA00S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaMeRaA00S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaMeSmA00S00 = DayDeaMeRaA00S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaMeRaA00S00_window
{txt}
{smcl}
{com}. 
. label var DayDeaMeSmA00S00 "Daily deaths smooth A00 JOHN"
{txt}
{com}. 
. drop DayDeaMeRaA00S00_window
{txt}
{com}. 
. tsset, clear
{txt}
{com}. 
. 
. 
. 
. * omit smoothed values that appear before the date that the raw values start 
. replace DayDeaMeSmA00S00 = . if DayDeaMeRaA00S00 == .
{txt}(6 real changes made, 6 to missing)

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ***************************
. 
. /*
> Smoothed daily deaths and daily cases with very small values 
> lead to unduly inflated Percent Error and Absolute Percent Error. 
> To remedy this problem, smoothed daily deaths and daily cases with 
> values > 0 and < 0.05 are replace with 0.05.
> Similarly, non-missing smoothed daily deaths and daily cases with values of zero
> are replaced with 0.01.
> */
. 
. replace DayDeaMeSmA00S00 = 0.05 if DayDeaMeSmA00S00 > 0 & DayDeaMeSmA00S00 < 0.05
{txt}(0 real changes made)

{com}. 
. replace DayDeaMeSmA00S00 = 0.01 if DayDeaMeSmA00S00 == 0
{txt}(0 real changes made)

{com}. 
. 
. 
. 
. 
. 
. drop if date > td(01Jan2022)
{txt}(135 observations deleted)

{com}. 
. 
. 
. qui compress
{txt}
{com}. 
. sort date loc_grand_name
{txt}
{com}. 
. 
. save "CovidLongitudinal JOHN.dta", replace
{txt}file CovidLongitudinal JOHN.dta saved

{com}. 
. isid date
{txt}
{com}. 
. 
. * graphs
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(gray*.5)) /// 
> (line DayDeaMeSmA00S00 date, sort lwidth(thick) lcolor(cyan)) /// 
> if date >= td(01jan2020) & date <= td(01mar2022) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily deaths) title("C19 daily deaths, $country, National, JOHN, 2020 on", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN raw" 2 "JOHN smooth") rows(1) size(small))  
{res}{txt}
{com}. 
. qui graph export "graph 1 C19 daily deaths, $country, JOHN, 2020 on.pdf", replace
{txt}
{com}. 
. 
. 
. 
. view "log CovidLongitudinal JOHN.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/Iran/code/JOHN/log CovidLongitudinal JOHN.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 May 2022, 12:54:09
{txt}{.-}
{smcl}
{txt}{sf}{ul off}