{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE/log CovidLongitudinal IMPE 2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}28 Aug 2023, 07:50:38
{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidLongitudinal IMPE 2.do"
. 
. * Project: Longitudinal assessment of COVID-19 models                                                                         
. 
. * Objective: Download estimates files for IMPE model, part 2 of 3                                                                   
. ***************************************************************************
. 
. 
. * download estimates files - part 2 of 3 - 2021 (from 2020, 2021, 2022)
. * input data files: csv files on web site
. * output data files: "IMPE `update'.dta" 
. 
. 
. 
. 
. 
. /*
> 
> * IMPE updates all 
> 
> 
> copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/202?-??-??_v?.csv.zip 202?-??-??_v?.csv.zip
> 
> 
> 2020-04-28_v1.csv.zip
> 2020-04-29_v1.csv.zip
> 2020-04-30_v1.csv.zip
> 2020-05-01_v1.csv.zip
> 2020-05-02_v1.csv.zip
> 2020-05-03_v1.csv.zip
> 2020-05-04_v1.csv.zip
> 2020-05-05_v1.csv.zip
> 2020-05-06_v1.csv.zip
> 2020-05-07_v1.csv.zip
> 2020-05-08_v1.csv.zip
> 2020-05-09_v1.csv.zip
> 2020-05-10_v1.csv.zip
> 2020-05-11_v1.csv.zip
> 2020-05-12_v1.csv.zip
> 2020-05-13_v1.csv.zip
> 2020-05-14_v1.csv.zip
> 2020-05-15_v1.csv.zip
> 2020-05-16_v1.csv.zip
> 2020-05-17_v1.csv.zip
> 2020-05-19_v1.csv.zip
> 2020-05-20_v1.csv.zip
> 2020-05-21_v1.csv.zip
> 2020-05-22_v1.csv.zip
> 2020-05-23_v1.csv.zip
> 2020-05-24_v1.csv.zip
> 2020-05-25_v1.csv.zip
> 2020-05-26_v1.csv.zip
> 2020-05-27_v1.csv.zip
> 2020-05-28_v1.csv.zip
> 2020-05-29_v1.csv.zip
> 2020-05-30_v1.csv.zip
> 2020-05-31_v2.csv.zip
> 2020-06-01_v2.csv.zip
> 2020-06-02_v2.csv.zip
> 2020-06-03_v2.csv.zip
> 2020-06-04_v2.csv.zip
> 2020-06-06_v2.csv.zip
> 2020-06-09_v2.csv.zip
> 2020-06-14_v4.csv.zip
> 2020-06-16_v4.csv.zip
> 2020-06-19_v4.csv.zip
> 2020-06-21_v4.csv.zip
> 2020-06-23_v4.csv.zip
> 2020-06-26_v4.csv.zip
> 2020-06-28_v4.csv.zip
> 2020-07-02_v4.csv.zip
> 2020-07-03_v4.csv.zip
> 2020-07-04_v4.csv.zip
> 2020-07-07_v4.csv.zip
> 2020-07-11_v4.csv.zip
> 2020-07-14_v4.csv.zip
> 2020-07-15_v4.csv.zip
> 2020-07-18_v4.csv.zip
> 2020-07-20_v4.csv.zip
> 2020-07-22_v4.csv.zip
> 2020-07-25_v4.csv.zip
> 2020-07-27_v4.csv.zip
> 2020-07-31_v4.csv.zip
> 2020-08-08_v5.csv.zip
> 2020-08-10_v5.csv.zip
> 2020-08-11_v5.csv.zip
> 2020-08-13_v5.csv.zip
> 2020-08-14_v5.csv.zip
> 2020-08-17_v5.csv.zip
> 2020-08-23_v5.csv.zip
> 2020-08-25_v5.csv.zip
> 2020-08-27_v5.csv.zip
> 2020-08-31_v5.csv.zip
> 2020-09-02_v5.csv.zip
> 2020-09-06_v5.csv.zip
> 2020-09-08_v5.csv.zip
> 2020-09-12_v5.csv.zip
> 2020-09-15_v5.csv.zip
> 2020-09-19_v5.csv.zip
> 2020-09-23_v5.csv.zip
> 2020-09-25_v5.csv.zip
> 2020-10-03_v5.csv.zip
> 2020-10-06_v5.csv.zip
> 2020-10-12_v5.csv.zip
> 2020-10-19_v5.csv.zip
> 2020-10-25_v5.csv.zip
> 2020-10-28_v5.csv.zip
> 2020-11-01_v5.csv.zip
> 2020-11-10_v6.csv.zip
> 2020-11-14_v6.csv.zip
> 2020-11-18_v6.csv.zip
> 2020-11-23_v6.csv.zip
> 2020-11-29_v6.csv.zip
> 2020-12-04_v6.csv.zip
> 2020-12-12_v6.csv.zip
> 2020-12-20_v6.csv.zip
> 2020-12-26_v6.csv.zip
> 
> 
> 
> 2021-01-04_v6.csv.zip
> 2021-01-10_v6.csv.zip
> 2021-01-12_v6.csv.zip
> 2021-01-18_v7.csv.zip
> 2021-01-24_v7.csv.zip
> 2021-01-30_v7.csv.zip
> 2021-02-03_v7.csv.zip
> 2021-02-10_v7.csv.zip
> 2021-02-17_v7.csv.zip
> 2021-02-26_v7.csv.zip
> 2021-03-05_v7.csv.zip
> 2021-03-12_v7.csv.zip
> 2021-03-19_v7.csv.zip
> 2021-03-29_v7.csv.zip
> 2021-04-06_v7.csv.zip
> 2021-04-17_v7.csv.zip
> 2021-04-24_v7.csv.zip
> 2021-05-10_v8.csv.zip
> 2021-05-16_v8.csv.zip
> 2021-05-22_v8.csv.zip
> 2021-05-27_v8.csv.zip
> 2021-06-04_v8.csv.zip
> 2021-06-11_v8.csv.zip
> 2021-06-18_v8.csv.zip
> 2021-06-26_v8.csv.zip
> 2021-07-02_v8.csv.zip
> 2021-07-09_v8.csv.zip
> 2021-07-19_v8.csv.zip
> 2021-08-06_v8.csv.zip
> 2021-08-19_v8.csv.zip
> 2021-08-25_v8.csv.zip
> 2021-09-09_v8.csv.zip
> 2021-09-24_v8.csv.zip
> 2021-10-06_v8.csv.zip
> 2021-10-21_v8.csv.zip
> 2021-10-27_v8.csv.zip
> 2021-11-03_v9.csv.zip
> 2021-11-15_v9.csv.zip
> 2021-11-21_v9.csv.zip
> 2021-11-29_v9.csv.zip
> 2021-12-05_v9.csv.zip
> 2021-12-13_v9.csv.zip
> 2021-12-26_v9.csv.zip
> 
> 
> 2022-01-02_v9.csv.zip
> 2022-01-20_v9.csv.zip
> 2022-01-31_v9.csv.zip
> 2022-03-15_v9.csv.zip
> 2022-05-30_v9.csv.zip
> 
> 
> 
> https://github.com/mrc-ide/global-lmic-reports/tree/master/data
> 
> 
> 2022-06-20_v9.csv.zip
> 2022-07-03_v9.csv.zip
> 2022-07-12_v9.csv.zip
> 2022-07-28_v9.csv.zip
> 2022-08-08_v9.csv.zip
> 2022-09-01_v10.csv.zip
> 2022-12-25_v10.csv.zip
> 
> */
. 
. 
. 
. 
. 
. 
. 
. * update 2021-01-04 20210104
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-01-04_v6.csv.zip 2021-01-04_v6.csv.zip
{txt}
{com}. unzipfile 2021-01-04_v6.csv.zip, replace
{res}{text:    inflating: 2021-01-04_v6.csv}

{text:successfully unzipped 2021-01-04_v6.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-01-04_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-01-04_v6.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 4,681,842 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(3,901,513 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(709,390 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21885{txt},{res}22373{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}02dec2019{txt},{res}03apr2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}489{col 51}{txt}Missing .: {res}0{txt}/{res}70,939

{txt}{col 19}Mean: {res}{ralign 7:22174.1}{txt} = {res}16sep2020{txt}(+ 2 hours)
{col 14}Std. dev.: {res}{ralign 7:120.802}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22004}{ralign 11:   22072}{ralign 11:   22178}{ralign 11:   22281}{ralign 11:   22337}
{col 25}{ralign 9:30mar2020}{ralign 11:06jun2020}{ralign 11:20sep2020}{ralign 11:01jan2021}{ralign 11:26feb2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(420 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(390 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(409 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(430 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(398 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(452 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(405 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(418 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(180 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(433 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(302 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210104
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210104.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210104.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-01-04_v6.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. 
. * update 2021-01-10 20210110
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-01-10_v6.csv.zip 2021-01-10_v6.csv.zip
{txt}
{com}. unzipfile 2021-01-10_v6.csv.zip, replace
{res}{text:    inflating: 2021-01-10_v6.csv}

{text:successfully unzipped 2021-01-10_v6.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-01-10_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-01-10_v6.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 4,760,406 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(3,967,005 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(721,270 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21885{txt},{res}22379{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}02dec2019{txt},{res}09apr2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}495{col 51}{txt}Missing .: {res}0{txt}/{res}72,131

{txt}{col 19}Mean: {res}{ralign 7:22177.4}{txt} = {res}19sep2020{txt}(+ 9 hours)
{col 14}Std. dev.: {res}{ralign 7:122.435}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22005}{ralign 11:   22074}{ralign 11:   22181}{ralign 11:   22286}{ralign 11:   22342}
{col 25}{ralign 9:31mar2020}{ralign 11:08jun2020}{ralign 11:23sep2020}{ralign 11:06jan2021}{ralign 11:03mar2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(410 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(397 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(416 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(437 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(402 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(459 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(412 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(424 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(187 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(440 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(308 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210110
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210110.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210110.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-01-10_v6.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-01-12 20210112
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-01-12_v6.csv.zip 2021-01-12_v6.csv.zip
{txt}
{com}. unzipfile 2021-01-12_v6.csv.zip, replace
{res}{text:    inflating: 2021-01-12_v6.csv}

{text:successfully unzipped 2021-01-12_v6.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-01-12_v6.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-01-12_v6.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 4,799,847 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(3,999,801 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(727,286 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21884{txt},{res}22381{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}01dec2019{txt},{res}11apr2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}498{col 51}{txt}Missing .: {res}0{txt}/{res}72,760

{txt}{col 19}Mean: {res}{ralign 7:22177.7}{txt} = {res}19sep2020{txt}(+ 16 hours)
{col 14}Std. dev.: {res}{ralign 7:123.387}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22004}{ralign 11:   22073}{ralign 11: 22181.5}{ralign 11:   22287}{ralign 11:   22344}
{col 25}{ralign 9:30mar2020}{ralign 11:07jun2020}{ralign 11:23sep2020}{ralign 11:07jan2021}{ralign 11:05mar2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(415 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(401 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(420 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(426 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(406 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(464 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(414 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(425 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(209 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(444 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(311 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210112
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210112.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210112.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-01-12_v6.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-01-18 20210118
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-01-18_v7.csv.zip 2021-01-18_v7.csv.zip
{txt}
{com}. unzipfile 2021-01-18_v7.csv.zip, replace
{res}{text:    inflating: 2021-01-18_v7.csv}

{text:successfully unzipped 2021-01-18_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-01-18_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-01-18_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 4,868,028 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,056,701 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(737,570 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21882{txt},{res}22387{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}29nov2019{txt},{res}17apr2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}506{col 51}{txt}Missing .: {res}0{txt}/{res}73,757

{txt}{col 19}Mean: {res}{ralign 7:22181.1}{txt} = {res}23sep2020{txt}(+ 1 hour)
{col 14}Std. dev.: {res}{ralign 7:124.947}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22005}{ralign 11:   22075}{ralign 11:   22185}{ralign 11:   22291}{ralign 11:   22349}
{col 25}{ralign 9:31mar2020}{ralign 11:09jun2020}{ralign 11:27sep2020}{ralign 11:11jan2021}{ralign 11:10mar2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(420 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(407 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(425 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(432 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(412 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(470 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(420 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(427 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(214 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(146 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(453 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(316 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210118
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210118.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210118.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-01-18_v7.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-01-18 20210118
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-01-18_v7.csv.zip 2021-01-18_v7.csv.zip
{txt}
{com}. unzipfile 2021-01-18_v7.csv.zip, replace
{res}{text:    inflating: 2021-01-18_v7.csv}

{text:successfully unzipped 2021-01-18_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-01-18_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-01-18_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 4,868,028 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,056,701 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(737,570 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21882{txt},{res}22387{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}29nov2019{txt},{res}17apr2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}506{col 51}{txt}Missing .: {res}0{txt}/{res}73,757

{txt}{col 19}Mean: {res}{ralign 7:22181.1}{txt} = {res}23sep2020{txt}(+ 1 hour)
{col 14}Std. dev.: {res}{ralign 7:124.947}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22005}{ralign 11:   22075}{ralign 11:   22185}{ralign 11:   22291}{ralign 11:   22349}
{col 25}{ralign 9:31mar2020}{ralign 11:09jun2020}{ralign 11:27sep2020}{ralign 11:11jan2021}{ralign 11:10mar2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(420 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(407 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(425 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(432 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(412 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(470 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(420 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(427 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(214 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(146 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(453 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(316 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210118
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210118.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210118.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-01-18_v7.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-01-24 20210124
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-01-24_v7.csv.zip 2021-01-24_v7.csv.zip
{txt}
{com}. unzipfile 2021-01-24_v7.csv.zip, replace
{res}{text:    inflating: 2021-01-24_v7.csv}

{text:successfully unzipped 2021-01-24_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-01-24_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-01-24_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 4,945,002 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,120,835 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(749,214 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21882{txt},{res}22393{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}29nov2019{txt},{res}23apr2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}512{col 51}{txt}Missing .: {res}0{txt}/{res}74,953

{txt}{col 19}Mean: {res}{ralign 7:22183.8}{txt} = {res}25sep2020{txt}(+ 18 hours)
{col 14}Std. dev.: {res}{ralign 7:126.868}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22005}{ralign 11:   22076}{ralign 11:   22188}{ralign 11:   22296}{ralign 11:   22355}
{col 25}{ralign 9:31mar2020}{ralign 11:10jun2020}{ralign 11:30sep2020}{ralign 11:16jan2021}{ralign 11:16mar2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(427 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(416 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(433 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(439 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(416 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(477 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(427 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(432 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(221 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(155 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(460 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(323 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210124
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210124.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210124.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-01-24_v7.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-01-30 20210130
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-01-30_v7.csv.zip 2021-01-30_v7.csv.zip
{txt}
{com}. unzipfile 2021-01-30_v7.csv.zip, replace
{res}{text:    inflating: 2021-01-30_v7.csv}

{text:successfully unzipped 2021-01-30_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-01-30_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-01-30_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 4,988,982 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,157,540 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(755,854 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21881{txt},{res}22399{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}28nov2019{txt},{res}29apr2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}519{col 51}{txt}Missing .: {res}0{txt}/{res}75,588

{txt}{col 19}Mean: {res}{ralign 7:22187.5}{txt} = {res}29sep2020{txt}(+ 13 hours)
{col 14}Std. dev.: {res}{ralign 7:128.405}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22007}{ralign 11:   22079}{ralign 11:   22192}{ralign 11:   22301}{ralign 11:   22360}
{col 25}{ralign 9:02apr2020}{ralign 11:13jun2020}{ralign 11:04oct2020}{ralign 11:21jan2021}{ralign 11:21mar2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(430 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(421 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(438 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(445 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(424 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(485 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(429 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(439 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(225 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(160 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(465 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(328 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210130
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210130.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210130.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-01-30_v7.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-02-03 20210203
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-02-03_v7.csv.zip 2021-02-03_v7.csv.zip
{txt}
{com}. unzipfile 2021-02-03_v7.csv.zip, replace
{res}{text:    inflating: 2021-02-03_v7.csv}

{text:successfully unzipped 2021-02-03_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-02-03_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-02-03_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 5,019,957 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,183,259 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(760,606 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21881{txt},{res}22403{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}28nov2019{txt},{res}03may2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}523{col 51}{txt}Missing .: {res}0{txt}/{res}76,092

{txt}{col 19}Mean: {res}{ralign 7:22189}{txt} = {res}01oct2020{txt}(+ 0 hours)
{col 14}Std. dev.: {res}{ralign 7:129.892}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22006}{ralign 11:   22079}{ralign 11:   22193}{ralign 11:   22304}{ralign 11:   22364}
{col 25}{ralign 9:01apr2020}{ralign 11:13jun2020}{ralign 11:05oct2020}{ralign 11:24jan2021}{ralign 11:25mar2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(436 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(425 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(445 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(451 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(429 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(489 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(437 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(444 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(231 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(165 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(470 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(333 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210203
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210203.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210203.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-02-03_v7.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-02-10 20210210
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-02-10_v7.csv.zip 2021-02-10_v7.csv.zip
{txt}
{com}. unzipfile 2021-02-10_v7.csv.zip, replace
{res}{text:    inflating: 2021-02-10_v7.csv}

{text:successfully unzipped 2021-02-10_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-02-10_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-02-10_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 5,123,682 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,269,834 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(776,220 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21882{txt},{res}22410{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}29nov2019{txt},{res}10may2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}529{col 51}{txt}Missing .: {res}0{txt}/{res}77,628

{txt}{col 19}Mean: {res}{ralign 7:22192.9}{txt} = {res}04oct2020{txt}(+ 22 hours)
{col 14}Std. dev.: {res}{ralign 7:131.685}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22007}{ralign 11:   22081}{ralign 11:   22197}{ralign 11:   22309}{ralign 11:   22370}
{col 25}{ralign 9:02apr2020}{ralign 11:15jun2020}{ralign 11:09oct2020}{ralign 11:29jan2021}{ralign 11:31mar2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(443 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(430 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(450 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(458 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(435 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(496 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(444 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(450 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(237 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(171 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(475 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(339 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210210
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210210.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210210.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-02-10_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. 
. * update 2021-02-17 20210217
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-02-17_v7.csv.zip 2021-02-17_v7.csv.zip
{txt}
{com}. unzipfile 2021-02-17_v7.csv.zip, replace
{res}{text:    inflating: 2021-02-17_v7.csv}

{text:successfully unzipped 2021-02-17_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-02-17_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-02-17_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 5,207,793 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,339,844 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(789,032 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21882{txt},{res}22417{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}29nov2019{txt},{res}17may2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}536{col 51}{txt}Missing .: {res}0{txt}/{res}78,917

{txt}{col 19}Mean: {res}{ralign 7:22196.4}{txt} = {res}08oct2020{txt}(+ 9 hours)
{col 14}Std. dev.: {res}{ralign 7:133.751}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22008}{ralign 11:   22083}{ralign 11:   22201}{ralign 11:   22314}{ralign 11:   22377}
{col 25}{ralign 9:03apr2020}{ralign 11:17jun2020}{ralign 11:13oct2020}{ralign 11:03feb2021}{ralign 11:07apr2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(451 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(438 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(458 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(468 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(442 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(503 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(453 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(456 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(244 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(178 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(481 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(346 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210217
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210217.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210217.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-02-17_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. 
. 
. 
. * update 2021-02-26 20210226
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-02-26_v7.csv.zip 2021-02-26_v7.csv.zip
{txt}
{com}. unzipfile 2021-02-26_v7.csv.zip, replace
{res}{text:    inflating: 2021-02-26_v7.csv}

{text:successfully unzipped 2021-02-26_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-02-26_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-02-26_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 5,308,482 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,423,757 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(804,292 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21882{txt},{res}22426{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}29nov2019{txt},{res}26may2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}545{col 51}{txt}Missing .: {res}0{txt}/{res}80,433

{txt}{col 19}Mean: {res}{ralign 7:22201.2}{txt} = {res}13oct2020{txt}(+ 5 hours)
{col 14}Std. dev.: {res}{ralign 7:136.169}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22009}{ralign 11:   22086}{ralign 11:   22206}{ralign 11:   22321}{ralign 11:   22385}
{col 25}{ralign 9:04apr2020}{ralign 11:20jun2020}{ralign 11:18oct2020}{ralign 11:10feb2021}{ralign 11:15apr2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(459 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(447 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(468 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(476 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(451 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(511 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(461 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(465 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(253 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(187 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(489 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(355 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210226
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210226.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210226.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-02-26_v7.csv" 
{txt}

{com}. 
. ******
. 
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-03-05 20210305
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-03-05_v7.csv.zip 2021-03-05_v7.csv.zip
{txt}
{com}. unzipfile 2021-03-05_v7.csv.zip, replace
{res}{text:    inflating: 2021-03-05_v7.csv}

{text:successfully unzipped 2021-03-05_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-03-05_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-03-05_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 5,398,599 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,498,926 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(817,856 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21881{txt},{res}22433{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}28nov2019{txt},{res}02jun2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}553{col 51}{txt}Missing .: {res}0{txt}/{res}81,817

{txt}{col 19}Mean: {res}{ralign 7:22204.3}{txt} = {res}16oct2020{txt}(+ 8 hours)
{col 14}Std. dev.: {res}{ralign 7:138.399}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22009}{ralign 11:   22087}{ralign 11:   22209}{ralign 11:   22326}{ralign 11:   22391}
{col 25}{ralign 9:04apr2020}{ralign 11:21jun2020}{ralign 11:21oct2020}{ralign 11:15feb2021}{ralign 11:21apr2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(466 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(456 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(476 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(484 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(459 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(520 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(467 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(472 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(261 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(195 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(497 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(363 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210305
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210305.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210305.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-03-05_v7.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-03-12 20210312
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-03-12_v7.csv.zip 2021-03-12_v7.csv.zip
{txt}
{com}. unzipfile 2021-03-12_v7.csv.zip, replace
{res}{text:    inflating: 2021-03-12_v7.csv}

{text:successfully unzipped 2021-03-12_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-03-12_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-03-12_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 5,467,032 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,555,893 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(828,304 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22440{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}09jun2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}558{col 51}{txt}Missing .: {res}0{txt}/{res}82,835

{txt}{col 19}Mean: {res}{ralign 7:22208.1}{txt} = {res}20oct2020{txt}(+ 2 hours)
{col 14}Std. dev.: {res}{ralign 7:140.128}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22011}{ralign 11:   22089}{ralign 11:   22213}{ralign 11:   22331}{ralign 11:   22397}
{col 25}{ralign 9:06apr2020}{ralign 11:23jun2020}{ralign 11:25oct2020}{ralign 11:20feb2021}{ralign 11:27apr2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(473 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(462 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(483 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(493 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(465 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(528 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(474 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(480 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(266 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(201 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(502 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(369 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210312
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210312.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210312.dta{rm}
saved
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. shell rm -r "2021-03-12_v7.csv" 
{txt}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-03-19 20210319
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-03-19_v7.csv.zip 2021-03-19_v7.csv.zip
{txt}
{com}. unzipfile 2021-03-19_v7.csv.zip, replace
{res}{text:    inflating: 2021-03-19_v7.csv}

{text:successfully unzipped 2021-03-19_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-03-19_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-03-19_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 5,547,303 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,622,725 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(840,522 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21882{txt},{res}22447{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}29nov2019{txt},{res}16jun2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}566{col 51}{txt}Missing .: {res}0{txt}/{res}84,056

{txt}{col 19}Mean: {res}{ralign 7:22211.7}{txt} = {res}23oct2020{txt}(+ 16 hours)
{col 14}Std. dev.: {res}{ralign 7:142.103}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22012}{ralign 11:   22091}{ralign 11:   22216}{ralign 11:   22336}{ralign 11:   22404}
{col 25}{ralign 9:07apr2020}{ralign 11:25jun2020}{ralign 11:28oct2020}{ralign 11:25feb2021}{ralign 11:04may2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(481 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(469 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(489 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(501 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(472 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(536 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(482 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(486 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(274 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(208 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(509 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(376 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210319
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210319.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210319.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-03-19_v7.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-03-29 20210329
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-03-29_v7.csv.zip 2021-03-29_v7.csv.zip
{txt}
{com}. unzipfile 2021-03-29_v7.csv.zip, replace
{res}{text:    inflating: 2021-03-29_v7.csv}

{text:successfully unzipped 2021-03-29_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-03-29_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-03-29_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 5,669,154 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,724,317 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(858,922 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22457{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}26jun2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}575{col 51}{txt}Missing .: {res}0{txt}/{res}85,915

{txt}{col 19}Mean: {res}{ralign 7:22216.5}{txt} = {res}28oct2020{txt}(+ 12 hours)
{col 14}Std. dev.: {res}{ralign 7:145.133}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22012}{ralign 11:   22093}{ralign 11:   22221}{ralign 11:   22344}{ralign 11:   22413}
{col 25}{ralign 9:07apr2020}{ralign 11:27jun2020}{ralign 11:02nov2020}{ralign 11:05mar2021}{ralign 11:13may2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(490 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(479 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(500 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(517 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(482 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(546 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(497 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(495 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(284 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(218 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(519 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(386 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210329
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210329.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210329.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-03-29_v7.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-04-06 20210406
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-04-06_v7.csv.zip 2021-04-06_v7.csv.zip
{txt}
{com}. unzipfile 2021-04-06_v7.csv.zip, replace
{res}{text:    inflating: 2021-04-06_v7.csv}

{text:successfully unzipped 2021-04-06_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-04-06_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-04-06_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 5,752,797 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,793,970 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(871,654 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21884{txt},{res}22465{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}01dec2019{txt},{res}04jul2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}582{col 51}{txt}Missing .: {res}0{txt}/{res}87,173

{txt}{col 19}Mean: {res}{ralign 7:22220.6}{txt} = {res}01nov2020{txt}(+ 13 hours)
{col 14}Std. dev.: {res}{ralign 7:147.209}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22013}{ralign 11:   22095}{ralign 11:   22225}{ralign 11:   22349}{ralign 11:   22420}
{col 25}{ralign 9:08apr2020}{ralign 11:29jun2020}{ralign 11:06nov2020}{ralign 11:10mar2021}{ralign 11:20may2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(499 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(487 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(508 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(520 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(490 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(555 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(502 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(503 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(292 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(226 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(0 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(527 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(394 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210406
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210406.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210406.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-04-06_v7.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-04-17 20210417
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-04-17_v7.csv.zip 2021-04-17_v7.csv.zip
{txt}
{com}. unzipfile 2021-04-17_v7.csv.zip, replace
{res}{text:    inflating: 2021-04-17_v7.csv}

{text:successfully unzipped 2021-04-17_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-04-17_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-04-17_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 5,900,553 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,917,133 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(894,018 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21884{txt},{res}22476{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}01dec2019{txt},{res}15jul2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}593{col 51}{txt}Missing .: {res}0{txt}/{res}89,402

{txt}{col 19}Mean: {res}{ralign 7:22226.9}{txt} = {res}07nov2020{txt}(+ 22 hours)
{col 14}Std. dev.: {res}{ralign 7:150.346}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22015}{ralign 11:   22099}{ralign 11:   22232}{ralign 11:   22359}{ralign 11:   22430}
{col 25}{ralign 9:10apr2020}{ralign 11:03jul2020}{ralign 11:13nov2020}{ralign 11:20mar2021}{ralign 11:30may2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(509 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(497 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(519 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(530 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(501 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(567 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(511 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(514 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(303 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(237 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(156 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(537 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(405 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210417
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210417.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210417.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-04-17_v7.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-04-24 20210424
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-04-24_v7.csv.zip 2021-04-24_v7.csv.zip
{txt}
{com}. unzipfile 2021-04-24_v7.csv.zip, replace
{res}{text:    inflating: 2021-04-24_v7.csv}

{text:successfully unzipped 2021-04-24_v7.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-04-24_v7.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-04-24_v7.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 5,987,622 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,989,652 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(907,242 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21884{txt},{res}22483{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}01dec2019{txt},{res}22jul2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}600{col 51}{txt}Missing .: {res}0{txt}/{res}90,728

{txt}{col 19}Mean: {res}{ralign 7:22230.5}{txt} = {res}11nov2020{txt}(+ 13 hours)
{col 14}Std. dev.: {res}{ralign 7:152.345}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22016}{ralign 11:   22101}{ralign 11:   22236}{ralign 11:   22364}{ralign 11:   22436}
{col 25}{ralign 9:11apr2020}{ralign 11:05jul2020}{ralign 11:17nov2020}{ralign 11:25mar2021}{ralign 11:05jun2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(515 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(505 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(528 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(537 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(508 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(574 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(520 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(90 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(520 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(310 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(244 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(163 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(544 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(412 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210424
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210424.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210424.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-04-24_v7.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-05-10 20210510
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-05-10_v8.csv.zip 2021-05-10_v8.csv.zip
{txt}
{com}. unzipfile 2021-05-10_v8.csv.zip, replace
{res}{text:    inflating: 2021-05-10_v8.csv}

{text:successfully unzipped 2021-05-10_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-05-10_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-05-10_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 5,039,826 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(4,199,882 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(746,767 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22499{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}07aug2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}617{col 51}{txt}Missing .: {res}0{txt}/{res}93,177

{txt}{col 19}Mean: {res}{ralign 7:22239.4}{txt} = {res}20nov2020{txt}(+ 9 hours)
{col 14}Std. dev.: {res}{ralign 7:156.809}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22018}{ralign 11:   22106}{ralign 11:   22245}{ralign 11:   22377}{ralign 11:   22451}
{col 25}{ralign 9:13apr2020}{ralign 11:10jul2020}{ralign 11:26nov2020}{ralign 11:07apr2021}{ralign 11:20jun2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(530 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(523 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(544 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(555 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(523 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(589 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(529 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(144 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(534 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(325 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(259 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(178 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(560 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(427 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210510
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210510.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210510.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-05-10_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-05-16 20210516
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-05-16_v8.csv.zip 2021-05-16_v8.csv.zip
{txt}
{com}. unzipfile 2021-05-16_v8.csv.zip, replace
{res}{text:    inflating: 2021-05-16_v8.csv}

{text:successfully unzipped 2021-05-16_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-05-16_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-05-16_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 6,238,974 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(5,199,134 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(945,467 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22505{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}13aug2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}623{col 51}{txt}Missing .: {res}0{txt}/{res}94,373

{txt}{col 19}Mean: {res}{ralign 7:22242.1}{txt} = {res}23nov2020{txt}(+ 3 hours)
{col 14}Std. dev.: {res}{ralign 7:158.708}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22018}{ralign 11:   22107}{ralign 11:   22248}{ralign 11:   22381}{ralign 11:   22457}
{col 25}{ralign 9:13apr2020}{ralign 11:11jul2020}{ralign 11:29nov2020}{ralign 11:11apr2021}{ralign 11:26jun2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(538 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(532 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(552 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(562 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(528 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(589 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(537 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(151 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(541 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(331 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(264 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(183 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(568 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(433 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210516
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210516.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210516.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-05-16_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-05-22 20210522
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-05-22_v8.csv.zip 2021-05-22_v8.csv.zip
{txt}
{com}. unzipfile 2021-05-22_v8.csv.zip, replace
{res}{text:    inflating: 2021-05-22_v8.csv}

{text:successfully unzipped 2021-05-22_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-05-22_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-05-22_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 6,315,303 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(5,262,703 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(957,067 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22511{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}19aug2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}629{col 51}{txt}Missing .: {res}0{txt}/{res}95,533

{txt}{col 19}Mean: {res}{ralign 7:22245}{txt} = {res}26nov2020{txt}(+ 1 hour)
{col 14}Std. dev.: {res}{ralign 7:160.503}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22019}{ralign 11:   22108}{ralign 11:   22250}{ralign 11:   22385}{ralign 11:   22462}
{col 25}{ralign 9:14apr2020}{ralign 11:12jul2020}{ralign 11:01dec2020}{ralign 11:15apr2021}{ralign 11:01jul2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(544 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(536 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(559 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(570 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(535 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(600 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(542 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(157 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(548 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(337 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(271 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(190 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(575 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(439 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210522
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210522.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210522.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-05-22_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-05-27 20210527
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-05-27_v8.csv.zip 2021-05-27_v8.csv.zip
{txt}
{com}. unzipfile 2021-05-27_v8.csv.zip, replace
{res}{text:    inflating: 2021-05-27_v8.csv}

{text:successfully unzipped 2021-05-27_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-05-27_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-05-27_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 6,380,577 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(5,317,153 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(966,907 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22516{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}24aug2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}634{col 51}{txt}Missing .: {res}0{txt}/{res}96,517

{txt}{col 19}Mean: {res}{ralign 7:22247.3}{txt} = {res}28nov2020{txt}(+ 7 hours)
{col 14}Std. dev.: {res}{ralign 7:162.119}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22019}{ralign 11:   22109}{ralign 11:   22253}{ralign 11:   22389}{ralign 11:   22466}
{col 25}{ralign 9:14apr2020}{ralign 11:13jul2020}{ralign 11:04dec2020}{ralign 11:19apr2021}{ralign 11:05jul2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(551 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(542 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(564 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(576 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(540 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(605 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(547 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(162 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(555 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(342 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(276 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(195 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(581 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(444 real changes made)

{com}. 
.  
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210527
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210527.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210527.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-05-27_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-06-04 20210604
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-06-04_v8.csv.zip 2021-06-04_v8.csv.zip
{txt}
{com}. unzipfile 2021-06-04_v8.csv.zip, replace
{res}{text:    inflating: 2021-06-04_v8.csv}

{text:successfully unzipped 2021-06-04_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-06-04_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-06-04_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 6,484,692 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(5,403,998 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(982,607 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22524{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}01sep2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}642{col 51}{txt}Missing .: {res}0{txt}/{res}98,087

{txt}{col 19}Mean: {res}{ralign 7:22251}{txt} = {res}02dec2020{txt}(+ 1 hour)
{col 14}Std. dev.: {res}{ralign 7:164.591}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22019}{ralign 11:   22111}{ralign 11:   22257}{ralign 11:   22395}{ralign 11:   22474}
{col 25}{ralign 9:14apr2020}{ralign 11:15jul2020}{ralign 11:08dec2020}{ralign 11:25apr2021}{ralign 11:13jul2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(559 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(550 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(572 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(585 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(548 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(612 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(556 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(170 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(564 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(350 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(284 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(202 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(590 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(452 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210604
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210604.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210604.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-06-04_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-06-11 20210611
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-06-11_v8.csv.zip 2021-06-11_v8.csv.zip
{txt}
{com}. unzipfile 2021-06-11_v8.csv.zip, replace
{res}{text:    inflating: 2021-06-11_v8.csv}

{text:successfully unzipped 2021-06-11_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-06-11_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-06-11_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 6,573,330 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(5,477,797 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(996,097 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75  y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22531{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}08sep2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}649{col 51}{txt}Missing .: {res}0{txt}/{res}99,436

{txt}{col 19}Mean: {res}{ralign 7:22254.4}{txt} = {res}05dec2020{txt}(+ 9 hours)
{col 14}Std. dev.: {res}{ralign 7:166.726}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22019}{ralign 11:   22112}{ralign 11:   22260}{ralign 11:   22400}{ralign 11:   22480}
{col 25}{ralign 9:14apr2020}{ralign 11:16jul2020}{ralign 11:11dec2020}{ralign 11:30apr2021}{ralign 11:19jul2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(567 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(559 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(579 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(592 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(555 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(618 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(564 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(177 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(571 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(357 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(291 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(210 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(598 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(459 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210618
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210618.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210618.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-06-18_v8.csv" 
{txt}
rm: 2021-06-18_v8.csv: No such file or directory

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-06-18 20210618
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-06-18_v8.csv.zip 2021-06-18_v8.csv.zip
{txt}
{com}. unzipfile 2021-06-18_v8.csv.zip, replace
{res}{text:    inflating: 2021-06-18_v8.csv}

{text:successfully unzipped 2021-06-18_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-06-18_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-06-18_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 6,663,123 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(5,552,498 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,009,817 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22538{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}15sep2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}656{col 51}{txt}Missing .: {res}0{txt}/{res}100,808

{txt}{col 19}Mean: {res}{ralign 7:22257.7}{txt} = {res}08dec2020{txt}(+ 16 hours)
{col 14}Std. dev.: {res}{ralign 7:168.901}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22019}{ralign 11:   22114}{ralign 11:   22263}{ralign 11:   22405}{ralign 11:   22486}
{col 25}{ralign 9:14apr2020}{ralign 11:18jul2020}{ralign 11:14dec2020}{ralign 11:05may2021}{ralign 11:25jul2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(575 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(567 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(586 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(591 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(562 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(627 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(571 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(183 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(579 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(364 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(298 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(217 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(606 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(466 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210618
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210618.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210618.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-06-18_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-06-26 20210626
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-06-26_v8.csv.zip 2021-06-26_v8.csv.zip
{txt}
{com}. unzipfile 2021-06-26_v8.csv.zip, replace
{res}{text:    inflating: 2021-06-26_v8.csv}

{text:successfully unzipped 2021-06-26_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-06-26_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-06-26_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 6,763,377 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(5,636,098 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,024,957 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22546{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}23sep2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}664{col 51}{txt}Missing .: {res}0{txt}/{res}102,322

{txt}{col 19}Mean: {res}{ralign 7:22261.5}{txt} = {res}12dec2020{txt}(+ 13 hours)
{col 14}Std. dev.: {res}{ralign 7:171.309}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22020}{ralign 11:   22116}{ralign 11:   22267}{ralign 11:   22411}{ralign 11:   22493}
{col 25}{ralign 9:15apr2020}{ralign 11:20jul2020}{ralign 11:18dec2020}{ralign 11:11may2021}{ralign 11:01aug2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(584 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(575 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(594 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(602 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(570 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(636 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(580 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(192 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(588 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(372 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(306 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(223 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(615 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(474 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210626
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210626.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210626.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-06-26_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-07-02 20210702
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-07-02_v8.csv.zip 2021-07-02_v8.csv.zip
{txt}
{com}. unzipfile 2021-07-02_v8.csv.zip, replace
{res}{text:    inflating: 2021-07-02_v8.csv}

{text:successfully unzipped 2021-07-02_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-07-02_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-07-02_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 6,838,551 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(5,698,721 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,036,367 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22552{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}29sep2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}670{col 51}{txt}Missing .: {res}0{txt}/{res}103,463

{txt}{col 19}Mean: {res}{ralign 7:22264.4}{txt} = {res}15dec2020{txt}(+ 10 hours)
{col 14}Std. dev.: {res}{ralign 7:173.127}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22020}{ralign 11:   22117}{ralign 11:   22270}{ralign 11:   22415}{ralign 11:   22499}
{col 25}{ralign 9:15apr2020}{ralign 11:21jul2020}{ralign 11:21dec2020}{ralign 11:15may2021}{ralign 11:07aug2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(590 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(582 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(600 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(607 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(576 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(642 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(586 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(198 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(596 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(378 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(312 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(230 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(622 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(480 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210702
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210702.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210702.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-07-02_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-07-09 20210709
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-07-09_v8.csv.zip 2021-07-09_v8.csv.zip
{txt}
{com}. unzipfile 2021-07-09_v8.csv.zip, replace
{res}{text:    inflating: 2021-07-09_v8.csv}

{text:successfully unzipped 2021-07-09_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-07-09_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-07-09_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 6,927,948 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(5,773,290 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,049,847 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22559{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}06oct2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}677{col 51}{txt}Missing .: {res}0{txt}/{res}104,811

{txt}{col 19}Mean: {res}{ralign 7:22267.7}{txt} = {res}18dec2020{txt}(+ 17 hours)
{col 14}Std. dev.: {res}{ralign 7:175.298}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22020}{ralign 11:   22119}{ralign 11:   22273}{ralign 11:   22420}{ralign 11:   22505}
{col 25}{ralign 9:15apr2020}{ralign 11:23jul2020}{ralign 11:24dec2020}{ralign 11:20may2021}{ralign 11:13aug2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(598 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(590 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(607 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(618 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(583 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(649 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(594 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(205 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(604 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(385 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(319 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(238 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(630 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(487 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210709
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210709.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210709.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-07-09_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-07-19 20210719
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-07-19_v8.csv.zip 2021-07-19_v8.csv.zip
{txt}
{com}. unzipfile 2021-07-19_v8.csv.zip, replace
{res}{text:    inflating: 2021-07-19_v8.csv}

{text:successfully unzipped 2021-07-19_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-07-19_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-07-19_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 7,053,348 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(5,877,812 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,068,827 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22569{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}16oct2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}687{col 51}{txt}Missing .: {res}0{txt}/{res}106,709

{txt}{col 19}Mean: {res}{ralign 7:22272.6}{txt} = {res}23dec2020{txt}(+ 13 hours)
{col 14}Std. dev.: {res}{ralign 7:178.272}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22021}{ralign 11:   22121}{ralign 11:   22278}{ralign 11:   22428}{ralign 11:   22514}
{col 25}{ralign 9:16apr2020}{ralign 11:25jul2020}{ralign 11:29dec2020}{ralign 11:28may2021}{ralign 11:22aug2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(609 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(601 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(617 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(630 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(593 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(658 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(605 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(215 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(615 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(395 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(329 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(248 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(640 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(497 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210719
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210719.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210719.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-07-19_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-08-06 20210806
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-08-06_v8.csv.zip 2021-08-06_v8.csv.zip
{txt}
{com}. unzipfile 2021-08-06_v8.csv.zip, replace
{res}{text:    inflating: 2021-08-06_v8.csv}

{text:successfully unzipped 2021-08-06_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-08-06_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-08-06_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 7,271,544 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(6,059,521 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,101,997 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22587{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}03nov2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}705{col 51}{txt}Missing .: {res}0{txt}/{res}110,026

{txt}{col 19}Mean: {res}{ralign 7:22281.5}{txt} = {res}01jan2021{txt}(+ 13 hours)
{col 14}Std. dev.: {res}{ralign 7:183.497}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22023}{ralign 11:   22125}{ralign 11:   22287}{ralign 11:   22441}{ralign 11:   22530}
{col 25}{ralign 9:18apr2020}{ralign 11:29jul2020}{ralign 11:07jan2021}{ralign 11:10jun2021}{ralign 11:07sep2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(628 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(620 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(635 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(644 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(611 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(677 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(624 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(233 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(633 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(413 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(347 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(266 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(659 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(515 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210806
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210806.dta", replace
{txt}{p 0 4 2}
file {bf}
IMPE 20210806.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-08-06_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-08-19 20210819
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-08-19_v8.csv.zip 2021-08-19_v8.csv.zip
{txt}
{com}. unzipfile 2021-08-19_v8.csv.zip, replace
{res}{text:    inflating: 2021-08-19_v8.csv}

{text:successfully unzipped 2021-08-19_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-08-19_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-08-19_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 7,432,683 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(6,193,908 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,126,317 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22600{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}16nov2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}718{col 51}{txt}Missing .: {res}0{txt}/{res}112,458

{txt}{col 19}Mean: {res}{ralign 7:22287.9}{txt} = {res}07jan2021{txt}(+ 22 hours)
{col 14}Std. dev.: {res}{ralign 7:187.34}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22024}{ralign 11:   22129}{ralign 11:   22294}{ralign 11:   22451}{ralign 11:   22542}
{col 25}{ralign 9:19apr2020}{ralign 11:02aug2020}{ralign 11:14jan2021}{ralign 11:20jun2021}{ralign 11:19sep2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(643 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(634 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(648 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(659 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(624 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(690 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(637 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(246 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(645 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(426 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(360 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(279 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(673 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(528 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210819
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210819.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20210819.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20210819.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-08-19_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-08-25 20210825
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-08-25_v8.csv.zip 2021-08-25_v8.csv.zip
{txt}
{com}. unzipfile 2021-08-25_v8.csv.zip, replace
{res}{text:    inflating: 2021-08-25_v8.csv}

{text:successfully unzipped 2021-08-25_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-08-25_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-08-25_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 7,507,791 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(6,256,553 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,137,647 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22606{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}22nov2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}724{col 51}{txt}Missing .: {res}0{txt}/{res}113,591

{txt}{col 19}Mean: {res}{ralign 7:22290.8}{txt} = {res}10jan2021{txt}(+ 18 hours)
{col 14}Std. dev.: {res}{ralign 7:189.155}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22024}{ralign 11:   22130}{ralign 11:   22297}{ralign 11:   22455}{ralign 11:   22548}
{col 25}{ralign 9:19apr2020}{ralign 11:03aug2020}{ralign 11:17jan2021}{ralign 11:24jun2021}{ralign 11:25sep2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(649 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(640 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(654 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(663 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(630 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(696 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(644 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(252 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(655 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(432 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(366 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(285 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(680 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(534 real changes made)

{com}. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210825
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210825.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20210825.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20210825.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-08-25_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-09-09 20210909
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-09-09_v8.csv.zip 2021-09-09_v8.csv.zip
{txt}
{com}. unzipfile 2021-09-09_v8.csv.zip, replace
{res}{text:    inflating: 2021-09-09_v8.csv}

{text:successfully unzipped 2021-09-09_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-09-09_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-09-09_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 7,684,638 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(6,403,887 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,164,477 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22621{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}07dec2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}739{col 51}{txt}Missing .: {res}0{txt}/{res}116,274

{txt}{col 19}Mean: {res}{ralign 7:22298.5}{txt} = {res}18jan2021{txt}(+ 12 hours)
{col 14}Std. dev.: {res}{ralign 7:193.359}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22026}{ralign 11:   22134}{ralign 11:   22304}{ralign 11:   22466}{ralign 11:   22561}
{col 25}{ralign 9:21apr2020}{ralign 11:07aug2020}{ralign 11:24jan2021}{ralign 11:05jul2021}{ralign 11:08oct2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(665 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(655 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(669 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(678 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(645 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(711 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(659 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(267 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(670 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(447 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(381 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(300 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(694 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(549 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210909
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210909.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20210909.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20210909.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-09-09_v8.csv" 
{txt}

{com}. 
. ******
. 
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-09-24 20210924
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-09-24_v8.csv.zip 2021-09-24_v8.csv.zip
{txt}
{com}. unzipfile 2021-09-24_v8.csv.zip, replace
{res}{text:    inflating: 2021-09-24_v8.csv}

{text:successfully unzipped 2021-09-24_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-09-24_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-09-24_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 7,863,201 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(6,552,684 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,191,537 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22636{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}22dec2021{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}754{col 51}{txt}Missing .: {res}0{txt}/{res}118,980

{txt}{col 19}Mean: {res}{ralign 7:22306.1}{txt} = {res}26jan2021{txt}(+ 3 hours)
{col 14}Std. dev.: {res}{ralign 7:197.614}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22028}{ralign 11:   22138}{ralign 11:   22312}{ralign 11:   22478}{ralign 11:   22575}
{col 25}{ralign 9:23apr2020}{ralign 11:11aug2020}{ralign 11:01feb2021}{ralign 11:17jul2021}{ralign 11:22oct2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(680 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(670 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(684 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(693 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(660 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(726 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(674 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(282 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(687 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(462 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(396 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(315 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(710 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(564 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20210924
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20210924.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20210924.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20210924.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-09-24_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-10-06 20211006
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-10-06_v8.csv.zip 2021-10-06_v8.csv.zip
{txt}
{com}. unzipfile 2021-10-06_v8.csv.zip, replace
{res}{text:    inflating: 2021-10-06_v8.csv}

{text:successfully unzipped 2021-10-06_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-10-06_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-10-06_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 7,981,209 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(6,651,057 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,209,387 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22648{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}03jan2022{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}766{col 51}{txt}Missing .: {res}0{txt}/{res}120,765

{txt}{col 19}Mean: {res}{ralign 7:22312.3}{txt} = {res}01feb2021{txt}(+ 7 hours)
{col 14}Std. dev.: {res}{ralign 7:201.278}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22029}{ralign 11:   22141}{ralign 11:   22318}{ralign 11:   22487}{ralign 11:   22586}
{col 25}{ralign 9:24apr2020}{ralign 11:14aug2020}{ralign 11:07feb2021}{ralign 11:26jul2021}{ralign 11:02nov2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(186 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(683 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(696 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(709 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(672 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(738 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(686 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(294 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(698 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(474 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(408 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(327 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(723 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(576 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20211006
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211006.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20211006.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20211006.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-10-06_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-10-21 20211021
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-10-21_v8.csv.zip 2021-10-21_v8.csv.zip
{txt}
{com}. unzipfile 2021-10-21_v8.csv.zip, replace
{res}{text:    inflating: 2021-10-21_v8.csv}

{text:successfully unzipped 2021-10-21_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-10-21_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-10-21_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 8,156,208 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(6,796,774 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,236,007 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22663{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}18jan2022{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}781{col 51}{txt}Missing .: {res}0{txt}/{res}123,427

{txt}{col 19}Mean: {res}{ralign 7:22320}{txt} = {res}08feb2021{txt}(+ 24 hours)
{col 14}Std. dev.: {res}{ralign 7:205.543}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22030}{ralign 11:   22145}{ralign 11:   22326}{ralign 11:   22499}{ralign 11:   22600}
{col 25}{ralign 9:25apr2020}{ralign 11:18aug2020}{ralign 11:15feb2021}{ralign 11:07aug2021}{ralign 11:16nov2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(201 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(699 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(711 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(724 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(687 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(753 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(703 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(309 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(715 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(489 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(419 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(341 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(738 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(591 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20211021
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211021.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20211021.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20211021.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-10-21_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-10-27 20211027
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-10-27_v8.csv.zip 2021-10-27_v8.csv.zip
{txt}
{com}. unzipfile 2021-10-27_v8.csv.zip, replace
{res}{text:    inflating: 2021-10-27_v8.csv}

{text:successfully unzipped 2021-10-27_v8.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-10-27_v8.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-10-27_v8.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 8,232,174 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(6,860,189 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,247,417 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22669{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}24jan2022{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}787{col 51}{txt}Missing .: {res}0{txt}/{res}124,568

{txt}{col 19}Mean: {res}{ralign 7:22322.9}{txt} = {res}11feb2021{txt}(+ 22 hours)
{col 14}Std. dev.: {res}{ralign 7:207.31}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22031}{ralign 11:   22147}{ralign 11:   22329}{ralign 11:   22503}{ralign 11:   22605}
{col 25}{ralign 9:26apr2020}{ralign 11:20aug2020}{ralign 11:18feb2021}{ralign 11:11aug2021}{ralign 11:21nov2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(207 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(705 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(717 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(730 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(693 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(759 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(710 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(315 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(722 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(495 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(429 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(348 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(744 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(597 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20211027
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211027.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20211027.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20211027.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-10-27_v8.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-11-03 20211103
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-11-03_v9.csv.zip 2021-11-03_v9.csv.zip
{txt}
{com}. unzipfile 2021-11-03_v9.csv.zip, replace
{res}{text:    inflating: 2021-11-03_v9.csv}

{text:successfully unzipped 2021-11-03_v9.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-11-03_v9.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-11-03_v9.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-2)
{res}{text}(14 vars, 8,298,516 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(6,915,441 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,257,498 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22676{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}31jan2022{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}794{col 51}{txt}Missing .: {res}0{txt}/{res}125,577

{txt}{col 19}Mean: {res}{ralign 7:22325.7}{txt} = {res}14feb2021{txt}(+ 18 hours)
{col 14}Std. dev.: {res}{ralign 7:209.454}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22031}{ralign 11:   22148}{ralign 11:   22331}{ralign 11:   22508}{ralign 11:   22611}
{col 25}{ralign 9:26apr2020}{ralign 11:21aug2020}{ralign 11:20feb2021}{ralign 11:16aug2021}{ralign 11:27nov2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(214 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(713 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(724 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(737 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(700 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(766 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(718 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(322 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(730 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(502 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(435 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(355 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(752 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(604 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20211103
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211103.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20211103.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20211103.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-11-03_v9.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-11-15 20211115
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-11-15_v9.csv.zip 2021-11-15_v9.csv.zip
{txt}
{com}. unzipfile 2021-11-15_v9.csv.zip, replace
{res}{text:    inflating: 2021-11-15_v9.csv}

{text:successfully unzipped 2021-11-15_v9.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-11-15_v9.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-11-15_v9.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-2)
{res}{text}(14 vars, 8,432,199 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(7,026,882 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,277,718 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22688{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}12feb2022{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}806{col 51}{txt}Missing .: {res}0{txt}/{res}127,599

{txt}{col 19}Mean: {res}{ralign 7:22332.1}{txt} = {res}21feb2021{txt}(+ 1 hour)
{col 14}Std. dev.: {res}{ralign 7:212.826}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22032}{ralign 11:   22151}{ralign 11:   22338}{ralign 11:   22517}{ralign 11:   22622}
{col 25}{ralign 9:27apr2020}{ralign 11:24aug2020}{ralign 11:27feb2021}{ralign 11:25aug2021}{ralign 11:08dec2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(226 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(726 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(736 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(749 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(712 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(778 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(731 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(334 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(739 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(514 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(426 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(367 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(765 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(616 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20211115
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211115.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20211115.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20211115.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-11-15_v9.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. * update 2021-11-21 20211121
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-11-21_v9.csv.zip 2021-11-21_v9.csv.zip
{txt}
{com}. unzipfile 2021-11-21_v9.csv.zip, replace
{res}{text:    inflating: 2021-11-21_v9.csv}

{text:successfully unzipped 2021-11-21_v9.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-11-21_v9.csv.zip
{txt}
{com}. 
. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-11-21_v9.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-2)
{res}{text}(14 vars, 8,537,154 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(7,114,339 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,293,591 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22694{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}18feb2022{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}812{col 51}{txt}Missing .: {res}0{txt}/{res}129,224

{txt}{col 19}Mean: {res}{ralign 7:22335.1}{txt} = {res}24feb2021{txt}(+ 3 hours)
{col 14}Std. dev.: {res}{ralign 7:214.716}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22033}{ralign 11:   22153}{ralign 11:   22341}{ralign 11:   22521}{ralign 11:   22628}
{col 25}{ralign 9:28apr2020}{ralign 11:26aug2020}{ralign 11:02mar2021}{ralign 11:29aug2021}{ralign 11:14dec2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(232 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(733 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(742 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(755 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(715 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(784 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(737 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(340 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(746 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(520 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(454 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(373 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(772 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(622 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20211121
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211121.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20211121.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20211121.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-11-21_v9.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-11-29 20211129
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-11-29_v9.csv.zip 2021-11-29_v9.csv.zip
{txt}
{com}. unzipfile 2021-11-29_v9.csv.zip, replace
{res}{text:    inflating: 2021-11-29_v9.csv}

{text:successfully unzipped 2021-11-29_v9.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-11-29_v9.csv.zip
{txt}
{com}. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-11-29_v9.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-2)
{res}{text}(14 vars, 8,628,762 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(7,190,624 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,307,521 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22702{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}26feb2022{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}820{col 51}{txt}Missing .: {res}0{txt}/{res}130,617

{txt}{col 19}Mean: {res}{ralign 7:22339.4}{txt} = {res}28feb2021{txt}(+ 9 hours)
{col 14}Std. dev.: {res}{ralign 7:216.87}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22034}{ralign 11:   22155}{ralign 11:   22345}{ralign 11:   22528}{ralign 11:   22635}
{col 25}{ralign 9:29apr2020}{ralign 11:28aug2020}{ralign 11:06mar2021}{ralign 11:05sep2021}{ralign 11:21dec2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(240 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(742 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(750 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(763 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(726 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(792 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(746 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(348 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(754 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(528 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(462 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(381 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(781 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(630 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20211129
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211129.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20211129.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20211129.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-11-29_v9.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-12-05 20211205
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-12-05_v9.csv.zip 2021-12-05_v9.csv.zip
{txt}
{com}. unzipfile 2021-12-05_v9.csv.zip, replace
{res}{text:    inflating: 2021-12-05_v9.csv}

{text:successfully unzipped 2021-12-05_v9.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-12-05_v9.csv.zip
{txt}
{com}. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-12-05_v9.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-2)
{res}{text}(14 vars, 8,659,245 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(7,216,076 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,312,094 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22708{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}04mar2022{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}826{col 51}{txt}Missing .: {res}0{txt}/{res}131,075

{txt}{col 19}Mean: {res}{ralign 7:22342.1}{txt} = {res}03mar2021{txt}(+ 3 hours)
{col 14}Std. dev.: {res}{ralign 7:218.805}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22034}{ralign 11:   22156}{ralign 11:   22348}{ralign 11:   22532}{ralign 11:   22640}
{col 25}{ralign 9:29apr2020}{ralign 11:29aug2020}{ralign 11:09mar2021}{ralign 11:09sep2021}{ralign 11:26dec2021}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(246 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(748 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(756 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(769 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(732 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(798 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(753 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(354 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(761 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(534 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(468 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(387 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(787 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(636 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20211205
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211205.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20211205.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20211205.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-12-05_v9.csv" 
{txt}

{com}. 
. ******
. 
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. 
. * update 2021-12-13 20211213
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-12-13_v9.csv.zip 2021-12-13_v9.csv.zip
{txt}
{com}. unzipfile 2021-12-13_v9.csv.zip, replace
{res}{text:    inflating: 2021-12-13_v9.csv}

{text:successfully unzipped 2021-12-13_v9.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-12-13_v9.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-12-13_v9.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-2)
{res}{text}(14 vars, 8,648,370 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(7,206,854 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,310,590 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22716{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}12mar2022{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}834{col 51}{txt}Missing .: {res}0{txt}/{res}130,926

{txt}{col 19}Mean: {res}{ralign 7:22346.5}{txt} = {res}07mar2021{txt}(+ 11 hours)
{col 14}Std. dev.: {res}{ralign 7:220.993}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22035}{ralign 11:   22159}{ralign 11:   22353}{ralign 11:   22538}{ralign 11:   22648}
{col 25}{ralign 9:30apr2020}{ralign 11:01sep2020}{ralign 11:14mar2021}{ralign 11:15sep2021}{ralign 11:03jan2022}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(254 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(757 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(763 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(777 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(740 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(806 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(761 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(362 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(771 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(542 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(476 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(395 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(795 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(644 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20211213
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211213.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20211213.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20211213.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-12-13_v9.csv" 
{txt}

{com}. 
. ******
. 
{txt}end of do-file

{com}. do "/var/folders/tt/rr76v7b13d3g_qqsllcdr0rc0000gn/T//SD16821.000000"
{txt}
{com}. 
. 
. * update 2021-12-26 20211226
. 
. ******************************
. 
. * get csv file
. 
. clear all
{res}{txt}
{com}. 
. copy https://mrcdata.dide.ic.ac.uk/global-lmic-reports/2021-12-26_v9.csv.zip 2021-12-26_v9.csv.zip
{txt}
{com}. unzipfile 2021-12-26_v9.csv.zip, replace
{res}{text:    inflating: 2021-12-26_v9.csv}

{text:successfully unzipped 2021-12-26_v9.csv.zip to current directory}
{text:total processed:  1}
{text:        skipped:  0}
{text:      extracted:  1}
{txt}
{com}. erase 2021-12-26_v9.csv.zip
{txt}
{com}. 
. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-12-26_v9.csv", clear varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-2)
{res}{text}(14 vars, 8,842,353 obs)

{com}. 
. 
. 
. keep if scenario == "Maintain Status Quo"
{txt}(7,368,600 observations deleted)

{com}. 
. drop scenario
{txt}
{com}. 
. keep if compartment == "deaths"
{txt}(1,339,897 observations deleted)

{com}. 
. drop compartment
{txt}
{com}. 
. drop y_025 y_25 y_median y_75 y_975 // keeps y_mean
{txt}
{com}. 
. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21883{txt},{res}22729{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}30nov2019{txt},{res}25mar2022{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}847{col 51}{txt}Missing .: {res}0{txt}/{res}133,856

{txt}{col 19}Mean: {res}{ralign 7:22353.4}{txt} = {res}14mar2021{txt}(+ 10 hours)
{col 14}Std. dev.: {res}{ralign 7:224.457}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:22037}{ralign 11:   22163}{ralign 11:   22359}{ralign 11:   22548}{ralign 11:   22659}
{col 25}{ralign 9:02may2020}{ralign 11:05sep2020}{ralign 11:20mar2021}{ralign 11:25sep2021}{ralign 11:14jan2022}
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. rename country loc_grand_name 
{res}{txt}
{com}. 
. replace loc_grand_name = "Brunei" if loc_grand_name == "Brunei Darussalam"
{txt}(267 real changes made)

{com}. replace loc_grand_name = "Cape Verde" if loc_grand_name == "Cabo Verde"
{txt}(770 real changes made)

{com}. replace loc_grand_name = "Congo" if loc_grand_name == "Republic of the Congo"
{txt}(777 real changes made)

{com}. replace loc_grand_name = "Congo DR" if loc_grand_name == "Democratic Republic of Congo"
{txt}(790 real changes made)

{com}. replace loc_grand_name = "Guinea Bissau" if loc_grand_name == "Guinea-Bissau"
{txt}(753 real changes made)

{com}. replace loc_grand_name = "Korea North" if loc_grand_name == "North Korea"
{txt}(89 real changes made)

{com}. replace loc_grand_name = "Korea South" if loc_grand_name == "South Korea"
{txt}(819 real changes made)

{com}. replace loc_grand_name = "Kyrgyzstan" if loc_grand_name == "Kyrgyz Republic"
{txt}(775 real changes made)

{com}. replace loc_grand_name = "Laos" if loc_grand_name == "Lao PDR"
{txt}(375 real changes made)

{com}. replace loc_grand_name = "Palestine" if loc_grand_name == "State of Palestine"
{txt}(777 real changes made)

{com}. replace loc_grand_name = "Saint Lucia" if loc_grand_name == "St. Lucia"
{txt}(555 real changes made)

{com}. replace loc_grand_name = "Saint Vincent and the Grenadines" if loc_grand_name == "St. Vincent and the Grenadines"
{txt}variable {bf}{res}loc_grand_name{sf}{txt} was {bf}{res}str30{sf}{txt} now {bf}{res}str32{sf}
{txt}(489 real changes made)

{com}. replace loc_grand_name = "Timor Leste" if loc_grand_name == "Timor-Leste"
{txt}(402 real changes made)

{com}. replace loc_grand_name = "United States of America" if loc_grand_name == "United States"
{txt}(809 real changes made)

{com}. replace loc_grand_name = "Viet Nam" if loc_grand_name == "Vietnam"
{txt}(657 real changes made)

{com}. 
. 
. 
. drop iso3c report_date version
{txt}
{com}. 
. rename y_mean DayDeaMeRaIMPES02
{res}{txt}
{com}. 
. order loc_grand_name date DayDeaMeRaIMPES02
{txt}
{com}. 
. rename DayDeaMeRaIMPES02 DayDeaMeRaIMPE20211226
{res}{txt}
{com}. 
. qui compress 
{txt}
{com}. 
. save "IMPE 20211226.dta", replace
{txt}{p 0 4 2}
(file {bf}
IMPE 20211226.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IMPE 20211226.dta{rm}
saved
{p_end}

{com}. 
. 
. shell rm -r "2021-12-26_v9.csv" 
{txt}

{com}. 
. ******
. 
. *
. 
. 
. 
. 
. 
. 
. 
. *
. 
. view "log CovidLongitudinal IMPE 2.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/code/download/IMPE/log CovidLongitudinal IMPE 2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}28 Aug 2023, 21:05:51
{txt}{.-}
{smcl}
{txt}{sf}{ul off}