{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/Iran/code/merge/log CovidLongitudinal merge 5.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 May 2022, 07:39:57
{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidLongitudinal merge 5.do"
. 
. * Project: Longitudinal assessment of COVID-19 models                                                                         
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. ***************************************************************************
. 
. 
. * graph error types and models together
. * "graph 12 a C19 daily deaths, $country, average of error measures - error types, models"
. * "graph 12 b C19 daily deaths, $country, average of error measures - models, error types"
. 
. 
. 
. use "CovidLongitudinal merge 2.dta", clear 
{txt}
{com}. 
. 
. keep *Mean2r
{txt}
{com}. 
. keep in 1 
{txt}(731 observations deleted)

{com}. 
. 
. * get equal-length varnames 
. rename ///
> (DDErrorA01_Mean2r DDErrorA02_Mean2r DDErrorA03_Mean2r DDErrorA04_Mean2r DDErrorA05_Mean2r) ///
> (DDErrorrA01_Mean2r DDErrorrA02_Mean2r DDErrorrA03_Mean2r DDErrorrA04_Mean2r DDErrorrA05_Mean2r) 
{res}{txt}
{com}. 
. 
. 
. 
. 
. * get renvars
. 
. 
. 
. /*
> 
> * After 
> net from  http://www.stata-journal.com/software/sj5-4
> Stata might return the following:
> 
> host not found
> http://www.stata-journal.com/software/sj5-4/ either
>   1)  is not a valid URL, or
>   2)  could not be contacted, or
>   3)  is not a Stata download site (has no stata.toc file).
> 
> current site is still http://fmwww.bc.edu/repec/bocode/g/
> 
> * Bad internet connetion is the issue. Try again / later. 
> 
> 
> */
. 
. net from  http://www.stata-journal.com/software/sj5-4
{s6hlp}
.-
http://www.stata-journal.com/software/sj5-4/
^Stata Journal volume 5, issue 4^
.-
{smcl}

DIRECTORIES you could -{hilite:net cd}- to:
{p2colset 5 23 23 2}{...}
{p2col :{net cd ..:..}}Other Stata Journals{p_end}
{p2colreset}{...}

PACKAGES you could -{hilite:net describe}-:
{s6hlp}
    @net:describe dm67_3!dm67_3@            Update:  Numbers of present and missing values
    @net:describe dm88_1!dm88_1@            Update:  Renaming variables, multiply and
                      systematically
    @net:describe gr0021!gr0021@            Double, diagonal, and polar smoothing
    @net:describe sg134_1!sg134_1@           Update: Model selection using akaike information
                      criterion
    @net:describe st0030_2!st0030_2@          Update:  Instrumental variables and GMM:  Estimation
                      and testing
    @net:describe st0037_2!st0037_2@          Update:  Adaptive kernel density estimation
    @net:describe st0067_2!st0067_2@          Update:  Multiple imputation of missing values
    @net:describe st0091!st0091@            Estimation and inference in dynamic unbalanced
                      panel data models with a small number of individuals
    @net:describe st0092!st0092@            Extended generalized linear models: Simulataneous
                      estimation of flexible link and variance functions
    @net:describe st0093!st0093@            Buckley-James method for analyzing censored data,
                      with an application to a heart disease study
    @net:describe st0094!st0094@            Confidence intervals for predicted outcomes in
                      regression models for categorical outcomes
{smcl}
{.-}

{com}. 
. net describe dm88_1

{txt}{.-}
{s6hlp}
package ^dm88_1^ from http://www.stata-journal.com/software/sj5-4
{smcl}
{.-}
{s6hlp}

^TITLE^
      SJ5-4 dm88_1.  Update:  Renaming variables, multiply and...

^DESCRIPTION/AUTHOR(S)^
      Update:  Renaming variables, multiply and systematically
      by Nicholas J. Cox, Durham University, UK
         Jeroen Weesie, Utrecht University, Netherlands
      Support:  n.j.cox@@durham.ac.uk, j.weesie@@fss.uu.nl
      After installation, type help ^renvars^

^INSTALLATION FILES^                               (type ^net install^ ^dm88_1^)
      dm88_1/renvars.ado
      dm88_1/renvars.hlp

^ANCILLARY FILES^                                  (type ^net get^ ^dm88_1^)
      dm88_1/renvars.do
{smcl}
{.-}

{com}. 
. net install dm88_1
checking {hilite:dm88_1} consistency and verifying not already installed...
all files already exist and are up to date.
{txt}
{com}. 
. *
. 
. 
. renvars *, postdrop(7)
{txt}
{com}. 
. save "CovidLongitudinal merge temp.dta", replace 
{txt}file CovidLongitudinal merge temp.dta saved

{com}. 
. 
. gen i = _n
{txt}
{com}. 
. reshape long DDErrorr DDAbsErr DDPerErr DDAbPeEr, i(i) j(A, string)
{txt}(note: j = A01 A02 A03 A04 A05)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}       5
{txt}Number of variables            {res}      21   {txt}->{res}       6
{txt}j variable (5 values)                     ->   {res}A
{txt}xij variables:
{res}DDErrorrA01 DDErrorrA02 ... DDErrorrA05   {txt}->   {res}DDErrorr
DDAbsErrA01 DDAbsErrA02 ... DDAbsErrA05   {txt}->   {res}DDAbsErr
DDPerErrA01 DDPerErrA02 ... DDPerErrA05   {txt}->   {res}DDPerErr
DDAbPeErA01 DDAbPeErA02 ... DDAbPeErA05   {txt}->   {res}DDAbPeEr
{txt}{hline 77}

{com}. 
. rename A model
{res}{txt}
{com}. 
. drop i
{txt}
{com}. 
. replace model = "DELP" if model == "A01"
{txt}variable {bf}model{sf} was {bf}{res}str3{sf}{txt} now {bf}{res}str4{sf}
{txt}(1 real change made)

{com}. replace model = "IHME" if model == "A02"
{txt}(1 real change made)

{com}. replace model = "IMPE" if model == "A03"
{txt}(1 real change made)

{com}. replace model = "LANL" if model == "A04"
{txt}(1 real change made)

{com}. replace model = "SRIV" if model == "A05"
{txt}(1 real change made)

{com}. 
. 
. graph bar DDErrorr DDAbsErr DDPerErr DDAbPeEr, over(model) ///
> bar(1, fcolor(stone) lcolor(stone)) ///
> bar(2, fcolor(sand) lcolor(sand)) ///
> bar(3, fcolor(ltblue) lcolor(ltblue)) ///
> bar(4, fcolor(ebblue) lcolor(ebblue)) ///
> blabel(bar) ytitle("Error measure") yscale(titlegap(2)) ///
> title("C19 daily deaths average of error measures", size(medium) color(black)) ///
> subtitle("Over updates and calendar months; forecast only; $country", size(small)) /// 
> legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Error" 2 "Absolute error" 3 "Percent error" 4 "Absolute percent error" ) size(small) row(1)) 
{res}{txt}
{com}. 
. qui graph export "graph 12 a C19 daily deaths, $country, average of error measures - error types, models.pdf", replace
{txt}
{com}. 
. *
. 
. 
. 
. use "CovidLongitudinal merge temp.dta", clear 
{txt}
{com}. 
. gen i = _n
{txt}
{com}. 
. rename (DDErrorrA01 DDErrorrA02 DDErrorrA03 DDErrorrA04 DDErrorrA05) ///
>        (DDA1E1 DDA2E1 DDA3E1 DDA4E1 DDA5E1) 
{res}{txt}
{com}.            
. rename (DDAbsErrA01 DDAbsErrA02 DDAbsErrA03 DDAbsErrA04 DDAbsErrA05) ///
>        (DDA1E2 DDA2E2 DDA3E2 DDA4E2 DDA5E2) 
{res}{txt}
{com}.            
. rename (DDPerErrA01 DDPerErrA02 DDPerErrA03 DDPerErrA04 DDPerErrA05) ///
>        (DDA1E3 DDA2E3 DDA3E3 DDA4E3 DDA5E3)        
{res}{txt}
{com}. 
. rename (DDAbPeErA01 DDAbPeErA02 DDAbPeErA03 DDAbPeErA04 DDAbPeErA05) ///
>        (DDA1E4 DDA2E4 DDA3E4 DDA4E4 DDA5E4) 
{res}{txt}
{com}.            
. reshape long DDA1 DDA2 DDA3 DDA4 DDA5, i(i) j(E, string)
{txt}(note: j = E1 E2 E3 E4)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}       1   {txt}->{res}       4
{txt}Number of variables            {res}      21   {txt}->{res}       7
{txt}j variable (4 values)                     ->   {res}E
{txt}xij variables:
               {res}DDA1E1 DDA1E2 ... DDA1E4   {txt}->   {res}DDA1
               DDA2E1 DDA2E2 ... DDA2E4   {txt}->   {res}DDA2
               DDA3E1 DDA3E2 ... DDA3E4   {txt}->   {res}DDA3
               DDA4E1 DDA4E2 ... DDA4E4   {txt}->   {res}DDA4
               DDA5E1 DDA5E2 ... DDA5E4   {txt}->   {res}DDA5
{txt}{hline 77}

{com}. 
. gen type = .
{txt}(4 missing values generated)

{com}. replace type = 1 if E == "E1"
{txt}(1 real change made)

{com}. replace type = 2 if E == "E2"
{txt}(1 real change made)

{com}. replace type = 3 if E == "E3"
{txt}(1 real change made)

{com}. replace type = 4 if E == "E4"
{txt}(1 real change made)

{com}. 
. label define type 1 "Error" 2 "Absolute Error" 3 "Percent Error" 4 "Absolute % Error"
{txt}
{com}. label values type type
{txt}
{com}. 
. 
. 
. 
. graph bar DDA1 DDA2 DDA3 DDA4 DDA5, over(type) ///
> bar(1, fcolor(red) lcolor(red)) ///
> bar(2, fcolor(black) lcolor(black)) ///
> bar(3, fcolor(magenta) lcolor(magenta)) ///
> bar(4, fcolor(brown) lcolor(brown)) ///
> bar(5, fcolor(green) lcolor(green)) ///
> blabel(bar) ytitle("Error measure") yscale(titlegap(2)) ///
> title("C19 daily deaths average of error measures", size(medium) color(black)) ///
> subtitle("Over updates and calendar months; forecast only; $country", size(small)) /// 
> legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP" 2 "IHME" 3 "IMPE" 4 "LANL" 5 "SRIV") size(small) row(1)) 
{res}{txt}
{com}. 
. qui graph export "graph 12 b C19 daily deaths, $country, average of error measures - models, error types.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. *
. 
. qui compress
{txt}
{com}. 
. save "CovidLongitudinal merge 3.dta", replace 
{txt}file CovidLongitudinal merge 3.dta saved

{com}. 
. 
. 
. 
. view "log CovidLongitudinal merge 5.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidLongitudinal-main/Iran/code/merge/log CovidLongitudinal merge 5.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}19 May 2022, 07:40:03
{txt}{.-}
{smcl}
{txt}{sf}{ul off}